&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрСервер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
	Если Не ПараметрСервер = Неопределено тогда
		Если Параметры.Свойство("Сервер") тогда	
		//	ПараметрСервер.Значение		= параметры.Сервер;
		//	ПараметрСервер.Использование	= Истина;
			Отчет.Сервер			= Параметры.Сервер;
		КонецЕсли;
		
		
	Иначе
	КонецЕсли;
	
	
	ПараметрНачПер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
	Если  Не ПараметрНачПер = Неопределено тогда
		Если Параметры.Свойство("ДатаНачала") тогда
			//ПараметрНачПер.Значение		= параметры.ДатаНачала;
			//ПараметрНачПер.Использование	= Истина;
			Отчет.ДатаНачала 		= Параметры.ДатаНачала;
 	 
		Иначе
			
			Отчет.ДатаНачала 		= ТекущаяДата() - 24*60*60; // сутки


		КонецЕсли;
	Иначе
		
			Отчет.ДатаНачала 		= ТекущаяДата() - 24*60*60; // сутки

		
	КонецЕсли;
	
	
	ПараметрКонПер					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
	Если Не ПараметрКонПер = Неопределено тогда
		Если Параметры.Свойство("ДатаКонца") тогда
			
			//ПараметрКонПер.Значение		= параметры.ДатаКонца;
			//ПараметрКонПер.Использование	= Истина;
			Отчет.ДатаКонца	= Параметры.ДатаКонца;
		Иначе
			Отчет.ДатаКонца	=  ТекущаяДата();

		КонецЕсли;
	Иначе
		     Отчет.ДатаКонца	= ТекущаяДата(); // сутки
			 
	КонецЕсли;

КонецПроцедуры



