
&НаКлиенте
Процедура СокетПодПроцессорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// отбор по группе в справочнике параметров:
	группа = "РазъёмCPU";
	РаботаССерверамиСлужебный_ат.ОбработкаВыбораПараметровЖелеза(Элемент, ДанныеВыбора, СтандартнаяОбработка, группа);
КонецПроцедуры

&НаКлиенте
Процедура ТипПамятиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	группа = "ТипПамяти";
	РаботаССерверамиСлужебный_ат.ОбработкаВыбораПараметровЖелеза(Элемент, ДанныеВыбора, СтандартнаяОбработка, группа);	
	
КонецПроцедуры


//&НаКлиенте
//Процедура ОбработкаВыбораПараметровЖелеза(Элемент, ДанныеВыбора, СтандартнаяОбработка, группа);
//		
//            СтандартнаяОбработка = Ложь;
//            ПараметрыОтбора = Новый Структура("Отбор",СерверныеКоманды_ат.ПолучитьПараметрыЖелеза(группа));
//			Форма=ПолучитьФорму("Справочник.ПараметрыЖелеза_ат.ФормаВыбора",ПараметрыОтбора,Элемент);
//			// Нужно чтобы выводилось без групп
//			Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
//			Форма.Открыть();

//КонецПроцедуры




//&НаКлиенте
//Процедура ТипПамятиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	// Вставить содержимое обработчика.
//			группа = "ТипПамяти";
//            СтандартнаяОбработка = Ложь;
//            ПараметрыОтбора = Новый Структура("Отбор",СерверныеКоманды_ат.ПолучитьПараметрыЖелеза(группа));
//				
//            Форма=ПолучитьФорму("Справочник.ПараметрыЖелеза_ат.ФормаВыбора",ПараметрыОтбора,Элемент);
//			// Нужно чтобы выводилось без групп
//			Форма.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
//			Форма.Открыть();
//	
//	
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьПараметрыЖелеза(группа)

//            ПараметрыОтбора = Новый Структура;
//		    // Hardcode!!!
//		    ПараметрыОтбора.Вставить("Родитель", справочники.ПараметрыЖелеза_ат.НайтиПоНаименованию(группа));
//			ПараметрыОтбора.Вставить("ЭтоГруппа", Ложь);
//			
//			Возврат ПараметрыОтбора;	
//    КонецФункции