////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с файлами".
// Устаревший модуль. Будет удален в следующей редакции БСП.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
// Устаревший программный интерфейс. Будет удален в следующей редакции БСП.

// Устарела. Будет удалена в следующей редакции БСП.
// Для редактирования настроек сканирования следует использовать
// процедуру РаботаСФайламКлиент.ОткрытьФормуНастройкиСканирования.
//
Функция ПроинициализироватьКомпоненту() Экспорт
	
	Возврат РаботаСФайламиСлужебныйКлиент.ПроинициализироватьКомпоненту();
	
КонецФункции
