
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправляемыеФормы_Клиент_ат.ПриОткрытии(ЭтаФорма, Отказ);
	
	УстановитьПодсказкуВводаПолейОпределенияТарифногоПлана();
	
КонецПроцедуры

#КонецОбласти 

#Область УниверсальныеОбработчикиДействий

&НаКлиенте
Процедура ОбработчикУниверсальныхДействий(Команда)
	
	УправляемыеФормы_Клиент_ат.ДополнительныеДействияФормы(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Функция   ОбработчикУниверсальныхДействий_Сервер(Элемент) Экспорт
	
	Возврат УправляемыеФормы_Сервер_ат.ДополнительныеДействияФормы(ЭтаФорма, Команды[Элемент.Имя]);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Если ПустаяСтрока(Объект.Наименование) Или 
		(Не Объект.Ссылка.Пустая() И Объект.Ссылка.Наименование = Строка(Объект.Ссылка.ТипДоговора)) Тогда
		
		Объект.Наименование = Строка(Объект.ТипДоговора);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПодсказкуВводаПолейОпределенияТарифногоПлана()
	
	ФормулаРасчетаТарифногоПланаПоУмолчанию = Константы.ФормулаРасчетаТарифногоПланаПоУмолчанию_ат.Получить();
	Если ПустаяСтрока(ФормулаРасчетаТарифногоПланаПоУмолчанию) Тогда
		Элементы.ФормулаРасчетаТарифногоПлана.ПодсказкаВвода = "По умолчанию (Значение = 0)";
	Иначе
		Элементы.ФормулаРасчетаТарифногоПлана.ПодсказкаВвода = ФормулаРасчетаТарифногоПланаПоУмолчанию;
	КонецЕсли;
	
	ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию = Константы.ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию_ат.Получить();
	Если ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию = Неопределено Тогда
		Элементы.ПериодДанныхДляОпределенияТарифногоПлана.ПодсказкаВвода = "По умолчанию (За предыдущий месяц)";
	Иначе
		Элементы.ПериодДанныхДляОпределенияТарифногоПлана.ПодсказкаВвода = Строка(ПериодДанныхДляОпределенияТарифногоПланаПоУмолчанию);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДействийПользователя

&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти
