
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	    
	СтандартнаяОбработка = Ложь;
	
	// Представление = Строка(Данные.Ссылка.Наименование)  + "  ("  + Данные.Ссылка.Hostname +
	//Представление = "("  + Данные.Ссылка.Hostname +
	//?((ЗначениеЗаполнено(Данные.Ссылка.DNS_Suffix) и ЗначениеЗаполнено(Данные.Ссылка.DNS_Suffix[0].suffix)),  
	//( "." + Данные.Ссылка.DNS_Suffix[0].suffix), "") + ")" +?((ЗначениеЗаполнено(Данные.Ссылка.IPv4) и ЗначениеЗаполнено(Данные.Ссылка.IPv4[0].IP)), " (" +
	//СтрЗаменить(Данные.Ссылка.IPv4[0].IP.IP," ","") + ")", "");
	
	Представление = Данные.Наименование + " (" + Данные.Ссылка.ВиртуальнаяСеть + ")";
	
	//Представление = Данные.Наименование + " ("+ ?() + ")";
	// HARDCODED!!! ^
	
 КонецПроцедуры
