////////////////////////////////////////////////////////////////////////////////
// Подсистема "Календарные графики"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается при изменении данных производственных календарей
//
// Параметры:
//	- УсловияОбновления - таблица значений с колонками 
//		- КодПроизводственногоКалендаря - код производственного календаря, данные которого изменились,
//		- Год - год, за который изменились данные
//
Процедура ПриОбновленииПроизводственныхКалендарей(УсловияОбновления) Экспорт
	
КонецПроцедуры