
Функция   ПолучитьПредставлениеМесяца(Дата) Экспорт
	
	Возврат Формат(Дата, "ДФ='ММММ гггг'");
	
КонецФункции

Функция   ПолучитьПредставлениеКвартала(Дата) Экспорт
	
	КварталМесяца = (Месяц(Дата) - 1) / 3 + 1;
	
	Возврат Формат(КварталМесяца, "ЧЦ=1") + " квартал " + Формат(Дата, "ДФ=гггг");
	
КонецФункции 

Функция   ПолучитьПредставлениеПолугодия(Дата) Экспорт
	
	ПолугодиеМесяца = ?(Месяц(Дата) <= 6, 1, 2);
	
	Возврат Строка(ПолугодиеМесяца) + " полугодие " + Формат(Дата, "ДФ=гггг");
	
КонецФункции
