
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый()
	   И НЕ ЭтоГруппа Тогда
	
		СсылкаНового = Справочники.Метки_ат.ПолучитьСсылку(Новый УникальныйИдентификатор);
		Ключ = Системный_Сервер_Переопределяемый_ат.ПолучитьЧислокод(Строка(СсылкаНового.УникальныйИдентификатор()));
		УстановитьСсылкуНового(СсылкаНового);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Метки_Сервер_ат.ПроверитьДоступностьМетки(Ссылка, Истина) Тогда
		
		Отказ = Истина;
		Сообщить("Запись метки ограничена настройками");
		
	КонецЕсли;
		
КонецПроцедуры
