////////////////////////////////////////////////////////////////////////////////
// Подсистема "Адресный классификатор".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Проверяет наличие обновлений адресного классификатора на веб сервере
// для тех объектов, которые ранее уже загружались.
//
// Возвращаемое значение
// 	Массив структур, в котором каждая структура имеет формат:
// 		ключ КодАдресногоОбъекта - строка - код адресного объекта
// 		ключ Наименование       - строка - наименование адресного объекта
// 		ключ Сокращение         - строка - сокращение адресного объекта
// 		ключ Индекс             - строка - индекс адресного объекта
// 		ключ ОбновлениеДоступно - Булево
//
Функция ПроверитьОбновлениеАдресныхОбъектовСервер() Экспорт
	
	Возврат АдресныйКлассификаторКлиентСервер.ПроверитьОбновлениеАдресныхОбъектов();
	
КонецФункции

// Возвращает версию адресных объектов, записанную при последнем обновлении
// Если записи об адресном объекте нет - возвращается дата 01.09.2008
// 
// Возвращаемое значение
// 	Массив соответствий: ключ - номер адресного объекта, значение - дата выпуска версии
//
Функция ПолучитьВерсииАдресныхОбъектов() Экспорт
	
	Возврат АдресныйКлассификатор.ПолучитьВерсииАдресныхОбъектов();
	
КонецФункции

// Возвращает структуру, содержащую информацию по адресному объекту
// 
// Параметры
//	КодАдресногоОбъекта - Строка - номер адресного объекта от 1 до 89 + 99 в формате NN
//
// Возвращаемое значение
//	Структура, с ключами: 
//		КодАдресногоОбъекта - Строка - код адресного объекта.
//		Наименование - Строка - наименование адресного объекта.
//		Сокращение - Строка - сокращение адресного объекта.
//		Индекс - Строка - индекс.
//
Функция ИнформацияПоАдресномуОбъекту(КодАдресногоОбъекта) Экспорт
	
	Возврат АдресныйКлассификатор.ИнформацияПоАдресномуОбъекту(КодАдресногоОбъекта);
	
КонецФункции

// Считывает с диска файл версий адресных объектов и возвращает
// версии сведений по адресным объектам
//
// Параметры:
//	ТекстXML - Строка - строка, содержащая текст XML.
//
// Возвращаемое значение:
//	Соответствие с полями:
//		Ключ - Строка - адресный объект.
//		Значение - Дата - дата актуальности адресного объекта.
//
Функция ПолучитьВерсииАдресныхСведений(ТекстXML) Экспорт
	
	Возврат АдресныйКлассификатор.ПолучитьВерсииАдресныхСведений(ТекстXML);
	
КонецФункции