
Перем СоответствиеИменФайловИдентификаторам;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Заявка_ат") Тогда
		
		Наименование = ДанныеЗаполнения.Тезис;
		Содержание	 = ДанныеЗаполнения.ТекстЗаявкиВHTML;
		Основание	 = ДанныеЗаполнения;
		РаботаСHTML_Сервер_ат.ОбработатьКартинкиВHTMLПриСозданииНаОсновании(ДанныеЗаполнения, Содержание);
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеИменФайловИдентификаторам = Новый Соответствие;
	
	РаботаСHTML_Сервер_ат.ЗаменитьИменаКартинокНаИдентификаторыВHTML(
					Содержание, СоответствиеИменФайловИдентификаторам);
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСHTML_Сервер_ат.ЗаписатьПрикрепленныеФайлыКартинок(Ссылка, СоответствиеИменФайловИдентификаторам);
	
КонецПроцедуры

