////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с файлами".
// Устаревший модуль. Будет удален в следующей редакции БСП.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
// Устаревший программный интерфейс. Будет удален в следующей редакции БСП.

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Функция СоздатьФайлНаОсновеФайлаНаДиске(Владелец, ПутьКФайлуНаДиске) Экспорт
	
	Возврат РаботаСФайлами.СоздатьФайлНаОсновеФайлаНаДиске(Владелец, ПутьКФайлуНаДиске);
	
КонецФункции
