
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	МассивОснований = Новый Массив;
	МассивОснований.Добавить(ПараметрКоманды);
	
	СтруктураЗаполнения = Новый Структура;
	СтруктураЗаполнения.Вставить("Основания", МассивОснований);
	
	ПараметрыФормы = Новый Структура("Основание", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.Реализация_ат.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		Новый УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	//МассивЗаполнения = ПолучитьМассивОткрытия(ПараметрКоманды);
	//
	//Для Каждого ЭлементМассиваЗаполнения Из МассивЗаполнения Цикл
	//	
	//	ПараметрыФормы = Новый Структура("Основание", ЭлементМассиваЗаполнения);
	//	ОткрытьФорму("Документ.Реализация_ат.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
	//		Новый УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//	
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьМассивОткрытия(ПараметрКоманды)
	
	МассивЗаполнения = Новый Массив;
	МассивДоговоров = Новый Массив;
	
	Для Каждого СтрокаУслуг Из ПараметрКоманды.Услуги Цикл
		
		Договор = СтрокаУслуг.Договор;
		
		Если МассивДоговоров.Найти(Договор) = Неопределено Тогда
			
			СтруктураЗаполнения = Новый Структура;
			СтруктураЗаполнения.Вставить("Основание", ПараметрКоманды);
			СтруктураЗаполнения.Вставить("Договор", Договор);
			МассивЗаполнения.Добавить(СтруктураЗаполнения);
			
		КонецЕсли;
		
		МассивДоговоров.Добавить(Договор);
		
	КонецЦикла;
	
	Возврат МассивЗаполнения;
	
КонецФункции
