
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестПодключения(Команда)
	
	СтруктураПодключения = Новый Структура();
	СтруктураПодключения.Вставить("Наименование",	 Объект.Наименование);
	СтруктураПодключения.Вставить("ФайловыйРежим",	 Объект.ТипИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("КаталогИБ",		 Объект.КаталогИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("ИмяСервера",		 Объект.ИмяСервераИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("ИмяИБНаСервере",	 Объект.ИмяИнформационнойБазыНаСервереДляПодключения);
	СтруктураПодключения.Вставить("Пользователь",	 Объект.ПользовательИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("Пароль",			 Объект.ПарольИнформационнойБазыДляПодключения);
	СтруктураПодключения.Вставить("ВерсияПлатформы", Объект.ВерсияПлатформыИнформационнойБазыДляПодключения); 
	
	РезультатПодключения = ПодключитьсяКИнформационнойБазе(СтруктураПодключения);
	
	Если РезультатПодключения = "Успешно" Тогда 
		Сообщить("Подключение к информационной базе произошло успешно", СтатусСообщения.Информация);
	Иначе
		Сообщить(РезультатПодключения, СтатусСообщения.Важное);
	КонецЕсли;
    
КонецПроцедуры

&НаСервере
Функция   ПодключитьсяКИнформационнойБазе(СтруктураПодключения)
	
	РезультатПодключения = ПодключениеКИБ_ат.ПодключитьсяКИнформационнойБазе(СтруктураПодключения);
	
	Если ТипЗнч(РезультатПодключения) = Тип("COMОбъект") Тогда
		Возврат "Подключение к информационной базе произошло успешно.";
	Иначе
		Возврат РезультатПодключения;
	КонецЕсли;

КонецФункции	

&НаКлиенте
Процедура ТипИнформационнойБазыДляПодключенияПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовУправления()
	
	Если Объект.ТипИнформационнойБазыДляПодключения Тогда
		ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ТекущаяСтраница = ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ПодчиненныеЭлементы.ПодключениеФайловаяИБ;
	Иначе
		ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ТекущаяСтраница = ЭтаФорма.Элементы.ПанельподключениеИБПриемник.ПодчиненныеЭлементы.ПодключениеСервернаяИБ;
	КонецЕсли;
	                                                                     
КонецПроцедуры


