////////////////////////////////////////////////////////////////////////////////
// Подсистема "Бизнес-процессы и задачи"
// Устаревший модуль. Будет удален в следующей редакции БСП.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
// Устаревший программный интерфейс. Будет удален в следующей редакции БСП.

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура Остановить(Знач ПараметрКоманды) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.Остановить(ПараметрКоманды);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ОстановитьБизнесПроцессИзФормыОбъекта(Форма) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ОстановитьБизнесПроцессИзФормыОбъекта(Форма);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура СделатьАктивным(Знач ПараметрКоманды) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.СделатьАктивным(ПараметрКоманды);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ПродолжитьБизнесПроцессИзФормыОбъекта(Форма) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ПродолжитьБизнесПроцессИзФормыОбъекта(Форма);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ПринятьЗадачиКИсполнению(Знач МассивЗадач) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ПринятьЗадачиКИсполнению(МассивЗадач);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ПринятьЗадачуКИсполнению(Форма, ТекущийПользователь) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ПринятьЗадачуКИсполнению(Форма, ТекущийПользователь);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ОтменитьПринятиеЗадачКИсполнению(Знач МассивЗадач) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ОтменитьПринятиеЗадачКИсполнению(МассивЗадач);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ОтменитьПринятиеЗадачиКИсполнению(Форма) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ОтменитьПринятиеЗадачиКИсполнению(Форма);
	
КонецПроцедуры

// Устарела. Следует использовать вызываемую процедуру. Будет удалена в следующей редакции БСП.
Процедура ОбновитьДоступностьКомандПринятияКИсполнению(Форма) Экспорт
	
	БизнесПроцессыИЗадачиКлиент.ОбновитьДоступностьКомандПринятияКИсполнению(Форма);
	
КонецПроцедуры
