
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Запись.АвторИзменения		= Пользователи.ТекущийПользователь();
		Запись.ДатаИзменения		= ТекущаяДатаСеанса();
		Запись.РезультатВыполнения	= Взаимодействия.ПолучитьОбычныйТекстИзHTML(Запись.РезультатВыполненияВHTML);
		
		Если НЕ РаботаСHTML_КлиентСервер_ат.ТекстЯвляетсяТекстомHTML(Запись.РезультатВыполненияВHTML) Тогда
			
			Запись.РезультатВыполненияВHTML = РаботаСHTML_КлиентСервер_ат.ПреобразоватьОбычныйТекстВHTML(Запись.РезультатВыполненияВHTML);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
