
Функция   ПолучитьИмяРегистраМеток(ТипЗначенияОбъекта, ТипЗначенияМетки) Экспорт
	
	ИмяРегистра = "";
	
	Если ТипЗначенияОбъекта = Тип("СправочникСсылка.БазаЗнаний_ат") Тогда
		
		Если ТипЗначенияМетки = Тип("СправочникСсылка.Метки_ат") Тогда
			ИмяРегистра = "Метки_БазаЗнаний_ат";
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияОбъекта = Тип("ДокументСсылка.Заявка_ат") Тогда
		
		Если ТипЗначенияМетки = Тип("СправочникСсылка.Метки_ат") Тогда
			ИмяРегистра = "Метки_Заявка_ат";
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоИсходящее") Тогда
		
		Если ТипЗначенияМетки = Тип("СправочникСсылка.Метки_ат") Тогда
			ИмяРегистра = "Метки_ЭлектронноеПисьмоИсходящее_ат";
		КонецЕсли;
		
	ИначеЕсли ТипЗначенияОбъекта = Тип("ДокументСсылка.ЭлектронноеПисьмоВходящее") Тогда
		
		Если ТипЗначенияМетки = Тип("СправочникСсылка.Метки_ат") Тогда
			ИмяРегистра = "Метки_ЭлектронноеПисьмоВходящее_ат";
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ИмяРегистра;
	
КонецФункции

Функция   ПолучитьИмяРегистраКлючейМеток(ТипЗначенияМетки) Экспорт
	
	ИмяРегистра = "";
	
	//Если ТипЗначенияМетки = Тип("") Тогда
	//	
	//КонецЕсли;
	
	Возврат ИмяРегистра;
	
КонецФункции

Функция   ПолучитьОсновноеИмяОбъектаМеток() Экспорт
	
	Возврат "Справочник.Метки_ат";
	
КонецФункции

Функция   ПолучитьПолучитьТипОсновногоОбъектаМеток() Экспорт
	
	Возврат Тип("СправочникСсылка.Метки_ат");
	
КонецФункции