
Функция ПолучитьЗаголовокЗадания(Ссылка, МассивЗаявок = Неопределено) Экспорт
	
	СписокТикетов = "";
	
	Если МассивЗаявок = Неопределено Тогда
		
		МассивЗаявок = Планирование_Сервер_ат.ПолучитьРодительскиеЗаявки(Ссылка);
		
	КонецЕсли;
	
	Для Каждого Заявка Из МассивЗаявок Цикл
		
		СписокТикетов = СписокТикетов + "#" + Заявка.Тикет + ", ";
		
	КонецЦикла;
	
	СписокТикетов = Лев(СписокТикетов, СтрДлина(СписокТикетов) - 2); //!!ТУДУ: использовать функцию ВернутьОбрезаннуюСтроку из Строки_ат
	
	Возврат "Задание №" + Ссылка.Номер + " от " + Ссылка.Дата + " по тикет"
		+ ?(МассивЗаявок.Количество() > 1, "ам", "у") + " " + СписокТикетов;

КонецФункции