
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ПерезаписыватьРезультатЗаявки") //!!!TODO - не обнаружено использование где бы то ни было такого доп. свойства. Разобраться
		ИЛИ ДополнительныеСвойства.ПерезаписыватьРезультатЗаявки Тогда
		
		Планирование_Сервер_ат.ЗаписатьРезультатВыполненияЗаявокПриЗаписиЗадания(Ссылка);
		
	КонецЕсли;
	
	Планирование_Сервер_ат.ЗаписатьСвойстваЗадания(Ссылка, Новый Структура); // Для гарантированой записи Автора и Даты изменений.
	
КонецПроцедуры



//!!!!!TODO: осуществлять контроль корректности заполнения полей (реквизитов и записей в РСах)!
//в т.ч. использовать Планирование_Сервер_ат.ПолучитьДочерниеЗадания
