
&НаКлиенте
Процедура ИмяКонтейнераПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	Если Объект.Проведен = Истина тогда 
	Иначе
		
		Если Не ПустаяСтрока(Объект.Действие) Тогда
			ДействиеПриИзмененииНаСервере();
			
			// это элементы вместо Действие = ОтказОтСервера
			// они определены выше, и достуаны на клиенте
			Если Элементы.ВыделенныйСервер.Видимость = Истина И
				Элементы.ВыделенныйСервер.ТолькоПросмотр = Ложь тогда
				сообщение = новый СообщениеПользователю;
				сообщение.Поле = "Объект.ВыделенныйСервер";
				сообщение.Текст = "Необходимо выбрать сервер, который вы хотите удалить!";
				сообщение.Сообщить();
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДействиеПриИзмененииНаСервере()
	Если Объект.Клиент.Пустая() тогда
		Сообщение = новый СообщениеПользователю;
		Сообщение.Поле = "Объект.Клиент";
		Сообщение.Текст = "Поле клиента должно быть заполнено!";
		Сообщение.Сообщить();
	Иначе
		 
		Если Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.АрендаНовогоСервера тогда
			Элементы.РесурсыСервера.Видимость = Истина;
			Элементы.РесурсыСервера.ТолькоПросмотр = Ложь;	
			Элементы.ИмяКонтейнер.Видимость = истина;
			//ГСЧ = Новый ГенераторСлучайныхЧисел();
			//случ = СтрЗаменить(ГСЧ.СлучайноеЧисло(1000, 9999),Символы.НПП,"");
			
			 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ЗаявкаНаАрендуОборудования_ат.Номер) КАК Номер
		|ИЗ
		|	Документ.ЗаявкаНаАрендуОборудования_ат КАК ЗаявкаНаАрендуОборудования_ат";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если РезультатЗапроса.Пустой() тогда
		док = 1;           // это когда список пустой... 
	Иначе
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если  ВыборкаДетальныеЗаписи.номер = Null тогда
			Док = 1;
		Иначе 
			Док = Число(ВыборкаДетальныеЗаписи.номер);
		КонецЕсли;	
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	КонецЕсли;
	    префикс = "D";
		док = Прав(док+1,4);
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		случ = ГСЧ.СлучайноеЧисло(100,999);
		Объект.Hostname = префикс+Прав(Объект.Клиент.код, 3)+"-"+док+"-"+случ;
		Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;
		Элементы.ИмяКонтейнер.Видимость = Истина;
		Элементы.ВыделенныйСервер.ТолькоПросмотр = Истина;
	
//			Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;
				ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.ОтказОтСервера тогда
			Элементы.ИмяКонтейнер.Видимость = ложь;
			Элементы.РесурсыСервера.Видимость = Истина;
			Элементы.ВыделенныйСервер.Видимость = Истина;
			Элементы.ВыделенныйСервер.ТолькоПросмотр = Ложь;
			Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;

		ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.ИзменениеСервера тогда
			Элементы.ИмяКонтейнер.Видимость = ложь;
			Элементы.ИмяКонтейнер.ТолькоПросмотр = Истина;

		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПравоНаАдминистрированиеСерверов = РольДоступна("ОрганизацияАдминистраторСерверов_ат") ИЛИ РольДоступна("ПолныеПрава");
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Элементы.ВыделенныйСервер.Видимость = Ложь;
		Элементы.ИмяКонтейнер.Видимость = Ложь;
		Если ПравоНаАдминистрированиеСерверов  Тогда
			
			Элементы.Клиент.ТолькоПросмотр 				= Ложь;
			Элементы.СтатусИсполнения.ТолькоПросмотр 	= Ложь;
			Элементы.ИмяКонтейнер.ТолькоПросмотр 		= Ложь;
			
		Иначе
			
			Планирование_Сервер_ат.ПервичноеЗаполнениеСотрудникКлиентПодразделение(Пользователь, Объект.Сотрудник, Объект.Клиент, Объект.Подразделение);
			
			Если НЕ Финансы_ат.ИмеетсяДоговорОпределённогоТипа(Объект.Клиент, Перечисления.ТипыДоговоров_ат.АрендаСерверов) Тогда
				
				Сообщить("Отсутствует договор на аренду оборудования");
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
			
			Элементы.Клиент.ТолькоПросмотр			= Истина;
			Элементы.Подразделение.ТолькоПросмотр	= Истина;
			Элементы.Сотрудник.ТолькоПросмотр		= Истина;
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ПравоНаАдминистрированиеСерверов тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СтатусыЗаявокНаАренду_атСрезПоследних.Статус
			|ИЗ
			|	РегистрСведений.СтатусыЗаявокНаАренду_ат.СрезПоследних КАК СтатусыЗаявокНаАренду_атСрезПоследних
			|ГДЕ
			|	СтатусыЗаявокНаАренду_атСрезПоследних.Заявка = &Заявка";
			
			Запрос.УстановитьПараметр("Заявка", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении Тогда
					
					ЭтаФорма.ТолькоПросмотр = Ложь;
					
				Иначе
					
					ЭтаФорма.ТолькоПросмотр = Истина;
					
					Элементы.ВыделенныйСервер.Видимость 		= Истина;
					Элементы.ИмяКонтейнер.ТолькоПросмотр 		= Истина;
					Элементы.Действие.ТолькоПросмотр 			= Истина;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Если Объект.Действие.Пустая() тогда
			Элементы.РесурсыСервера.Видимость = ложь;
			Элементы.ИмяКонтейнер.Видимость = ложь;
		ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.АрендаНовогоСервера тогда
			Элементы.ВыделенныйСервер.Видимость = ложь;
		ИначеЕсли Объект.Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.ОтказОтСервера тогда
			Элементы.ИмяКонтейнер.Видимость = ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПравоНаАдминистрированиеСерверов Тогда
		
		Элементы.Клиент.КнопкаОчистки 			= Истина;
		Элементы.Подразделение.КнопкаОчистки 	= Истина;
		Элементы.Сотрудник.КнопкаОчистки 		= Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделенныйСерверНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ложь;
	Если Объект.Клиент.Пустая() тогда
		
		сообщение = новый СообщениеПользователю;
		сообщение.Поле = "Объект.Клиент";
		сообщение.Текст = "Поле Клиент должно быть заполнено";
		сообщение.Сообщить();
		
	Иначе
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",Истина);
		ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Истина);
		ПараметрыФормы.Вставить("Клиент", Объект.Клиент);
		ОткрытьФорму("Документ.ЗаявкаНаАрендуОборудования_ат.Форма.ФормаВыбораВыделенныхСерверов",ПараметрыФормы,Элемент);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделенныйСерверПриИзменении(Элемент)
	
	ВыделенныйСерверПриИзмененииНаСервере();
	ОбновитьИнтерфейс();
	
КонецПроцедуры

&НаСервере
Процедура ВыделенныйСерверПриИзмененииНаСервере()
	
	Если Объект.ВыделенныйСервер.Пустая() тогда
		
		сообщение = новый СообщениеПользователю;
		сообщение.Поле = "Объект.ВыделенныйСервер";
		сообщение.Текст = "Поле ВыделенныйСервер должно быть заполнено!";
		сообщение.Сообщить();
		
	Иначе
		
		ВыделенныйСервер = Объект.ВыделенныйСервер;
		Объект.Hostname = ВыделенныйСервер.Наименование;
		Элементы.ИмяКонтейнер.Видимость = Истина;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетРесурсов_атОстатки.НаименованиеРесурса,
		|	УчетРесурсов_атОстатки.ЗначениеРесурсаОстаток
		|ИЗ
		|	РегистрНакопления.УчетРесурсовСерверов_ат.Остатки КАК УчетРесурсов_атОстатки
		|ГДЕ
		|	УчетРесурсов_атОстатки.ВыделенныйСервер = &ВыделенныйСервер";
		
		Запрос.УстановитьПараметр("ВыделенныйСервер", ВыделенныйСервер);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.RAM тогда
					Объект.ОбъемПамяти = ВыборкаДетальныеЗаписи.ЗначениеРесурсаОстаток;
				ИначеЕсли ВыборкаДетальныеЗаписи.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат тогда 	
				    Объект.ОбъемHDD = ВыборкаДетальныеЗаписи.ЗначениеРесурсаОстаток;
				ИначеЕсли ВыборкаДетальныеЗаписи.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Core тогда
					Объект.ВыделениеCPU = ВыборкаДетальныеЗаписи.ЗначениеРесурсаОстаток;					
				КонецЕсли;
			КонецЦикла;
			
		Иначе
			
			сообщение = новый СообщениеПользователю;
			//сообщение.Поле = "Объект.ВыделенныйСервер";
			сообщение.Текст = "Ошибка получения данных - ресурсов нет! Выделенный Сервер есть!";
			сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Планирование_Сервер_ат.ПервичноеЗаполнениеСотрудникКлиентПодразделение(Объект.Сотрудник, Объект.Сотрудник, Объект.Клиент, Объект.Подразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	КлиентПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	Объект.Подразделение = Неопределено;
	Объект.Сотрудник = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ПодразделениеПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере()
	
	Объект.Сотрудник = Неопределено;
	
КонецПроцедуры

