Перем ЭтоНовый;


&НаСервере
Процедура ОбработкаПроведения(Отказ, Режим)
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
// такой механизм нужен чтобы видеть все ошибки сразу	
	ошибка = ложь;
	
	Если ПустаяСтрока(Hostname) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ИмяКонтейнера";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать Hostname - Это Имя Вашего выделенного сервера!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ПустаяСтрока(ВыделениеCPU) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ВыделениеCPU";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать кол-во необходимых ядер процессора!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ПустаяСтрока(ОбъемПамяти) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ОбъемПамяти";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать объем памяти!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ПустаяСтрока(ОбъемHDD) тогда
		СП = Новый СообщениеПользователю;
		СП.Поле = "Объект.ОбъемHDD";
		СП.Текст = "В режиме аренды нового сервера, нужно ОБЯЗАТЕЛЬНО! задать объем дискового пространства!";
		СП.Сообщить();
		ошибка = истина;	
	КонецЕсли;
	
	Если ОбъемHDD = 0 или ОбъемПамяти = 0 или ВыделениеCPU = 0 тогда
		СП = Новый СообщениеПользователю;
		СП.Текст = "выбранные ресурсы не могут быть нулевыми!";
		СП.Сообщить();
		ошибка = истина;		
	КонецЕсли;
	
	Если ошибка = Истина тогда 
		Отказ = Истина;
	КонецЕсли;
	
	Если ПустаяСтрока(Тикет) Тогда
		Тикет = "С" + Строки_КлиентСервер_ат.ПолучитьНомерТикета(Номер, Дата);
	КонецЕсли;
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаявокНаАренду_атСрезПоследних.Статус
	|ИЗ
	|	РегистрСведений.СтатусыЗаявокНаАренду_ат.СрезПоследних КАК СтатусыЗаявокНаАренду_атСрезПоследних
	|ГДЕ
	|	СтатусыЗаявокНаАренду_атСрезПоследних.Заявка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если РезультатЗапроса.Пустой() тогда 
		
		// такое возможнго только если документ новый... или при переходи со старой версии маркировки статусов.		
		
	Иначе
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если ВыборкаДетальныеЗаписи.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении тогда
				Отказ = ложь ;
				Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда	
					Если Действие = Перечисления.ДействияПоЗаявкеНаАрендуОборудования_ат.АрендаНовогоСервера тогда
						СтандартнаяОбработка = ложь;
						
						Если Клиент.Пустая() тогда
							СтандартнаяОбработка = ложь;
							СП = Новый СообщениеПользователю;
							СП.Поле = "Объект.Клиент";
							СП.Текст = "Клиент должен быть указан!";
							СП.Сообщить();
							отказ = истина;	
							
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе 
				Сообщить("возможно изменение документа только со статусом НаРассмотрении",СтатусСообщения.Внимание);
				отказ = истина;
			КонецЕсли;
			
		КонецЦикла;	
	КонецЕсли;
	
	
	
	ЭтоНовый = ЭтоНовый();
	
	Если ЭтоНовый Тогда
		
		УстановитьНовыйНомер();
			
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// запись статуса
	Если ЭтоНовый = истина тогда
	ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
	ЗаписьСтатуса.Отбор.Заявка.Установить(Ссылка);
	
	НаборСведений		 		= ЗаписьСтатуса.Добавить();
	НаборСведений.Заявка 		= Ссылка;
	НаборСведений.Период 		= ТекущаяДата();
	НаборСведений.Статус 		= Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении;	
	НаборСведений.Пользователь 	= Сотрудник;
	НаборСведений.Регистратор 	= Ссылка;
	ЗаписьСтатуса.Записать(Истина);
КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

КонецПроцедуры




