////////////////////////////////////////////////////////////////////////////////
// Подсистема "Дополнительные отчеты и обработки"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Подключает внешнюю обработку (отчет).
//
// Подробнее - см. описание ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку().
//
Функция ПодключитьВнешнююОбработку(Ссылка) Экспорт
	
	Возврат ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(Ссылка);
	
КонецФункции

// Создает и возвращает экземпляр внешней обработки (отчета)
//
// Подробнее - см. описание ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки().
//
Функция ПолучитьОбъектВнешнейОбработки(Ссылка) Экспорт
	
	Возврат ДополнительныеОтчетыИОбработки.ПолучитьОбъектВнешнейОбработки(Ссылка);
	
КонецФункции

// Функция возвращает вид публикации, который должен использоваться для
//  конфликтующих дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыПубликацииДополнительныхОтчетовИОбработок.
//
Функция ВидПубликацииДляКонфликтующихОбработок() Экспорт
	
	Возврат ДополнительныеОтчетыИОбработкиПовтИсп.ВидПубликацииДляКонфликтующихОбработок();
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет команду обработки и помещает результат во временное хранилище.
//
// Подробнее - см. описание ДополнительныеОтчетыИОбработки.ВыполнитьКоманду().
//
Функция ВыполнитьКоманду(ПараметрыКоманды, АдресРезультата = Неопределено) Экспорт
	
	Возврат ДополнительныеОтчетыИОбработки.ВыполнитьКоманду(ПараметрыКоманды, АдресРезультата);
	
КонецФункции

