
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
Отчет.КонецПериода = ТекущаяДата();
Отчет.НачалоПериода = Отчет.КонецПериода - 24*60*60; 

//в момент открытия формы мы не знаем какой сервер выберем 
//ПараметрСервер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
//ПараметрСервер.Значение			= Сервер;
//ПараметрСервер.Использование	= Истина;

ПараметрНачПер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
ПараметрНачПер.Значение		= Отчет.НачалоПериода;
ПараметрНачПер.Использование	= Истина;

ПараметрКонПер					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));
ПараметрКонПер.Значение		= Отчет.КонецПериода;
ПараметрКонПер.Использование	= Истина;
	
КонецПроцедуры
