
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр УчетРесурсов_ат Приход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	
	
	Для Каждого ТекСтрокаСервера Из Сервера Цикл
		Если ТекСтрокаСервера.ТипСервера.Аренда = Истина тогда
			//Движение = Движения.УчетРесурсов_ат.Добавить();
			//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//Движение.Период = Дата;
			//Движение.Сервер = ТекСтрокаСервера.ТипСервера;
			
			// CPU_ат
			Для каждого ТекСтрокаCPU из ТекСтрокаСервера.ТипСервера.CPU_ат Цикл
				Движение = Движения.УчетРесурсов_ат.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сервер = ТекСтрокаСервера.ТипСервера;
				// Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Частота;
				//// Вычисляем суммарную частоту всех CPU_ат (частоту * кол-во Ядер * Кол-во Процессоров) 
				//// Переводим из GHz в MHz
				// Движение.ЗначениеРесурса = ТекСтрокаCPU.Процессор.Частота *ТекСтрокаCPU.Процессор.КоличествоЯдер * ТекСтрокаCPU.Количество * 1000;
				Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Core;
				
				Если ТекСтрокаСервера.ТипСервера.HyperThreading = истина тогда
					Движение.ЗначениеРесурса = ТекСтрокаCPU.Процессор.КоличествоЯдер * ТекСтрокаCPU.Количество * 2;
				Иначе
					Движение.ЗначениеРесурса = ТекСтрокаCPU.Процессор.КоличествоЯдер * ТекСтрокаCPU.Количество;
				КонецЕсли;
				
				
			КонецЦикла;
			// RAM
			Для каждого ТекСтрокаRAM из ТекСтрокаСервера.ТипСервера.RAM Цикл
				Движение = Движения.УчетРесурсов_ат.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Сервер = ТекСтрокаСервера.ТипСервера;
				Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.RAM;
				Движение.ЗначениеРесурса = ТекСтрокаRAM.Количество * ТекСтрокаRAM.МодулиПамяти_ат.РазмерМодуля;
			КонецЦикла;
			// HDD_ат
			Если ТекСтрокаСервера.ТипСервера.Лезвие = Ложь тогда
				Для каждого ТекСтрокаHDD из ТекСтрокаСервера.ТипСервера.HDD_ат Цикл
					Движение = Движения.УчетРесурсов_ат.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Сервер = ТекСтрокаСервера.ТипСервера;
					Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат;
					Движение.ЗначениеРесурса = ТекСтрокаHDD.Объем;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
