
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Для Каждого ЭлСтр Из КомпоновщикНастроек.Настройки.Структура Цикл
		
		Если ЭлСтр.Идентификатор = "ИмяПараметра" Тогда
			//	Если ЭлСтр.ИдентификаторОбъекта = "ИмяПараметра" Тогда
			
			//ЭлСтр.Использование = ИспользованиеПараметра; 
		КонецЕсли;
		
	КонецЦикла;
	
	
	Для Каждого Параметр Из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		
		Если Строка(Параметр.Параметр) = "Контрагент" Тогда
			Если Контрагент = Неопределено тогда
				
			Иначе
				Параметр.Значение = Контрагент;
				Параметр.Использование = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры
