
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//Для начала проверим наличие прав на редактирование данного слова.
	РСС = РегистрыСведений.СловарьИсключенийДляПроверкиОрфографии_ат.СоздатьНаборЗаписей();
	РСС.Отбор.Слово.Значение = ЭтотОбъект.ЭтотОбъект.Отбор.Слово.Значение;
	РСС.Отбор.Слово.Использование = Истина;
	РСС.Прочитать();
	
	ТекущийПользователь = Системный_Сервер_Переопределяемый_ат.ТекущийПользователь();
	
	//Если дошли сюда, значит нам хватает прав.
	Если НЕ РСС.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	//Если элемент новый, проставим сразу добавившего и дату добавления.
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		//Сначала проверим слово на неправильные символы.
		МассивНайденных = РегулярныеВыражения_КлиентСервер_ат.НайтиПоШаблону(Запись.Слово, "[^a-zA-Zа-яА-ЯёЁ]");
		Если МассивНайденных.Количество() > 0 Тогда
			//Значит нам суют не слово, а охинею.
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Запись.Добавивший = ТекущийПользователь;
		Запись.ДатаДобавления = ТекущаяДатаСеанса();
	КонецЦикла;
	
КонецПроцедуры