////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными в модели сервиса".
//
////////////////////////////////////////////////////////////////////////////////

// Версия приложения 1С:Предприятия, которая требуется для работы автономного рабочего места.
// Приложение этой версии должно быть установлено на локальном компьютере пользователя.
// Если возвращаемое значение функции не задано, то в качестве требуемой версии приложения
// будет использоваться значение по умолчанию: первые три цифры версии текущего приложения,
// расположенного в Интернете, например, "8.2.15".
// Используется в помощнике создания автономного рабочего места.
//
// Возвращаемое значение:
//  Строка - Версия требуемого приложения 1С:Предприятия в формате
//  <основная версия>.<младшая версия>.<релиз>.<дополнительный номер релиза>.
//  Например, "8.2.15.310".
//
Функция ТребуемаяВерсияПриложения() Экспорт
	
	Возврат "";
	
КонецФункции

// Возвращает адрес ресурса, предназначенного для восстановления пароля учетной записи на сервисе.
// Если адрес не указан, то будет использоваться адрес по умолчанию: https://1cfresh.com/recover
// Используется в помощнике создания автономного рабочего места.
//
// Возвращаемое значение:
//  Строка – адрес ресурса.
//
Функция АдресДляВосстановленияПароляУчетнойЗаписи() Экспорт
	
	Возврат "";
	
КонецФункции
