////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПериодДляРегистровНакопления = КонецПериода(ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	ПериодДляРегистровБухгалтерии = КонецПериода(ТекущаяДатаСеанса());
	
	Элементы.ПериодДляРегистровБухгалтерии.Доступность  = Параметры.РегБухгалтерии;
	Элементы.ПериодДляРегистровНакопления.Доступность = Параметры.РегНакопления;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ПериодДляРегистровНакопленияПриИзменении(Элемент)
	
	ПериодДляРегистровНакопления = КонецПериода(ПериодДляРегистровНакопления);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДляРегистровБухгалтерииПриИзменении(Элемент)
	
	ПериодДляРегистровБухгалтерии = КонецПериода(ПериодДляРегистровБухгалтерии);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатВыбора = Новый Структура("ПериодДляРегистровНакопления, ПериодДляРегистровБухгалтерии");
	ЗаполнитьЗначенияСвойств(РезультатВыбора, ЭтаФорма);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Функция КонецПериода(Дата)
	
	Возврат КонецДня(КонецМесяца(Дата));
	
КонецФункции



