
&НаКлиенте
Процедура ПоставкаПродутовНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Истина);
	
	ОтборПоПоставщику = Новый СписокЗначений;
	ОтборПоПоставщику.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты_ат.ОдинЭс"));
	ОтборПоПоставщику.Добавить(ПредопределенноеЗначение("Справочник.Контрагенты_ат.Microsoft"));
	ПараметрыФормы.Вставить("ОтборПоПоставщику", ОтборПоПоставщику);
	
	//ПараметрыФормы.Вставить("Список", Истина);
	
	ПараметрыФормы.Вставить("ОтборПоВладельцу", Объект.Организация);
	
	ОткрытьФорму("Справочник.ПоставкиПродуктов_ат.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры
