////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	КлючВарианта = Параметры.КлючТекущихНастроек;
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	ОтчетИнформация = ВариантыОтчетов.СформироватьИнформациюОбОтчетеПоПолномуИмени(Параметры.КлючОбъекта);
	Если ТипЗнч(ОтчетИнформация.ТекстОшибки) = Тип("Строка") Тогда
		ВызватьИсключение ОтчетИнформация.ТекстОшибки;
	КонецЕсли;
	ОтчетИнформация.Удалить("ОтчетМетаданные");
	ОтчетИнформация.Удалить("ТекстОшибки");
	ОтчетИнформация.Вставить("ОтчетПолноеИмя", Параметры.КлючОбъекта);
	ОтчетИнформация = Новый ФиксированнаяСтруктура(ОтчетИнформация);
	
	ПолныеПраваНаВарианты = ВариантыОтчетов.ПолныеПраваНаВарианты();
	
	ГруппаДерева = ДеревоВариантовОтчета.ПолучитьЭлементы().Добавить();
	ГруппаДерева.НомерГруппы = 1;
	ГруппаДерева.Наименование = НСтр("ru = 'Используемые'");
	ГруппаДерева.ИндексКартинки = 0;
	ГруппаДерева.КартинкаАвтора = -1;
	
	ГруппаДерева = ДеревоВариантовОтчета.ПолучитьЭлементы().Добавить();
	ГруппаДерева.НомерГруппы = 2;
	ГруппаДерева.Наименование = НСтр("ru = 'Не используемые'");
	ГруппаДерева.ИндексКартинки = 0;
	ГруппаДерева.КартинкаАвтора = -1;
	
	ГруппаДерева = ДеревоВариантовОтчета.ПолучитьЭлементы().Добавить();
	ГруппаДерева.НомерГруппы = 3;
	ГруппаДерева.Наименование = НСтр("ru = 'Помеченные на удаление'");
	ГруппаДерева.ИндексКартинки = 1;
	ГруппаДерева.КартинкаАвтора = -1;
	
	Если НЕ ПолныеПраваНаВарианты Тогда
		Элементы.ПоказыватьЛичныеВариантыОтчетовДругихАвторов.Видимость = Ложь;
		Элементы.ПоказыватьЛичныеВариантыОтчетовДругихАвторовКМ.Видимость = Ложь;
		ПоказыватьЛичныеВариантыОтчетовДругихАвторов = Ложь;
	КонецЕсли;
	
	ЗаполнитьСписокВариантов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	Показывать = Настройки.Получить("ПоказыватьЛичныеВариантыОтчетовДругихАвторов");
	Если Показывать <> ПоказыватьЛичныеВариантыОтчетовДругихАвторов Тогда
		ПоказыватьЛичныеВариантыОтчетовДругихАвторов = Показывать;
		Элементы.ПоказыватьЛичныеВариантыОтчетовДругихАвторов.Пометка = Показывать;
		Элементы.ПоказыватьЛичныеВариантыОтчетовДругихАвторовКМ.Пометка = Показывать;
		ЗаполнитьСписокВариантов();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = ВариантыОтчетовКлиентСервер.ИмяСобытияИзменениеВарианта() Тогда
		ЗаполнитьСписокВариантов();
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	ОтборВключен = ЗначениеЗаполнено(ОтборАвтор);
	
	Группы = ДеревоВариантовОтчета.ПолучитьЭлементы();
	Для Каждого Группа Из Группы Цикл
		ВложенныеВарианты = Группа.ПолучитьЭлементы();
		Для Каждого Вариант Из ВложенныеВарианты Цикл
			Вариант.СкрытОтбором = ОтборВключен И Вариант.Автор <> ОтборАвтор;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДеревоВариантовОтчета

&НаКлиенте
Процедура ДеревоВариантовОтчетаПриАктивизацииСтроки(Элемент)
	Вариант = Элементы.ДеревоВариантовОтчета.ТекущиеДанные;
	Если Вариант = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Вариант.КлючВарианта) Тогда
		ВариантОписание = "";
	Иначе
		ВариантОписание = Вариант.Описание;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовОтчетаПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ОткрытьВариантДляИзменения();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовОтчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовОтчетаПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	
	Вариант = Элементы.ДеревоВариантовОтчета.ТекущиеДанные;
	Если Вариант = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Вариант.КлючВарианта) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		?(Вариант.ИндексКартинки = 4, НСтр("ru = 'Снять с ""%1"" пометку на удаление?'"), НСтр("ru = 'Пометить ""%1"" на удаление?'")),
		Вариант.Наименование);
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да); 
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВариантНаСервере(Вариант.Ссылка, Вариант.ИндексКартинки);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовОтчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьИЗакрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВариантовОтчетаВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ВыбратьИЗакрыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ПоказыватьЛичныеВариантыОтчетовДругихАвторов(Команда)
	ПоказыватьЛичныеВариантыОтчетовДругихАвторов = НЕ ПоказыватьЛичныеВариантыОтчетовДругихАвторов;
	Элементы.ПоказыватьЛичныеВариантыОтчетовДругихАвторов.Пометка = ПоказыватьЛичныеВариантыОтчетовДругихАвторов;
	Элементы.ПоказыватьЛичныеВариантыОтчетовДругихАвторовКМ.Пометка = ПоказыватьЛичныеВариантыОтчетовДругихАвторов;
	
	ЗаполнитьСписокВариантов();
	
	Для Каждого ГруппаДерева Из ДеревоВариантовОтчета.ПолучитьЭлементы() Цикл
		Если ГруппаДерева.СкрытОтбором = Ложь Тогда
			Элементы.ДеревоВариантовОтчета.Развернуть(ГруппаДерева.ПолучитьИдентификатор(), Истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьСписокВариантов();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ВыбратьИЗакрыть()
	Вариант = Элементы.ДеревоВариантовОтчета.ТекущиеДанные;
	Если Вариант = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если Вариант.ИндексКартинки = 4 Тогда
		ТекстВопроса = НСтр("ru = 'Выбранный вариант отчета помечен на удаление.
		|Выполнить выбор этого варианта отчета?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Вариант.КлючВарианта) Тогда
		Закрыть(Новый ВыборНастроек(Вариант.КлючВарианта));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВариантДляИзменения()
	Вариант = Элементы.ДеревоВариантовОтчета.ТекущиеДанные;
	Если Вариант = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Вариант.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ПравоИзмененияВарианта(Вариант, ПолныеПраваНаВарианты) Тогда
		Предупреждение(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Недостаточно прав доступа для изменения варианта ""%1"".'"),
				Вариант.Наименование));
		Возврат;
	КонецЕсли;
	ОткрытьЗначение(Вариант.Ссылка);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПравоИзмененияВарианта(Вариант, ПолныеПраваНаВарианты)
	Возврат ПолныеПраваНаВарианты ИЛИ Вариант.АвторТекущийПользователь;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВариантов()
	
	ТекущийКлючВарианта = КлючВарианта;
	Если ЗначениеЗаполнено(Элементы.ДеревоВариантовОтчета.ТекущаяСтрока) Тогда
		ТекущаяСтрокаДерева = ДеревоВариантовОтчета.НайтиПоИдентификатору(Элементы.ДеревоВариантовОтчета.ТекущаяСтрока);
		Если ЗначениеЗаполнено(ТекущаяСтрокаДерева.КлючВарианта) Тогда
			ТекущийКлючВарианта = ТекущаяСтрокаДерева.КлючВарианта;
		КонецЕсли;
	КонецЕсли;
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетов.Ссылка,
	|	ВариантыОтчетов.Наименование,
	|	ВариантыОтчетов.КлючВарианта,
	|	ВЫРАЗИТЬ(ВариантыОтчетов.Описание КАК СТРОКА(200)) КАК Описание,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.ТипОтчета = &ТипОтчетаВнутренний
	|				И ВариантыОтчетов.Пользовательский = ЛОЖЬ
	|				И ВариантыОтчетов.ВидимостьПоУмолчаниюПереопределена = ЛОЖЬ
	|			ТОГДА ВариантыОтчетов.ПредопределенныйВариант.ВидимостьПоУмолчанию
	|		ИНАЧЕ ВариантыОтчетов.ВидимостьПоУмолчанию
	|	КОНЕЦ КАК ВидимостьПоУмолчанию,
	|	ВариантыОтчетов.Автор,
	|	ВариантыОтчетов.ТолькоДляАвтора,
	|	ВариантыОтчетов.Пользовательский,
	|	ВариантыОтчетов.ПометкаУдаления,
	|	ВариантыОтчетов.ПредопределенныйВариант
	|ПОМЕСТИТЬ втВсеВарианты
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.Отчет = &Отчет
	|	И (ВариантыОтчетов.Пользовательский = ИСТИНА
	|			ИЛИ ВариантыОтчетов.ПометкаУдаления = ЛОЖЬ)
	|	И (ВариантыОтчетов.ТолькоДляАвтора = ЛОЖЬ
	|			ИЛИ ВариантыОтчетов.Автор = &ТекущийПользователь)
	|	И НЕ ВариантыОтчетов.ПредопределенныйВариант В (&ОтключенныеВариантыПрограммы)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВарианты.Ссылка КАК Ссылка,
	|	РазмещениеРазделенного.РазделИлиГруппа КАК Подсистема,
	|	РазмещениеРазделенного.Использование КАК Использование
	|ПОМЕСТИТЬ втРазделенные
	|ИЗ
	|	втВсеВарианты КАК ВсеВарианты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВариантыОтчетов.Размещение КАК РазмещениеРазделенного
	|		ПО ВсеВарианты.Ссылка = РазмещениеРазделенного.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеВарианты.Ссылка КАК Ссылка,
	|	РазмещениеОбщего.Подсистема КАК Подсистема
	|ПОМЕСТИТЬ втОбщие
	|ИЗ
	|	втВсеВарианты КАК ВсеВарианты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПредопределенныеВариантыОтчетов.Размещение КАК РазмещениеОбщего
	|		ПО ВсеВарианты.ПредопределенныйВариант = РазмещениеОбщего.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(табРазделенные.Ссылка, табОбщие.Ссылка) КАК Ссылка,
	|	ЕСТЬNULL(табРазделенные.Подсистема, табОбщие.Подсистема) КАК Подсистема
	|ПОМЕСТИТЬ втПодсистемы
	|ИЗ
	|	втРазделенные КАК табРазделенные
	|		ПОЛНОЕ СОЕДИНЕНИЕ втОбщие КАК табОбщие
	|		ПО табРазделенные.Ссылка = табОбщие.Ссылка
	|			И табРазделенные.Подсистема = табОбщие.Подсистема
	|ГДЕ
	|	(табРазделенные.Использование = ИСТИНА
	|			ИЛИ табРазделенные.Использование ЕСТЬ NULL )
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втВсеВарианты.Ссылка,
	|	втВсеВарианты.Наименование,
	|	втВсеВарианты.КлючВарианта,
	|	втВсеВарианты.ВидимостьПоУмолчанию,
	|	втВсеВарианты.Автор,
	|	втВсеВарианты.ТолькоДляАвтора,
	|	втВсеВарианты.Пользовательский,
	|	втВсеВарианты.ПометкаУдаления,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА втВсеВарианты.ПометкаУдаления = ИСТИНА
	|				ТОГДА 3
	|			КОГДА НастройкиПанели.Видимость = ИСТИНА
	|				ТОГДА 1
	|			КОГДА НастройкиПанели.Видимость = ЛОЖЬ
	|				ТОГДА 2
	|			КОГДА втВсеВарианты.ВидимостьПоУмолчанию = ИСТИНА
	|				ТОГДА 1
	|			КОГДА втВсеВарианты.Автор = &ТекущийПользователь
	|				ТОГДА 1
	|			ИНАЧЕ 2
	|		КОНЕЦ) КАК НомерГруппы,
	|	втВсеВарианты.Описание,
	|	ВЫБОР
	|		КОГДА втВсеВарианты.ПометкаУдаления
	|			ТОГДА 4
	|		КОГДА втВсеВарианты.Пользовательский
	|			ТОГДА 3
	|		ИНАЧЕ 5
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА втВсеВарианты.Автор = &ТекущийПользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АвторТекущийПользователь
	|ИЗ
	|	втПодсистемы КАК втПодсистемы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиВариантовОтчетов КАК НастройкиПанели
	|		ПО втПодсистемы.Ссылка = НастройкиПанели.Вариант
	|			И втПодсистемы.Подсистема = НастройкиПанели.РазделИлиГруппа
	|			И (НастройкиПанели.Пользователь = &ТекущийПользователь)
	|		ПОЛНОЕ СОЕДИНЕНИЕ втВсеВарианты КАК втВсеВарианты
	|		ПО втПодсистемы.Ссылка = втВсеВарианты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	втВсеВарианты.ТолькоДляАвтора,
	|	втВсеВарианты.ПометкаУдаления,
	|	втВсеВарианты.Пользовательский,
	|	втВсеВарианты.Автор,
	|	втВсеВарианты.КлючВарианта,
	|	втВсеВарианты.ВидимостьПоУмолчанию,
	|	втВсеВарианты.Наименование,
	|	втВсеВарианты.Ссылка,
	|	втВсеВарианты.Описание";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Отчет", ОтчетИнформация.Отчет);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	Запрос.УстановитьПараметр("ТипОтчетаВнутренний", Перечисления.ТипыОтчетов.Внутренний);
	Запрос.УстановитьПараметр("ОтключенныеВариантыПрограммы", ВариантыОтчетовПовтИсп.ОтключенныеВариантыПрограммы());
	
	Если ПоказыватьЛичныеВариантыОтчетовДругихАвторов Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "И (ВариантыОтчетов.ТолькоДляАвтора = ЛОЖЬ
		|			ИЛИ ВариантыОтчетов.Автор = &ТекущийПользователь)", "");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	ТаблицаВариантов = Запрос.Выполнить().Выгрузить();
	
	// Добавить предопределенные варианты внешнего отчета в таблицу вариантов (для сортировки при добавлении в дерево).
	Если ОтчетИнформация.ТипОтчета = Перечисления.ТипыОтчетов.Внешний Тогда
		
		Попытка
			ОтчетОбъект = ВнешниеОтчеты.Создать(ОтчетИнформация.ОтчетИмя);
		Исключение
			ВариантыОтчетов.ОшибкаПоВарианту(Неопределено,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Не удалось получить список предопределенных вариантов
					|внешнего отчета ""%1"":'"),
					ОтчетИнформация.ОтчетИмя
				) + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
		КонецПопытки;
		
		Если ОтчетОбъект.СхемаКомпоновкиДанных <> Неопределено Тогда
			Для Каждого ВариантНастроекКД Из ОтчетОбъект.СхемаКомпоновкиДанных.ВариантыНастроек Цикл
				Вариант = ТаблицаВариантов.Добавить();
				Вариант.НомерГруппы    = 1;
				Вариант.КлючВарианта   = ВариантНастроекКД.Имя;
				Вариант.Наименование   = ВариантНастроекКД.Представление;
				Вариант.ИндексКартинки = 5;
				Вариант.АвторТекущийПользователь = Ложь;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	// Вывод вариантов из таблицы в дерево.
	Для Каждого ГруппаДерева Из ДеревоВариантовОтчета.ПолучитьЭлементы() Цикл
		ВариантыГруппы = ТаблицаВариантов.Скопировать(Новый Структура("НомерГруппы", ГруппаДерева.НомерГруппы));
		ВариантыГруппы.Сортировать("Наименование ВОЗР");
		ГруппаДерева.СкрытОтбором = (ВариантыГруппы.Количество() = 0);
		ГруппаДереваНаборСтрок = ГруппаДерева.ПолучитьЭлементы();
		ГруппаДереваНаборСтрок.Очистить();
		Для Каждого СтрокаТаблицы Из ВариантыГруппы Цикл
			Вариант = ГруппаДереваНаборСтрок.Добавить();
			ЗаполнитьЗначенияСвойств(Вариант, СтрокаТаблицы);
			Если Вариант.КлючВарианта = ТекущийКлючВарианта Тогда
				Элементы.ДеревоВариантовОтчета.ТекущаяСтрока = Вариант.ПолучитьИдентификатор();
			КонецЕсли;
			Вариант.КартинкаАвтора = ?(Вариант.ТолькоДляАвтора, -1, 0);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВариантНаСервере(Ссылка, ИндексКартинки)
	ВариантОбъект = Ссылка.ПолучитьОбъект();
	ПометкаУдаления = НЕ ВариантОбъект.ПометкаУдаления;
	Пользовательский = ВариантОбъект.Пользовательский;
	ВариантОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
	ИндексКартинки = ?(ПометкаУдаления, 4, ?(Пользовательский, 3, 5));
КонецПроцедуры

