
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления тогда 
		
		Если НЕ Ссылка.ПометкаУдаления тогда
			
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			Если не Ссылка.Пустая() тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Серверы_ат.Ссылка
				|ИЗ
				|	Справочник.Серверы_ат КАК Серверы_ат
				|ГДЕ
				|	Серверы_ат.ОсновнойIP = &ОсновнойIP";
				
				Запрос.УстановитьПараметр("ОсновнойIP", Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если РезультатЗапроса.Пустой() тогда
				Иначе
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Сообщение = Новый СообщениеПользователю;
						Сообщение.Текст = "Установка пометки удаления невозможна, так как данный IP используется в сервере: " 
						+ ВыборкаДетальныеЗаписи.Ссылка +Символы.ПС + "Для установки пометки удаления необходимо очистить поле ОсновнойIP на сервере";
						Сообщение.Сообщить();
					КонецЦикла;
					Отказ = Истина;
					//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		IP = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло(ПредставлениеIP);
		
	КонецЕсли;
	
КонецПроцедуры
