
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сообщить("Настройка по умолчанию должна называться Стандартная");
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для каждого ПользовательПриемник Из ТекущийОбъект.ПользователиПриемники Цикл
	    Если ТипЗнч(ПользовательПриемник.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		
			НовСтрока = ТекущийОбъект.ПользователиИтоговый.Добавить();
			НовСтрока.Пользователь = ПользовательПриемник.Пользователь;
		ИначеЕсли  ТипЗнч(ПользовательПриемник.Пользователь) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
			Для каждого ПользовательГруппы Из  ПользовательПриемник.Пользователь.ПользователиГруппы Цикл
			
				НовСтрока = ТекущийОбъект.ПользователиИтоговый.Добавить();
				НовСтрока.Пользователь = ПользовательГруппы.Пользователь;
			
			КонецЦикла;
		
			
		
		КонецЕсли;
		
	
	КонецЦикла;
	
	Для каждого ПользовательИсключения Из ТекущийОбъект.ПользователиИсключения Цикл
		ПараметрыОтбора = Новый Структура("Пользователь",ПользовательИсключения.Пользователь);
	    НайденныеСтроки = ТекущийОбъект.ПользователиИтоговый.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()>0 Тогда
			Для каждого найденнаястрока Из НайденныеСтроки Цикл
				
				ТекущийОбъект.ПользователиИтоговый.Удалить(найденнаястрока);
								
			КонецЦикла;	
	    КонецЕсли;
	КонецЦикла;
	
	   ТекущийОбъект.ПользователиИтоговый.Свернуть("Пользователь");
 

	
КонецПроцедуры

