
Процедура ЗаполнитьФайлы(Файлы, Заявка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ Различные
	|	Задание_атПрисоединенныеФайлы.Ссылка,
	|	Задание_атПрисоединенныеФайлы.Наименование,
	|	1 КАК Порядок
	|ИЗ
	|	РегистрСведений.СвязиОбъектов_ат КАК СвязиОбъектов_ат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Задание_атПрисоединенныеФайлы КАК Задание_атПрисоединенныеФайлы
	|		ПО СвязиОбъектов_ат.Объект = Задание_атПрисоединенныеФайлы.ВладелецФайла
	|ГДЕ
	|	СвязиОбъектов_ат.Предок = &Заявка
	|	И НЕ Задание_атПрисоединенныеФайлы.Ссылка ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Заявка_атПрисоединенныеФайлы.Ссылка,
	|	Заявка_атПрисоединенныеФайлы.Наименование,
	|	2
	|ИЗ
	|	Справочник.Заявка_атПрисоединенныеФайлы КАК Заявка_атПрисоединенныеФайлы
	|ГДЕ
	|	Заявка_атПрисоединенныеФайлы.ВладелецФайла = &Заявка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Файлы.Добавить();
		НоваяСтрока.Файл = Выборка.Ссылка;
		НоваяСтрока.ИмяФайла = Выборка.Наименование;
		
	КонецЦикла;
	
КонецПроцедуры