
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Список = Элементы.Путь.СписокВыбора;
	Список.Добавить("http://");
	Список.Добавить("file://");
	Список.Добавить("mailto:");
	Список.Добавить("#");
	
КонецПроцедуры

&НаКлиенте
Процедура URLНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = Путь;
	Диалог.Заголовок = "Выберите файл";
	Диалог.Фильтр = "Все файлы|*.*";

	Если Диалог.Выбрать() Тогда
		
		Путь = Диалог.ПолноеИмяФайла;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПоOK(Команда)
	
	Если Путь <> "" Тогда
		
		Закрыть(Путь);
		
	КонецЕсли;
	
КонецПроцедуры

