////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Объект") Тогда
		Если Параметры.Объект.ПодписанЭЦП Тогда
			ЗаполнитьСписокПодписейОдногоОбъекта(Параметры.Объект, Параметры.УникальныйИдентификатор);
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Подписи") Тогда
		ЗаполнитьСписокПодписейИзМассива(Параметры.Подписи, Параметры.УникальныйИдентификатор);
	КонецЕсли;
	
	БольшеНеСпрашивать = Ложь;
	СохранятьВсеПодписи = Перечисления.ДействияПриСохраненииСЭЦП.СохранятьВсеПодписи;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	МассивВозврата = Новый Массив;
	
	Для Каждого Строка Из ТаблицаПодписей Цикл
		Если Строка.Пометка Тогда
			СтруктураВозврата = Новый Структура("АдресПодписи, КомуВыданСертификат, ИмяФайлаПодписи", 
												Строка.АдресПодписи,
												Строка.КомуВыданСертификат,
												Строка.ИмяФайлаПодписи);
			МассивВозврата.Добавить(СтруктураВозврата);
		КонецЕсли;
	КонецЦикла;
	
	Если БольшеНеСпрашивать Тогда
		ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("ЭЦП", "ДействияПриСохраненииСЭЦП", СохранятьВсеПодписи);
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;	
	
	Закрыть(МассивВозврата);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСписокПодписейОдногоОбъекта(ОбъектСсылка, УникальныйИдентификаторВызывающейФормы)
	
	ПолноеИмяОбъектаСЭЦП = ОбъектСсылка.Метаданные().ПолноеИмя();
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	ЭлектронныеЦифровыеПодписи.КомуВыданСертификат КАК КомуВыданСертификат,
					|	ЭлектронныеЦифровыеПодписи.ДатаПодписи КАК ДатаПодписи,
					|	ЭлектронныеЦифровыеПодписи.Комментарий КАК Комментарий,
					|	ЭлектронныеЦифровыеПодписи.Подпись КАК Подпись,
					|	ЭлектронныеЦифровыеПодписи.Отпечаток КАК Отпечаток,
					|	ЭлектронныеЦифровыеПодписи.УстановившийПодпись КАК УстановившийПодпись,
					|	ЭлектронныеЦифровыеПодписи.НомерСтроки КАК НомерСтроки,
					|	ЭлектронныеЦифровыеПодписи.ИмяФайлаПодписи КАК ИмяФайлаПодписи
					|ИЗ
					|	[ПолноеИмяОбъектаСЭЦП].ЭлектронныеЦифровыеПодписи КАК ЭлектронныеЦифровыеПодписи
					|ГДЕ
					|	ЭлектронныеЦифровыеПодписи.Ссылка = &СсылкаНаОбъект";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ПолноеИмяОбъектаСЭЦП]", ПолноеИмяОбъектаСЭЦП);
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.Параметры.Вставить("СсылкаНаОбъект", ОбъектСсылка);
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		НоваяСтрока = ТаблицаПодписей.Добавить();
		НоваяСтрока.КомуВыданСертификат = ВыборкаЗапроса.КомуВыданСертификат;
		НоваяСтрока.ДатаПодписи = ВыборкаЗапроса.ДатаПодписи;
		НоваяСтрока.Комментарий = ВыборкаЗапроса.Комментарий;
		НоваяСтрока.Отпечаток = ВыборкаЗапроса.Отпечаток;
		НоваяСтрока.УстановившийПодпись = ВыборкаЗапроса.УстановившийПодпись;
		НоваяСтрока.ИмяФайлаПодписи = ВыборкаЗапроса.ИмяФайлаПодписи;
		НоваяСтрока.Неверна = Ложь;
		НоваяСтрока.ИндексКартинки = -1;
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.АдресПодписи = ПоместитьВоВременноеХранилище(ВыборкаЗапроса.Подпись.Получить(), УникальныйИдентификаторВызывающейФормы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокПодписейИзМассива(Подписи, УникальныйИдентификаторВызывающейФормы)
	
	Для Каждого Подпись Из Подписи Цикл
		НоваяСтрока = ТаблицаПодписей.Добавить();
		
		НоваяСтрока.КомуВыданСертификат = Подпись.КомуВыданСертификат;
		НоваяСтрока.ДатаПодписи = Подпись.ДатаПодписи;
		НоваяСтрока.Комментарий = Подпись.Комментарий;
		НоваяСтрока.Отпечаток = Подпись.Отпечаток;
		НоваяСтрока.УстановившийПодпись = Подпись.УстановившийПодпись;
		НоваяСтрока.ИмяФайлаПодписи = Подпись.ИмяФайлаПодписи;
		НоваяСтрока.Неверна = Ложь;
		НоваяСтрока.ИндексКартинки = -1;
		НоваяСтрока.Пометка = Истина;
		НоваяСтрока.АдресПодписи = ПоместитьВоВременноеХранилище(Подпись.Подпись, УникальныйИдентификаторВызывающейФормы);
	КонецЦикла;
	
КонецПроцедуры
