////////////////////////////////////////////////////////////////////////////////
// Подсистема "Настройка порядка элементов".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// См. эту функцию в модуле НастройкаПорядкаЭлементовСлужебный.
Функция ИзменитьПорядокЭлементов(Ссылка, ДинамическийСписок, ОтображениеСписком, Направление) Экспорт
	
	Возврат НастройкаПорядкаЭлементовСлужебный.ИзменитьПорядокЭлементов(
		Ссылка, ДинамическийСписок, ОтображениеСписком, Направление);
	
КонецФункции

