
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЕстьНеВведенныеВключенныеОбъектыАренды() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ не может быть проведён т.к. не все Объекты аренды включённые в выбранный Объект аренды были введены ранее.";
		Сообщение.Сообщить(); 
		
		Возврат;
		
	КонецЕсли;
	
	
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//	"";
	//	
	//Запрос.УстановитьПараметр("", );
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//
	//	
	//
	//КонецЦикла;
	 
	
КонецПроцедуры

Функция   ЕстьНеВведенныеВключенныеОбъектыАренды()
	
	Если ОбъектАренды.ВключенныеОбъектыАренды.Количество() = 0 Тогда
		
		Возврат Ложь;
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ДоступностьАренды_атСрезПоследних.ОбъектАренды
			|ИЗ
			|	РегистрСведений.ДоступностьАренды_ат.СрезПоследних(
			|			&Период,
			|			ОбъектАренды В (&ОбъектыАренды)
			|				И АрендаРазрешена
			|				И (Клиент В (&Клиенты)
			|					ИЛИ Клиент = ЗНАЧЕНИЕ(Справочник.Контрагенты_ат.ПустаяСсылка))) КАК ДоступностьАренды_атСрезПоследних";
			
		Запрос.УстановитьПараметр("Период", Дата);
		Запрос.УстановитьПараметр("ОбъектыАренды", ОбъектАренды.ВключенныеОбъектыАренды.ВыгрузитьКолонку("ОбъектАренды"));
		Запрос.УстановитьПараметр("Клиенты", ОграниченныйСписокКлиентов.ВыгрузитьКолонку("Клиент"));
		
		Возврат НЕ Запрос.Выполнить().Пустой();
		
	КонецЕсли;
	
КонецФункции

