
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() И Объект.Родитель = Справочники.ГруппыШаблоновЗаявок_ат.ВсеШаблоны Тогда
		Объект.Родитель = Неопределено;
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ГруппыШаблоновЗаявок_ат.ВсеШаблоны Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;

	Элементы.Пользователь.Видимость = Объект.Индивидуальная;
	
КонецПроцедуры

&НаКлиенте
Процедура ИндивидуальнаяПриИзменении(Элемент)
	
	Элементы.Пользователь.Видимость = Объект.Индивидуальная;
	
КонецПроцедуры
