
// Обёртки для вызова общего модуля Пользователи. Он может быть из БСП или самостоятельной разработкой.
// 
// В последнем случае в нём необходимо наличие указанных (т.е. с таким же наименованием) в этом модуле процедур и функций
// или изменить вызов в функции Вычислить на нужный.

// !@scriptum: для дальнешей разработки - ориентируемся на БСП.ОМ.ОбщегоНазначенияКлиентСервер.ОбщийМодуль
//  пример вызова:
	//Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
	//	МодульУправлениеКонтактнойИнформацией = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеКонтактнойИнформацией");
	//	Адрес = МодульУправлениеКонтактнойИнформацией.ПолучитьКонтактнуюИнформацияОбъекта(
	//		Получатель, Справочники.ВидыКонтактнойИнформации.EmailПользователя);
	//КонецЕсли;

Функция ТекущийПользователь() Экспорт
	
	Попытка
		Возврат Вычислить("Пользователи.ТекущийПользователь()");
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции
