
Перем СоответствиеИменФайловИдентификаторам;

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеИменФайловИдентификаторам = Новый Соответствие;
	
	РаботаСHTML_Сервер_ат.ЗаменитьИменаКартинокНаИдентификаторыВHTML(
					Содержание, СоответствиеИменФайловИдентификаторам);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСHTML_Сервер_ат.ЗаписатьПрикрепленныеФайлыКартинок(Ссылка, СоответствиеИменФайловИдентификаторам);
	
КонецПроцедуры
