////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Определяет список модулей библиотек и конфигурации, которые
// предоставляют основные сведения о себе: имя, версия, список обработчиков обновления
// а также зависимости от других библиотек.
//
// Состав обязательных процедур модуля см. в разделе
// "ПРОГРАММНЫЙ ИНТЕРФЕЙС" общего модуля ОбновлениеИнформационнойБазыБСП.
//
// Параметры:
//  МодулиПодсистем - Массив - имена серверных общих модулей библиотек и основной конфигурации.
//                             Например: ОбновлениеИнформационнойБазыБСП.
//                    
// Примечание: модуль Библиотеки стандартных подсистем ОбновлениеИнформационнойБазыБСП 
// не требуется явно добавлять в массив МодулиПодсистем.
//
Процедура ПриДобавленииПодсистем(МодулиПодсистем) Экспорт
	
	
	
КонецПроцедуры
