////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	МассивСтруктурСертификатов = Параметры.МассивСтруктурСертификатов;
	
	ФайлСсылка = Неопределено;
	
	Если Параметры.Свойство("ФайлСсылка") Тогда
		ФайлСсылка = Параметры.ФайлСсылка;
	КонецЕсли;
	
	ОтпечатокЛичногоСертификатаДляШифрования = "";
	Если Параметры.Свойство("ОтпечатокЛичногоСертификатаДляШифрования") Тогда
		ОтпечатокЛичногоСертификатаДляШифрования = Параметры.ОтпечатокЛичногоСертификатаДляШифрования;
	КонецЕсли;
	
	Заголовок = 
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Зашифровать ""%1""'"),
				Строка(ФайлСсылка) );
	
	Для Каждого СтруктураСертификата Из МассивСтруктурСертификатов Цикл
		НоваяСтрока = ТаблицаСертификатов.Добавить();
		
		НоваяСтрока.КомуВыдан = СтруктураСертификата.КомуВыдан;
		НоваяСтрока.КемВыдан = СтруктураСертификата.КемВыдан;
		НоваяСтрока.ДействителенДо = СтруктураСертификата.ДействителенДо;
		НоваяСтрока.Отпечаток = СтруктураСертификата.Отпечаток;
		
		Если СтруктураСертификата.Свойство("Пометка") Тогда
			НоваяСтрока.Пометка = СтруктураСертификата.Пометка;
		КонецЕсли;
		
		Если НоваяСтрока.Отпечаток = ОтпечатокЛичногоСертификатаДляШифрования Тогда
			НоваяСтрока.ЛичныйСертификатШифрования = Истина;
			НоваяСтрока.Пометка = Истина;
		КонецЕсли;
		
		ЭлектроннаяЦифроваяПодпись.ЗаполнитьНазначениеСертификата(СтруктураСертификата.Назначение, НоваяСтрока.Назначение);
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	ОбработкаВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСертификат(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаСертификатов.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ВыбранныйСертификат = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьСертификатПоОтпечатку(ТекущиеДанные.Отпечаток);
	
	СтруктураСертификата = ЭлектроннаяЦифроваяПодписьКлиентСервер.ЗаполнитьСтруктуруСертификата(ВыбранныйСертификат);
	Если СтруктураСертификата <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("СтруктураСертификата, Отпечаток", СтруктураСертификата, ТекущиеДанные.Отпечаток);
		ОткрытьФорму("ОбщаяФорма.СертификатЭЦП", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбработкаВыбора()
	
	МассивВозврата = Новый Массив;
	Для Каждого СтрокаТаблицыЗначений Из ТаблицаСертификатов Цикл
		Если СтрокаТаблицыЗначений.Пометка Тогда 
			ВыбранныйСертификат = ЭлектроннаяЦифроваяПодписьКлиент.ПолучитьСертификатПоОтпечатку(СтрокаТаблицыЗначений.Отпечаток);
			МассивВозврата.Добавить(ВыбранныйСертификат);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивВозврата.Количество() = 0 Тогда
		Предупреждение(НСтр("ru = 'Не выбран ни один сертификат.'"));
		Возврат;
	КонецЕсли;
	
	Закрыть(МассивВозврата);
	
КонецПроцедуры
