
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("Заявка");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = "Исполнение " + Число(Строки_КлиентСервер_ат.ВернутьТолькоЦифры(Данные.Номер))
		+ " от " + Формат(Данные.Дата, "ДФ=dd.MM.yy") + ?(Данные.Заявка.Пустая(), "", " (" + Данные.Заявка + ")");;
	
КонецПроцедуры
