////////////////////////////////////////////////////////////////////////////////
// Подсистема "Адресный классификатор".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Проверяет наличие обновлений адресного классификатора на веб сервере
// для тех объектов, которые ранее уже загружались.
//
// Возвращаемое значение
// 	Массив структур, в котором каждая структура имеет формат:
// 		ключ КодАдресногоОбъекта - строка - код адресного объекта
// 		ключ Наименование       - строка - наименование адресного объекта
//	 	ключ Сокращение         - строка - сокращение адресного объекта
// 		ключ Индекс             - строка - индекс адресного объекта
// 		ключ ОбновлениеДоступно - Булево
//
Функция ПроверитьОбновлениеАдресныхОбъектов() Экспорт
	
	ВерсииХранимыхСведений = АдресныйКлассификаторВызовСервера.ПолучитьВерсииАдресныхОбъектов();
	
	Результат = ПолучитьВерсииДоступныеНаСайте1С();
	Если НЕ Результат.Статус Тогда
		Возврат Результат;
	КонецЕсли;
	ДоступныеВерсии = Результат.ДоступныеВерсии;
	
	ДоступныеОбновления = Новый Массив;
	
	Для Каждого ЭлементХранимаяВерсия Из ВерсииХранимыхСведений Цикл
		АдресныйОбъект = ЭлементХранимаяВерсия.Представление;
		АдресныеСведения = АдресныйКлассификаторВызовСервера.ИнформацияПоАдресномуОбъекту(АдресныйОбъект);
		АдресныеСведения.Вставить("ОбновлениеДоступно",
			?(ТипЗнч(ДоступныеВерсии[АдресныйОбъект]) <> Тип("Дата"),
			  Ложь,
			  ДоступныеВерсии[АдресныйОбъект] > Дата(ЭлементХранимаяВерсия.Значение)));
		ДоступныеОбновления.Добавить(АдресныеСведения);
	КонецЦикла;
	
	// Подготовка версии последнего обновления КЛАДР на сайте 1С
	Результат = ЗаполнитьРезультат(ДоступныеОбновления);
	//
	ВерсияПоследнегоОбновленияКЛАДР = ДоступныеВерсии["V0"];
	Если ТипЗнч(ВерсияПоследнегоОбновленияКЛАДР) <> Тип("Дата") Тогда
		ВерсияПоследнегоОбновленияКЛАДР = '00000000';
	КонецЕсли;
	Результат.Вставить("ВерсияПоследнегоОбновленияКЛАДР", ВерсияПоследнегоОбновленияКЛАДР);
	
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Экспортные служебные процедуры и функции

// Получает версии доступные на сайте 1С.
//
// Возвращаемое значение:
//	Структура:
//		ключ Статус - Булево - статус наличия доступных версий.
//		ключ ДоступныеВерсии - Соответствие - доступные версии.
//
Функция ПолучитьВерсииДоступныеНаСайте1С() Экспорт
	
	URLСтрока = ПутьКФайлуОписаниюДанныхКЛАДР();
	
#Если Клиент Тогда
	РезультатПолученияФайлов = ПолучениеФайловИзИнтернетаКлиент.СкачатьФайлНаКлиенте(URLСтрока);
#Иначе
	РезультатПолученияФайлов = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(URLСтрока);
#КонецЕсли
	
	Если Не РезультатПолученияФайлов.Статус Тогда
		Возврат РезультатПолученияФайлов;
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(РезультатПолученияФайлов.Путь);
	ТекстXML = ТекстовыйДокумент.ПолучитьТекст();
	
	УдалитьФайлы(РезультатПолученияФайлов.Путь);
	
	ДоступныеВерсии = АдресныйКлассификаторВызовСервера.ПолучитьВерсииАдресныхСведений(ТекстXML);
	
	Возврат Новый Структура("Статус, ДоступныеВерсии", Истина, ДоступныеВерсии);
	
КонецФункции

// Путь к файлу на веб сервере, содержащему информацию по версиям адресных сведений
//
// Возвращаемое значение:
//	Строка - путь к файлу описания данных КЛАДР.
//
Функция ПутьКФайлуОписаниюДанныхКЛАДР() Экспорт
	
	Возврат "http://downloads.1c.ru/ipp/ITSREPV/V8Update/Configs/kladr/versions.xml";
	
КонецФункции

// Формирует структуру с ключами Статус (Истина) и Значение.
//
// Параметры:
//	Значение - ПроизвольныйТип - передаваемое значение. 
//	Статус - Булево - передаваемый статус.
//
// Возвращаемое значение:
//	Структура - возвращаемая структура.
//	
Функция ЗаполнитьРезультат(знач Значение, знач Статус = Истина)
	
	Если Статус Тогда
		Возврат Новый Структура("Статус, Значение", Истина, Значение);
	Иначе
		Возврат Новый Структура("Статус, СообщениеОбОшибке", Ложь, Значение);
	КонецЕсли;
	
КонецФункции

// Функция возвращает структуру с набором полей как у записи регистра сведений
//		АдресныйКлассификатор с пустым набором значений
//
// Возвращаемое значение:
//		Структура - структуру с набором полей как у записи регистра сведений
//			АдресныйКлассификатор с пустым набором значений
//
Функция ПустаяСтруктураАдреса() Экспорт
	
	СтруктураАдреса =  Новый Структура;
	СтруктураАдреса.Вставить("Код", 0);
	СтруктураАдреса.Вставить("Наименование", "");
	СтруктураАдреса.Вставить("Сокращение", "");
	СтруктураАдреса.Вставить("ТипАдресногоЭлемента", 0);
	СтруктураАдреса.Вставить("Индекс", "");
	СтруктураАдреса.Вставить("КодАдресногоОбъектаВКоде", 0);
	СтруктураАдреса.Вставить("КодРайонаВКоде", 0);
	СтруктураАдреса.Вставить("КодГородаВКоде", 0);
	СтруктураАдреса.Вставить("КодНаселенногоПунктаВКоде", 0);
	СтруктураАдреса.Вставить("КодУлицыВКоде", 0);
	СтруктураАдреса.Вставить("ПризнакАктуальности", 0);
	
	Возврат СтруктураАдреса;
	
КонецФункции

