
#Область ОбработчикиСтандартныхСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ТекущийПродукт");
	Поля.Добавить("ТекущаяВерсия");
	//Поля.Добавить("РольСервераРазмещения");
	//Поля.Добавить("СерверРазмещения");
	Поля.Добавить("Описание");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПредСтрока = Данные.Наименование + ?(ЗначениеЗаполнено(Данные.Описание), " - " + Данные.Описание, "");
	
	ДобавленаСкобка = Ложь;
	
	Если СтрНайти(ВРег(Строка(Данные.ТекущийПродукт)), ВРег(Данные.Наименование)) = 0
		 И СтрНайти(ВРег(Строка(Данные.ТекущийПродукт.НаименованиеПолное)), ВРег(Данные.Наименование)) = 0
		 И СтрНайти(ВРег(Данные.Наименование), ВРег(Строка(Данные.ТекущийПродукт))) = 0
		 И СтрНайти(ВРег(Данные.Наименование), ВРег(Строка(Данные.ТекущийПродукт.НаименованиеПолное))) = 0
		 Тогда
		
		ПредСтрока = ПредСтрока + " (" + Строка(Данные.ТекущийПродукт);
		
		ДобавленаСкобка = Истина;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.ТекущаяВерсия) Тогда
		
		Если ДобавленаСкобка Тогда
			
			ПредСтрока = ПредСтрока + ", ";
			
		Иначе
			
			ПредСтрока = ПредСтрока + " ("; 
			
		КонецЕсли;
		
		ПредСтрока = ПредСтрока + Данные.ТекущаяВерсия + ")";
		
	Иначе
		
		Если ДобавленаСкобка Тогда
			
			ПредСтрока = ПредСтрока + ")";
			
		КонецЕсли;
		
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(Данные.РольСервераРазмещения) Тогда
	//	
	//	ПредСтрока = ПредСтрока + " на " + Строка(Данные.РольСервераРазмещения)
	//	
	//ИначеЕсли ЗначениеЗаполнено(Данные.СерверРазмещения) Тогда
	//	
	//	ПредСтрока = ПредСтрока + " на " + Строка(Данные.СерверРазмещения)
	//	
	//КонецЕсли;
	
	Представление = ПредСтрока;
		
		//?(ЗначениеЗаполнено(Данные.РольСервераРазмещения.Наименование),
		//	Данные.РольСервераРазмещения.Наименование + " <" + Строка(Данные.СерверРазмещения) + ">",
		//	Строка(Данные.РольСервераРазмещения.ВидРолиСервера) + " <" + Строка(Данные.СерверРазмещения) + ">"),
		//?(ЗначениеЗаполнено(Данные.СерверРазмещения), "<" + Строка(Данные.СерверРазмещения) + ">", ""))
	
КонецПроцедуры

#КонецОбласти
