
Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Наименование = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С Тогда
		
		ПроверяемыеРеквизиты.Добавить("ТекущаяВерсия");
		
	Иначе
		
		КлиентАрендатор = Неопределено;
		
	КонецЕсли;
	
	Если НЕ УчетПродуктов_ат.ДоступнаМножественностьЭкземпляров(ТекущийПродукт.ТипПродукта) Тогда
		
		Количество = 1;
		
	КонецЕсли;
	
	ТипыРолейСерверов = УчетПродуктов_ат.ПолучитьТипыРолейСерверовПоТипуПродукта(ТекущийПродукт.ТипПродукта);
	
	Если ТипыРолейСерверов.Количество() = 0 Тогда
		
		//СерверРазмещения = Неопределено;
		РольСервераРазмещения = Неопределено;
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СерверРазмещения"));
		
	Иначе
		
		ПроверитьНаличиеНеобходимыхЭкземпляровПродуктов(Отказ);
		ПроверитьНаличиеНеобходимогоКоличестваПродуктов(Отказ);
		
		Если Отказ Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		//ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Платформа1С
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверMSSQL
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверPostgreSQL
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверOracle
		ИЛИ ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверIBMDB2 Тогда
		
		ПроверяемыеРеквизиты.Добавить("РольСервераРазмещения");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Ссылка.Пустая() И Ссылка.ТекущийПродукт.ТипПродукта <> ТекущийПродукт.ТипПродукта Тогда
		
		ИмяРегистра = УчетПродуктов_ат.ПолучитьИмяРегистраСпецификацииЭкземпляраПродукта(Ссылка.ТекущийПродукт.ТипПродукта);
		
		Если ИмяРегистра = Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
		Попытка
			
			НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭкземплярПродукта.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			НаборЗаписей.Записать();
			
		Исключение
			
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ПометкаУдаления Тогда
		
		ПроверитьНаличиеНеобходимыхЭкземпляровПродуктов(Отказ);
		ПроверитьНаличиеНеобходимогоКоличестваПродуктов(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеНеобходимогоКоличестваПродуктов(Отказ)
	
	ОграниченияПоКоличеству = УчетПродуктов_ат.ОпределитьДоступноеКоличествоЭкземпляров(Владелец, Ссылка);
	
	Если ОграниченияПоКоличеству.КоличествоОграничено
		 И ОграниченияПоКоличеству.ДоступноеКоличество < Количество Тогда
		
		Отказ = Истина;
		
		Сообщить("Количество экземпляров не может превышать количество в продукте." + Символы.ПС +
			"Максимальное доступное количество экземпляров: " + ОграниченияПоКоличеству.ДоступноеКоличество + "шт.");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьНаличиеНеобходимыхЭкземпляровПродуктов(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЭкземплярыПродуктов_ат.Ссылка
		|ИЗ
		|	Справочник.ЭкземплярыПродуктов_ат КАК ЭкземплярыПродуктов_ат
		|ГДЕ
		|	ЭкземплярыПродуктов_ат.СерверРазмещения = &СерверРазмещения
		|	И ЭкземплярыПродуктов_ат.ТекущийПродукт.ТипПродукта = &ТипПродукта";
		
	Запрос.УстановитьПараметр("СерверРазмещения", СерверРазмещения);
	
	ТекстСообщения = "";
	
	////
	
	//????	//Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С Тогда
	//	
	//	Запрос.УстановитьПараметр("ТипПродукта", Перечисления.ТипыПродуктов_ат.Платформа1С);
	//	//ТекстСообщения = "На сервере " + СерверРазмещения + " отсутствует размещённый экземпляр технологической платформы 1С!";
	//	ТекстСообщения = "На " + РольСервераРазмещения + " отсутствует размещённый экземпляр технологической платформы 1С!";
	//	
	//КонецЕсли;
		
	Если ТекущийПродукт.ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		И РольСервераРазмещения.ВидРолиСервера.ТипРолиСервера = Перечисления.ТипыРолейСерверов_ат.Сервер1С Тогда
		
		Запрос.УстановитьПараметр("ТипПродукта", Перечисления.ТипыПродуктов_ат.Сервер1С);
		//ТекстСообщения = "На сервере " + СерверРазмещения + " отсутствует размещённый экземпляр сервера 1С!";
		ТекстСообщения = "На " + СерверРазмещения + " отсутствует размещённый экземпляр сервера 1С!";
		
	КонецЕсли;
	
	////
	
	Если ТекстСообщения = "" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить(); 
		
	КонецЕсли;	
	
КонецПроцедуры
