
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	
	ПараметрыТарифа = Параметры.ПараметрыТарифа;
	
	Прейскурант.Загрузить(Обработка.ПолучитьЦеныНоменклатур(ПараметрыТарифа.Дата, , ПараметрыТарифа.Организация,
															ПараметрыТарифа.ВидДоговора, ПараметрыТарифа.Клиент,
															ПараметрыТарифа.Договор, ПараметрыТарифа.Проект,
															ПараметрыТарифа.ЗначениеОпределяющееИнтервал));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Прейскурант

&НаКлиенте
Процедура ПрейскурантКоличествоПриИзменении(Элемент)
	
	ТекДанные = Элементы.Прейскурант.ТекущиеДанные;
	
	ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрейскурантПриИзменении(Элемент)
	
	Элементы.Итого.Заголовок = "Итого: " + Прейскурант.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти
