
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	//ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Продукт", ПараметрКоманды));
	//ПараметрыОткрытия.Вставить("Список", Истина);
	ПараметрыОткрытия.Вставить("Продукт", ПараметрКоманды);
	
	ОткрытьФорму("Справочник.ПоставкиПродуктов_ат.ФормаСписка", ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
