
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
ПараметрСервер 					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
ПараметрСервер.Значение		= Сервер;
ПараметрСервер.Использование	= Истина;

ПараметрНачПер 					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
ПараметрНачПер.Значение		= НачалоПериода;
ПараметрНачПер.Использование	= Истина;

ПараметрКонПер					= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));
ПараметрКонПер.Значение		= КонецПериода;
ПараметрКонПер.Использование	= Истина;

ТипыРесурсов = новый СписокЗначений;
ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.CPU_proc);
ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.RAM_proc);
ТипыРесурсов.Добавить(Перечисления.ТипыРесурсовWMI_ат.HDD_proc);

ПараметрТипРес1						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипыРесурсов"));
ПараметрТипРес1.Значение			= ТипыРесурсов;
ПараметрТипРес1.Использование	= Истина;


//ТипРесурса1 = Перечисления.ТипыРесурсовWMI_ат.CPU_proc;
//ТипРесурса2 = Перечисления.ТипыРесурсовWMI_ат.RAM_proc;
//ТипРесурса3 = Перечисления.ТипыРесурсовWMI_ат.HDD_proc;

//ПараметрТипРес1						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипРесурса1"));
//ПараметрТипРес1.Значение			= ТипРесурса1;
//ПараметрТипРес1.Использование	= Истина;

//ПараметрТипРес2						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипРесурса2"));
//ПараметрТипРес2.Значение			= ТипРесурса2;
//ПараметрТипРес2.Использование	= Истина;

//ПараметрТипРес3						= КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ТипРесурса3"));
//ПараметрТипРес3.Значение			= ТипРесурса3;
//ПараметрТипРес3.Использование	= Истина;

КонецПроцедуры
