////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	СохранятьСРасшифровкой = 1;
	Заголовок = Параметры.Заголовок;
	
	Если Параметры.Свойство("ПредставленияСертификатов") Тогда
		ПредставленияСертификатов = Параметры.ПредставленияСертификатов;
	Иначе
		Элементы.ПредставленияСертификатов.Видимость = Ложь;
	КонецЕсли;
	
	РасширениеДляЗашифрованныхФайлов = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ЭЦП", "РасширениеДляЗашифрованныхФайлов");
	Если ПустаяСтрока(РасширениеДляЗашифрованныхФайлов) Тогда
		РасширениеДляЗашифрованныхФайлов = "p7m";
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СохранятьСРасшифровкойПриИзменении(Элемент)
	Элементы.Пароль.Доступность = (СохранятьСРасшифровкой = 1);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	ВозвратПароль = Пароль;
	
	Если ПустаяСтрока(Пароль) И НЕ ПустаяСтрока(Элементы.Пароль.ТекстРедактирования) Тогда
		ВозвратПароль = Элементы.Пароль.ТекстРедактирования;
	КонецЕсли;	
	
	СтруктураВозврата = Новый Структура("Пароль, СохранятьСРасшифровкой, РасширениеДляЗашифрованныхФайлов", 
		ВозвратПароль, СохранятьСРасшифровкой, РасширениеДляЗашифрованныхФайлов);
	Закрыть(СтруктураВозврата);
КонецПроцедуры

