
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Отчеты_ат.ПриКомпоновкеРезультата(ЭтотОбъект);
	
	Если ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ТаблицаКомпоновкиДанных") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Колонка Из КомпоновщикНастроек.Настройки.Структура[0].Колонки Цикл
		
		Если Колонка.Имя = "ПланируемаяВыручка" Тогда
			
			Колонка.Использование = НЕ СкрытьПлановуюВыручку;
			
		ИначеЕсли Колонка.Имя = "Затраты" Тогда
			
			Колонка.Использование = НЕ СкрытьЗатараты;
			
		ИначеЕсли Колонка.Имя = "Выручка" Тогда
			
			Колонка.Использование = НЕ СкрытьВыручку;
			
		ИначеЕсли Колонка.Имя = "Доход" Тогда
			
			Колонка.Использование = НЕ СкрытьДоход;
			
		ИначеЕсли Колонка.Имя = "ТекущаяПрибыль" Тогда
			
			Колонка.Использование = НЕ СкрытьТекущуюПрибыль;
			
		ИначеЕсли Колонка.Имя = "Прибыль" Тогда
			
			Колонка.Использование = НЕ СкрытьПрибыль;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
