
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	БазаДанных = Константы.БухгалтерияДляСинхронизации_ат.Получить();
	
	Если БазаДанных.Пустая() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	РезультатСинхронизации = СинхронизацияСБП_ат.СинхронизироватьНоменклатуру(Ссылка, БазаДанных, , Ложь);
	
	Если РезультатСинхронизации.Ошибки.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		Для каждого Ошибка Из РезультатСинхронизации.Ошибки Цикл
			
			Сообщить(Ошибка);
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
