
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ПересчитатьЗаголовкиСтраниц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправляемыеФормы_Клиент_ат.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиДействийПользователя

&НаКлиенте
Процедура ТипПередачиВАрендуПриИзменении(Элемент)
	
	ПересчитатьЗаголовкиСтраниц();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
	
	
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьЗаголовкиСтраниц()
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипПередачиВАренду) Тогда
		
		Элементы.СтраницаСерверы.Заголовок = "Серверы";
		Элементы.СтраницаРолиСерверов.Заголовок = "Роли серверов";
		Элементы.СтраницаПоставкиПродуктов.Заголовок = "Поставки продуктов";

	Иначе 	
	
		Элементы.СтраницаСерверы.Заголовок =
			?(Объект.ТипПередачиВАренду = Перечисления.ТипыПередачиВАренду_ат.ВыделениеСервера,
				"Выбранные серверы", "Отбор по серверам");
		Элементы.СтраницаРолиСерверов.Заголовок =
			?(Объект.ТипПередачиВАренду = Перечисления.ТипыПередачиВАренду_ат.ДоступКРолиСервера,
				"Выбранные роли серверов", "Отбор по ролям серверов");
		Элементы.СтраницаПоставкиПродуктов.Заголовок =
			?(Объект.ТипПередачиВАренду = Перечисления.ТипыПередачиВАренду_ат.СозданиеЭкземпляраПродукта,
				"Выбранные поставки продуктов", "Отбор по поставкам продуктов");
			
	КонецЕсли;		
			
КонецПроцедуры 	
	
#КонецОбласти

#Область УниверсальныеОбработчикиДействий
	
&НаКлиенте
Процедура ОбработчикУниверсальныхДействий(Команда)
	
	УправляемыеФормы_Клиент_ат.ДополнительныеДействияФормы(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Функция   ОбработчикУниверсальныхДействий_Сервер(Элемент) Экспорт
	
	Возврат УправляемыеФормы_Сервер_ат.ДополнительныеДействияФормы(ЭтаФорма, Команды[Элемент.Имя]);
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УправляемыеФормы_Клиент_ат.ПередЗаписью(ЭтаФорма, Отказ, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправляемыеФормы_Клиент_ат.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти
