
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отчеты_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииВариантаНаСервере(Настройки)
	
	Отчеты_ат.ПриСохраненииВариантаНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	
	Отчеты_ат.ПриЗагрузкеВариантаНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ОчиститьСообщения();
	
	СкомпоноватьРезультат();
	
	ОбработатьЗаголовки(Результат);
	
	СкрытьНастройки("");
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	Элементы.СтраницыОтчета.ТекущаяСтраница = Элементы.СтраницаНастройкиОтчета;
	
	Элементы.Сформировать_СтраницаНастроек.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки(Команда)
	
	Элементы.СтраницыОтчета.ТекущаяСтраница = Элементы.СтраницаОтчет;
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Обработка заголовков таблицы
//
// Параметры
// ТабДок - ТабличныйДокумент
Процедура ОбработатьЗаголовки(ТабДок)
	
	ОбъединяемаяОбласть = Неопределено;
	
	// Для оптимизации здесь нужно будет ограничить высоту таблицы
	Для индСтр = 1 По ТабДок.ВысотаТаблицы Цикл
		
		НачальнаяКолонка = 0;
		
		Для индКол = 1 По ТабДок.ШиринаТаблицы Цикл
			
			// определяем начало объединения
			Если ОбъединятьЯчейки(ТабДок, индСтр, индКол) Тогда
				
				Если НЕ НачальнаяКолонка Тогда
					
					НачальнаяКолонка = индКол;
					
				КонецЕсли;
				
			ИначеЕсли НачальнаяКолонка Тогда
				// завершаем объединение
				
				ТекстЗаголовка = ТабДок.Область(индСтр, индКол).Текст;
				ОбъединяемаяОбласть = ТабДок.Область(индСтр, НачальнаяКолонка, индСтр, индКол);
				ОбъединяемаяОбласть.Объединить();
				ОбъединяемаяОбласть.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
				ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
				НачальнаяКолонка = 0;
				
			Иначе
				
				НачальнаяКолонка = 0;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Если нашли в строке области для объединения то прекращаем дальнейшие поиски
		Если ОбъединяемаяОбласть <> Неопределено Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Проверка двух смежных ячеек на идентичность
Функция   ОбъединятьЯчейки(ТабДок, индСтр, индКол)
	
	Ячейка = ТабДок.Область(индСтр, индКол);
	ЯчейкаСлед = ТабДок.Область(индСтр, индКол + 1);
	
	Если ПустаяСтрока(Ячейка.Текст) Тогда
		
		Возврат Ложь;
		
	ИначеЕсли
		
		// Проверяем на конкретные значения объединяемых заголовков колонок
		(Ячейка.Текст = "Планируемая выручка"
		Или Ячейка.Текст = "Затраты"
		Или Ячейка.Текст = "Выручка"
		Или Ячейка.Текст = "Доход")
		
		И Ячейка.Текст = ЯчейкаСлед.Текст
		
		// Проверяем на соответствие имени (отсеиваем уже объединенные ячейки)
		И Ячейка.Имя = "R" + индСтр + "C" + индКол Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
