
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ТекущийПользователь);
	
	Если ЗначениеЗаполнено(Параметры.ДоступныеЗадания) Тогда
		
		УправляемыеФормы_КлиентСервер_ат.УстановитьОтборДинамическогоСписка(
			Список, "Ссылка", ВидСравненияКомпоновкиДанных.ВСписке, Параметры.ДоступныеЗадания, Истина,,, Список.Отбор);
		
		УстановитьОтборПоАктуальнымНаСервере(Ложь);
		
	Иначе
		
		УстановитьОтборПоАктуальнымНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправляемыеФормы_Клиент_ат.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьЗадание" Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	УправляемыеФормы_Клиент_ат.ПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьОтборПоАктуальным(Команда)
	
	Элементы.ФормаОтборПоАктуальным.Пометка = Не Элементы.ФормаОтборПоАктуальным.Пометка;
	
	УстановитьОтборПоАктуальнымНаСервере(Элементы.ФормаОтборПоАктуальным.Пометка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВРПЗ(Команда)
	
	ОткрытьФорму("Обработка.ПланированиеЗаданий_ат.Форма");
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоАктуальнымНаСервере(ИспользоватьОтбор)
	
	Если ВнутреннегоИспользования_ВызовСервера_ат.МенеджерПроектовИлиПолныеПрава() Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ОтбиратьАктуальныеПоПользователю", Ложь);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("ОтбиратьАктуальныеПоПользователю", ИспользоватьОтбор);
	КонецЕсли;
	
	УправляемыеФормы_КлиентСервер_ат.ИзменитьИспользованиеОтбораДинамическогоСписка(Список, "Скрыть завершённые", ИспользоватьОтбор);
	
КонецПроцедуры

#КонецОбласти  

#Область УниверсальныеОбработчикиДействий

&НаКлиенте
Процедура ОбработчикУниверсальныхДействий(Команда)
	
	УправляемыеФормы_Клиент_ат.ДополнительныеДействияФормы(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Функция   ОбработчикУниверсальныхДействий_Сервер(Элемент) Экспорт
	
	Возврат УправляемыеФормы_Сервер_ат.ДополнительныеДействияФормы(ЭтаФорма, Команды[Элемент.Имя]);
	
КонецФункции

#КонецОбласти 
