
Функция   ЕстьПодключения() Экспорт 

	Подключения = ПолучитьИзВременногоХранилища(ПодключениеКИБ_ПовтИсп_ат.ПолучитьАдресХранилищаПодключений());
	
	Для Каждого Подключение Из Подключения Цикл 
		РезультатПодключения = Подключение.Значение;
		
		Попытка
			БлокировкаСеансов = РезультатПодключения.ПолучитьБлокировкуСеансов();
			ТекущийМомент = РезультатПодключения.ТекущаяДатаСеанса();
			Если БлокировкаСеансов.Установлена И БлокировкаСеансов.Начало <= ТекущийМомент И ТекущийМомент < БлокировкаСеансов.Конец Тогда
				РезультатПодключения = Неопределено;
			КонецЕсли;
		Исключение
			РезультатПодключения = Неопределено;
		КонецПопытки;
		
		Если РезультатПодключения = Неопределено Тогда
			Подключения.Удалить(Подключение.Ключ);
		КонецЕсли;	
	КонецЦикла;	
	
	Если Подключения.Количество() = 0 Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;	

КонецФункции	
