
&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Текст'; en = 'Text'")  	+ "(*.txt)|*.txt";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
		Для Каждого ИмяФайла Из МассивФайлов Цикл
			
			ВыбФайл = Новый Файл(ИмяФайла);
			Сообщить(ИмяФайла + НСтр("ru = '; Размер = '; en = '; Size = '") + ВыбФайл.Размер());

			ВыбФайл = Новый ЧтениеТекста(ИмяФайла);
			Стр = ВыбФайл.ПрочитатьСтроку();
			Пока Стр <> Неопределено цикл
				Если СтрНачинаетсяС(Стр, "." ) тогда
						
				Иначе
					
				КонецЕсли;
				
				
			КонецЦикла;
			

			//Сообщить(ВыбФайл.КоличествоСтрок());
			
		КонецЦикла;
	Иначе
		Предупреждение(НСтр("ru = 'Файл не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;
	

	
	ЗагрузитьИзФайлаНаСервере();
КонецПроцедуры
