////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ПрефиксИнформационнойБазы = ПолучитьФункциональнуюОпцию("ПрефиксИнформационнойБазы");
	
	ПрефиксИнформационнойБазыУстановлен = Не ПустаяСтрока(ПрефиксИнформационнойБазы);
	
	Элементы.Страницы.ТекущаяСтраница = ?(ПрефиксИнформационнойБазыУстановлен,
						Элементы.СтраницаОтображенияПрефиксаИнформационнойБазы,
						Элементы.СтраницаОтображенияИнформацииОПустомПрефиксе);
	
КонецПроцедуры
