
Функция ПолучитьПодписьПользователяПоУчетнойЗаписи(Пользователь, УчетнаяЗапись) Экспорт
	
	Запись = РегистрыСведений.ПодписиПользователейДляУчетнойЗаписи_ат.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда 
		Возврат Запись.Подпись;
	Иначе
		Запись.Пользователь = Неопределено;
		Запись.УчетнаяЗапись = УчетнаяЗапись;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда 
			Возврат Запись.Подпись;
		Иначе
			Запись.Пользователь = Неопределено;
			Запись.УчетнаяЗапись = Неопределено;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда 
				Возврат Запись.Подпись;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьПодписьПользоваетляПоУчетнойЗаписи(Пользователь, УчетнаяЗапись, Подпись) Экспорт
	
	Запись = РегистрыСведений.ПодписиПользователейДляУчетнойЗаписи_ат.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Пользователь = Подпись;
	Попытка
		Запись.Записать();
	Исключение
		Сообщить("Не удалось записать подпись пользователя " + Пользователь + " для учетной записи " + УчетнаяЗапись + "",
			СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры
