////////////////////////////////////////////////////////////////////////////////
// Подсистема "Базовая функциональность".
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Дополнительные процедуры и функции.

// Возвращает признак, является ли конфигурация базовой.
//
// Возвращаемое значение:
//   Булево   - Истина, если конфигурация - базовая.
//
Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	
	Возврат Найти(ВРег(Метаданные.Имя), "БАЗОВАЯ") > 0;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Работа с событиями служебного программного интерфейса.
// Использование только в пределах библиотеки и отдельно от других библиотек.

// Доопределяет события, к которым можно будет добавить обработчики
// через процедуру ПриДобавленииОбработчиковСлужебныхСобытий.
//
// Параметры:
//  КлиентскиеСобытия – Массив, где значения типа Строка - полное имя события.
//  СерверныеСобытия  – Массив, где значения типа Строка - полное имя события.
//
// Для упрощения поддержки, рекомендуется делать вызов такой же
// процедуры в общем модуле библиотеки.
//
// Пример использования в общем модуле библиотеки:
//
//	// Переопределяет стандартное предупреждение открытием произвольной формы активных пользователей.
//	//
//	// Параметры:
//	//  ИмяФормы - Строка (возвращаемое значение).
//	//
//	// Синтаксис:
//	// Процедура ПриОткрытииФормыАктивныхПользователей(ИмяФормы) Экспорт
//	//
//	СерверныеСобытия.Добавить(
//		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииФормыАктивныхПользователей");
//
// Комментарий можно копировать при создании нового обработчика.
// Раздел "Синтаксис:" используется для создания новой процедуры обработчика.
//
Процедура ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия) Экспорт
	
	// СЕРВЕРНЫЕ СОБЫТИЯ.
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	ПриДобавленииСлужебныхСобытийБазовойФункциональности(КлиентскиеСобытия, СерверныеСобытия);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.БизнесПроцессыИЗадачи") Тогда
		МодульБизнесПроцессыИЗадачиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("БизнесПроцессыИЗадачиСервер");
		МодульБизнесПроцессыИЗадачиСервер.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	
	// СтандартныеПодсистемы.КалендарныеГрафики
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КалендарныеГрафики") Тогда
		МодульКалендарныеГрафики = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("КалендарныеГрафики");
		МодульКалендарныеГрафики.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КалендарныеГрафики
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.НапоминанияПользователя") Тогда
		МодульНапоминанияПользователяСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("НапоминанияПользователяСлужебный");
		МодульНапоминанияПользователяСлужебный.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
	// СтандартныеПодсистемы.ОбменДанными
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСервер");
		МодульОбменДаннымиСервер.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОбменДанными
	
	// СтандартныеПодсистемы.ОбновлениеВерсииИБ
	ОбновлениеИнформационнойБазы.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ
	
	// СтандартныеПодсистемы.Пользователи
	ПользователиСлужебный.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	// Конец СтандартныеПодсистемы.Пользователи
	
	// СтандартныеПодсистемы.ПрисоединенныеФайлы
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ПрисоединенныеФайлы") Тогда
		МодульПрисоединенныеФайлыСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПрисоединенныеФайлыСлужебный");
		МодульПрисоединенныеФайлыСлужебный.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПрисоединенныеФайлы
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаВМоделиСервиса");
		МодульРаботаВМоделиСервиса.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ВыгрузкаЗагрузкаДанных
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ВыгрузкаЗагрузкаДанных") Тогда
		МодульВыгрузкаЗагрузкаДанных = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ВыгрузкаЗагрузкаДанных");
		МодульВыгрузкаЗагрузкаДанных.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ВыгрузкаЗагрузкаДанных
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменСообщениями
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменСообщениями") Тогда
		МодульОбменСообщениями = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменСообщениями");
		МодульОбменСообщениями.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
		МодульИнтерфейсыСообщенийВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ИнтерфейсыСообщенийВМоделиСервиса");
		МодульИнтерфейсыСообщенийВМоделиСервиса.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменСообщениями
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий") Тогда
		МодульОчередьЗаданийСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОчередьЗаданийСлужебный");
		МодульОчередьЗаданийСлужебный.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ПоставляемыеДанные
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПоставляемыеДанные") Тогда
		МодульПоставляемыеДанные = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПоставляемыеДанные");
		МодульПоставляемыеДанные.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ПоставляемыеДанные
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступомСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступомСлужебный");
		МодульУправлениеДоступомСлужебный.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ФайловыеФункции
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ФайловыеФункции") Тогда
		МодульФайловыеФункцииСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ФайловыеФункцииСлужебный");
		МодульФайловыеФункцииСлужебный.ПриДобавленииСлужебныхСобытий(КлиентскиеСобытия, СерверныеСобытия);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ФайловыеФункции
	
КонецПроцедуры

// Доопределяет обработчики служебных событий, объявленных
// через процедуру ПриДобавленииСлужебныхСобытий.
//
// Параметры:
//  КлиентскиеОбработчики – Соответствие, где
//                            Ключ     – Строка - полное имя события,
//                            Значение – Массив - массив имен клиентских общих модулей обработчиков.
//
//  СерверныеОбработчики  – Соответствие, где
//                            Ключ     – Строка - полное имя события,
//                            Значение – Массив - массив имен серверных общих модулей обработчиков.
//
// Для упрощения поддержки, рекомендуется делать вызов такой же
// процедуры в общем модуле библиотеки.
//
// Пример использования в общем модуле библиотеки:
//
//	СерверныеОбработчики[
//		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииФормыАктивныхПользователей"
//			].Добавить(СоединенияИБ);
//
Процедура ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// СЕРВЕРНЫЕ ОБРАБОТЧИКИ.
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	ПриДобавленииОбработчиковСлужебныхСобытийБазовойФункциональности(КлиентскиеОбработчики, СерверныеОбработчики);
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// СтандартныеПодсистемы.АдресныйКлассификатор
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.АдресныйКлассификатор") Тогда
		МодульАдресныйКлассификатор = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("АдресныйКлассификатор");
		МодульАдресныйКлассификатор.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.АдресныйКлассификатор
	
	// СтандартныеПодсистемы.АнализЖурналаРегистрации
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.АнализЖурналаРегистрации") Тогда
		МодульАнализЖурналаРегистрацииСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("АнализЖурналаРегистрацииСлужебный");
		МодульАнализЖурналаРегистрацииСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.АнализЖурналаРегистрации
	
	// СтандартныеПодсистемы.Анкетирование
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Анкетирование") Тогда
		МодульАнкетирование = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("Анкетирование");
		МодульАнкетирование.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Анкетирование
	
	// СтандартныеПодсистемы.Банки
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Банки") Тогда
		МодульРаботаСБанками = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаСБанками");
		МодульРаботаСБанками.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Банки
	
	// СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.БизнесПроцессыИЗадачи") Тогда
		МодульБизнесПроцессыИЗадачиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("БизнесПроцессыИЗадачиСервер");
		МодульБизнесПроцессыИЗадачиСервер.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.БизнесПроцессыИЗадачи
	
	// СтандартныеПодсистемы.Валюты
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Валюты") Тогда
		МодульРаботаСКурсамиВалют = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаСКурсамиВалют");
		МодульРаботаСКурсамиВалют.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Валюты
	
	// СтандартныеПодсистемы.ВариантыОтчетов
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		МодульВариантыОтчетов = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ВариантыОтчетов");
		МодульВариантыОтчетов.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВариантыОтчетов
	
	// СтандартныеПодсистемы.Взаимодействия
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Взаимодействия") Тогда
		МодульВзаимодействия = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("Взаимодействия");
		МодульВзаимодействия.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
		МодульУправлениеЭлектроннойПочтой = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеЭлектроннойПочтой");
		МодульУправлениеЭлектроннойПочтой.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Взаимодействия
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ДатыЗапретаИзменения") Тогда
		МодульДатыЗапретаИзмененияСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ДатыЗапретаИзмененияСлужебный");
		МодульДатыЗапретаИзмененияСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
		МодульДополнительныеОтчетыИОбработки = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
		МодульДополнительныеОтчетыИОбработки.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ЗавершениеРаботыПользователей
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ЗавершениеРаботыПользователей") Тогда
		МодульСоединенияИБ = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("СоединенияИБ");
		МодульСоединенияИБ.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ЗавершениеРаботыПользователей
	
	// СтандартныеПодсистемы.ЗаметкиПользователя
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ЗаметкиПользователя") Тогда
		МодульЗаметкиПользователяСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ЗаметкиПользователяСлужебный");
		МодульЗаметкиПользователяСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ЗаметкиПользователя
	
	// СтандартныеПодсистемы.ИнформацияПриЗапуске
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ИнформацияПриЗапуске") Тогда
		МодульИнформацияПриЗапуске = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ИнформацияПриЗапуске");
		МодульИнформацияПриЗапуске.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ИнформацияПриЗапуске
	
	// СтандартныеПодсистемы.КалендарныеГрафики
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КалендарныеГрафики") Тогда
		МодульКалендарныеГрафики = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("КалендарныеГрафики");
		МодульКалендарныеГрафики.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КалендарныеГрафики
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	// СтандартныеПодсистемы.НапоминанияПользователя
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.НапоминанияПользователя") Тогда
		МодульНапоминанияПользователяСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("НапоминанияПользователяСлужебный");
		МодульНапоминанияПользователяСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.НапоминанияПользователя
	
	// СтандартныеПодсистемы.ОбновлениеВерсииИБ
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеВерсииИБ") Тогда
		МодульОбновлениеИнформационнойБазы = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбновлениеИнформационнойБазы");
		МодульОбновлениеИнформационнойБазы.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОбновлениеВерсииИБ
	
	// СтандартныеПодсистемы.ОбменДанными
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСервер");
		МодульОбменДаннымиСервер.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОбменДанными
	
	// СтандартныеПодсистемы.ОбновлениеКонфигурации
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбновлениеКонфигурации") Тогда
		МодульОбновлениеКонфигурации = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбновлениеКонфигурации");
		МодульОбновлениеКонфигурации.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОбновлениеКонфигурации
	
	// СтандартныеПодсистемы.Организации
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Организации") Тогда
		МодульОрганизацииСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОрганизацииСлужебный");
		МодульОрганизацииСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Организации
	
	// СтандартныеПодсистемы.ОценкаПроизводительности
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОценкаПроизводительности") Тогда
		МодульОценкаПроизводительностиСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОценкаПроизводительностиСлужебный");
		МодульОценкаПроизводительностиСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ОценкаПроизводительности
	
	// СтандартныеПодсистемы.Печать
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Печать
	
	// СтандартныеПодсистемы.ПолнотекстовыйПоиск
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ПолнотекстовыйПоиск") Тогда
		МодульПолнотекстовыйПоискСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПолнотекстовыйПоискСервер");
		МодульПолнотекстовыйПоискСервер.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПолнотекстовыйПоиск
	
	// СтандартныеПодсистемы.ПолучениеФайловИзИнтернета
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернетаСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПолучениеФайловИзИнтернетаСлужебный");
		МодульПолучениеФайловИзИнтернетаСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПолучениеФайловИзИнтернета
	
	// СтандартныеПодсистемы.Пользователи
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Пользователи") Тогда
		МодульПользователиСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПользователиСлужебный");
		МодульПользователиСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Пользователи
	
	// СтандартныеПодсистемы.ПрисоединенныеФайлы
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ПрисоединенныеФайлы") Тогда
		МодульПрисоединенныеФайлыСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПрисоединенныеФайлыСлужебный");
		МодульПрисоединенныеФайлыСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПрисоединенныеФайлы
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаВМоделиСервиса");
		МодульРаботаВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.АдресныйКлассификаторВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.АдресныйКлассификаторВМоделиСервиса") Тогда
		МодульАдресныйКлассификаторСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("АдресныйКлассификаторСлужебныйВМоделиСервиса");
		МодульАдресныйКлассификаторСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.АдресныйКлассификаторВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.БанкиВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.БанкиВМоделиСервиса") Тогда
		МодульБанкиСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("БанкиСлужебныйВМоделиСервиса");
		МодульБанкиСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.БанкиВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ВалютыВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ВалютыВМоделиСервиса") Тогда
		МодульКурсыВалютСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("КурсыВалютСлужебныйВМоделиСервиса");
		МодульКурсыВалютСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ВалютыВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ДополнительныеОтчетыИОбработкиВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ДополнительныеОтчетыИОбработкиВМоделиСервиса") Тогда
		МодульДополнительныеОтчетыИОбработкиВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ДополнительныеОтчетыИОбработкиВМоделиСервиса");
		МодульДополнительныеОтчетыИОбработкиВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
		МодульДополнительныеОтчетыИОбработкиВАвтономномРежиме = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ДополнительныеОтчетыИОбработкиВАвтономномРежиме");
		МодульДополнительныеОтчетыИОбработкиВАвтономномРежиме.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ДополнительныеОтчетыИОбработкиВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.КалендарныеГрафикиВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.КалендарныеГрафикиВМоделиСервиса") Тогда
		МодульКалендарныеГрафикиСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("КалендарныеГрафикиСлужебныйВМоделиСервиса");
		МодульКалендарныеГрафикиСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.КалендарныеГрафикиВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса") Тогда
		МодульОбменДаннымиВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиВМоделиСервиса");
		МодульОбменДаннымиВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменСообщениями
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменСообщениями") Тогда
		МодульОбменСообщениями = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменСообщениями");
		МодульОбменСообщениями.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
		МодульИнтерфейсыСообщенийВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ИнтерфейсыСообщенийВМоделиСервиса");
		МодульИнтерфейсыСообщенийВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменСообщениями
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбновлениеВерсииИБВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбновлениеВерсииИБВМоделиСервиса") Тогда
		МодульОбновлениеИнформационнойБазыСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбновлениеИнформационнойБазыСлужебныйВМоделиСервиса");
		МодульОбновлениеИнформационнойБазыСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбновлениеВерсииИБВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий") Тогда
		
		МодульОчередьЗаданийСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОчередьЗаданийСлужебный");
		МодульОчередьЗаданийСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
		
		Если ОбщегоНазначенияПовтИсп.ЭтоРазделеннаяКонфигурация() Тогда
			МодульОчередьЗаданийСлужебныйРазделениеДанных = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОчередьЗаданийСлужебныйРазделениеДанных");
			МодульОчередьЗаданийСлужебныйРазделениеДанных.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
		КонецЕсли;
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ОчередьЗаданий
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ПоставляемыеДанные
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ПоставляемыеДанные") Тогда
		МодульПоставляемыеДанные = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ПоставляемыеДанные");
		МодульПоставляемыеДанные.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ПоставляемыеДанные
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.РезервноеКопированиеОбластейДанных
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.РезервноеКопированиеОбластейДанных") Тогда
		МодульРезервноеКопированиеОбластейДанных = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РезервноеКопированиеОбластейДанных");
		МодульРезервноеКопированиеОбластейДанных.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.РезервноеКопированиеОбластейДанных
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.УдаленноеАдминистрирование
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.УдаленноеАдминистрирование") Тогда
		МодульУдаленноеАдминистрированиеСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УдаленноеАдминистрированиеСлужебный");
		МодульУдаленноеАдминистрированиеСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.УдаленноеАдминистрирование
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.УправлениеДоступомВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.УправлениеДоступомВМоделиСервиса") Тогда
		МодульУправлениеДоступомСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступомСлужебныйВМоделиСервиса");
		МодульУправлениеДоступомСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.УправлениеДоступомВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаВМоделиСервиса.ФайловыеФункцииВМоделиСервиса
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ФайловыеФункцииВМоделиСервиса") Тогда
		МодульФайловыеФункцииСлужебныйВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ФайловыеФункцииСлужебныйВМоделиСервиса");
		МодульФайловыеФункцииСлужебныйВМоделиСервиса.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаВМоделиСервиса.ФайловыеФункцииВМоделиСервиса
	
	// СтандартныеПодсистемы.РаботаСПочтовымиСообщениями
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСПочтовымиСообщениями") Тогда
		МодульРаботаСПочтовымиСообщениями = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаСПочтовымиСообщениями");
		МодульРаботаСПочтовымиСообщениями.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСПочтовымиСообщениями
	
	// СтандартныеПодсистемы.РаботаСФайлами
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
		МодульРаботаСФайламиСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаСФайламиСлужебный");
		МодульРаботаСФайламиСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	// СтандартныеПодсистемы.РегламентныеЗадания
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РегламентныеЗадания") Тогда
		МодульРегламентныеЗаданияСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РегламентныеЗаданияСлужебный");
		МодульРегламентныеЗаданияСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РегламентныеЗадания
	
	// СтандартныеПодсистемы.РезервноеКопированиеИБ
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РезервноеКопированиеИБ") Тогда
		МодульРезервноеКопированиеИБСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РезервноеКопированиеИБСервер");
		МодульРезервноеКопированиеИБСервер.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.РезервноеКопированиеИБ
	
	// СтандартныеПодсистемы.Свойства
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеСвойствамиСлужебный");
		МодульУправлениеСвойствамиСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступомСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступомСлужебный");
		МодульУправлениеДоступомСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.УправлениеИтогамиИАгрегатами
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеИтогамиИАгрегатами") Тогда
		МодульУправлениеИтогамиИАгрегатамиСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеИтогамиИАгрегатамиСлужебный");
		МодульУправлениеИтогамиИАгрегатамиСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеИтогамиИАгрегатами
	
	// СтандартныеПодсистемы.ФайловыеФункции
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ФайловыеФункции") Тогда
		МодульФайловыеФункцииСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ФайловыеФункцииСлужебный");
		МодульФайловыеФункцииСлужебный.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ФайловыеФункции
	
	// СтандартныеПодсистемы.ФизическиеЛица
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ФизическиеЛица") Тогда
		МодульФизическиеЛица = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ФизическиеЛица");
		МодульФизическиеЛица.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ФизическиеЛица
	
	// СтандартныеПодсистемы.ЭлектроннаяЦифроваяПодпись
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ЭлектроннаяЦифроваяПодпись") Тогда
		МодульЭлектроннаяЦифроваяПодпись = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ЭлектроннаяЦифроваяПодпись");
		МодульЭлектроннаяЦифроваяПодпись.ПриДобавленииОбработчиковСлужебныхСобытий(КлиентскиеОбработчики, СерверныеОбработчики);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ЭлектроннаяЦифроваяПодпись
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Дополнительная базовая функциональность для анализа параметров клиента на сервере

// Возвращает фиксированное соответствие, содержащее некоторые параметры клиента:
//  ПараметрЗапуска                    - Строка,
//  СтрокаСоединенияИнформационнойБазы - Строка - строка соединения, полученная на клиенте.
//
// Возвращает пустое фиксированное соответствие, если ТекущийРежимЗапуска() = Неопределено.
//
Функция ПараметрыКлиентаНаСервере() Экспорт
	
	Если ТекущийРежимЗапуска() = Неопределено Тогда
		Возврат Новый ФиксированноеСоответствие(Новый Соответствие);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ПараметрыКлиента = ПараметрыСеанса.ПараметрыКлиентаНаСервере;
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ПараметрыКлиента.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнены параметры клиента на сервере.'");
	КонецЕсли;
	
	Возврат ПараметрыКлиента;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Дополнительная базовая функциональность обновления информационной базы

// Обновляет кэши свойств метаданных, позволяющие ускорить
// открытие сеанса, а также обновление ИБ, особенно в модели сервиса.
// Обновляются до обновления ИБ.
// 
Процедура ОбновитьПараметрыРаботыПрограммы(НайтиИзменения = Ложь,
                                           ЕстьИзменения = Неопределено,
                                           ОшибкаУстановкиМонопольногоРежима = Неопределено) Экспорт
	
	ЕстьИзменения  = Ложь;
	ТолькоПроверка = Ложь;
	СнятьМонопольныйРежим = Ложь;
	
	Если НайтиИзменения Тогда
		ТолькоПроверка = Истина;
		
	ИначеЕсли НЕ МонопольныйРежим() Тогда
		Попытка
			УстановитьМонопольныйРежим(Истина);
			СнятьМонопольныйРежим = Истина;
		Исключение
			СнятьМонопольныйРежим = Ложь;
			ТолькоПроверка = Истина;
		КонецПопытки;
	КонецЕсли;
	
	БезИзменений = Новый Структура;
	Попытка
		ПроверитьОбновитьПараметрыРаботыПрограммы(ЕстьИзменения, ТолькоПроверка, БезИзменений);
	Исключение
		Если СнятьМонопольныйРежим Тогда
			УстановитьМонопольныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
	Если СнятьМонопольныйРежим Тогда
		УстановитьМонопольныйРежим(Ложь);
	КонецЕсли;
	
	Если НЕ НайтиИзменения И ТолькоПроверка Тогда
		Если ЕстьИзменения Тогда
			Попытка
				УстановитьМонопольныйРежим(Истина);
			Исключение
				ТекстОшибки =
					НСтр("ru = 'Невозможно выполнить обновление информационной базы:
					           |- Невозможно установить монопольный режим
					           |- Версия конфигурации не предусматривает обновление без установки монопольного режима.'");
				
				Если ОшибкаУстановкиМонопольногоРежима = Неопределено Тогда
					ВызватьИсключение ТекстОшибки;
				Иначе
					ОшибкаУстановкиМонопольногоРежима = ТекстОшибки;
					Возврат;
				КонецЕсли;
			КонецПопытки;
			Попытка
				ОбновитьПараметрыРаботыПрограммы(ЕстьИзменения, Ложь);
			Исключение
				УстановитьМонопольныйРежим(Ложь);
				ВызватьИсключение;
			КонецПопытки;
			УстановитьМонопольныйРежим(Ложь);
		Иначе
			// Монопольный режим не требуется.
			ПроверитьОбновитьПараметрыРаботыПрограммы(ЕстьИзменения, Ложь, БезИзменений);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Дополнительная базовая функциональность для обмена данными

// Выполняет проверку состава плана обмена на наличие обязательных объектов метаданных
// и объектов-исключений из состава плана обмена.
//
// Параметры:
//  ИмяПланаОбмена – Строка, ПланОбменаСсылка. Имя плана обмена или ссылка на узел плана обмена,
//  для которого необходимо выполнить проверку.
//
Процедура ПроверитьСоставПланаОбмена(Знач ИмяПланаОбмена) Экспорт
	
	Если ТипЗнч(ИмяПланаОбмена) <> Тип("Строка") Тогда
		ИмяПланаОбмена = ИмяПланаОбмена.Метаданные().Имя;
	КонецЕсли;
	
	РаспределеннаяИнформационнаяБаза = Метаданные.ПланыОбмена[ИмяПланаОбмена].РаспределеннаяИнформационнаяБаза;
	СоставПланаОбмена = Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав;
	
	ВключитьВСостав = Новый Массив;
	ИсключитьИзСостава = Новый Массив;
	ОтключитьАвторегистрацию = Новый Массив;
	
	// Получаем список обязательных объектов и объектов-исключений
	ОбязательныеОбъекты = Новый Массив;
	ОбъектыИсключения = Новый Массив;
	ОбъектыНачальногоОбраза = Новый Массив;
	
	// Получаем обязательные объекты
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбязательныхОбъектовПланаОбмена");
	Для Каждого Обработчик Из ОбработчикиСобытия Цикл
		
		ПризнакРаспределеннаяИнформационнаяБаза = РаспределеннаяИнформационнаяБаза;
		
		Обработчик.Модуль.ПриПолученииОбязательныхОбъектовПланаОбмена(ОбязательныеОбъекты, ПризнакРаспределеннаяИнформационнаяБаза);
	КонецЦикла;
	
	// Получаем объекты-исключения
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбъектовИсключенийПланаОбмена");
	Для Каждого Обработчик Из ОбработчикиСобытия Цикл
		
		ПризнакРаспределеннаяИнформационнаяБаза = РаспределеннаяИнформационнаяБаза;
		
		Обработчик.Модуль.ПриПолученииОбъектовИсключенийПланаОбмена(ОбъектыИсключения, ПризнакРаспределеннаяИнформационнаяБаза);
	КонецЦикла;
	
	Если ПризнакРаспределеннаяИнформационнаяБаза Тогда
		
		// Получаем объекты начального образа
		ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
			"СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбъектовНачальногоОбразаПланаОбмена");
		Для Каждого Обработчик Из ОбработчикиСобытия Цикл
			
			Обработчик.Модуль.ПриПолученииОбъектовНачальногоОбразаПланаОбмена(ОбъектыНачальногоОбраза);
			
		КонецЦикла;
		
		Для Каждого Объект Из ОбъектыНачальногоОбраза Цикл
			
			ОбязательныеОбъекты.Добавить(Объект);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Проверяем список обязательных объектов для состава плана обмена
	Для Каждого Объект Из ОбязательныеОбъекты Цикл
		
		Если СоставПланаОбмена.Найти(Объект) = Неопределено Тогда
			
			ВключитьВСостав.Добавить(Объект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверяем список объектов-исключений из состава плана обмена
	Для Каждого Объект Из ОбъектыИсключения Цикл
		
		Если СоставПланаОбмена.Найти(Объект) <> Неопределено Тогда
			
			ИсключитьИзСостава.Добавить(Объект);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверяем признак авторегистрации
	// Авторегистрация должна быть отключена у всех объектов начального образа
	Для Каждого ЭлементСостава Из СоставПланаОбмена Цикл
		
		Если ОбъектыНачальногоОбраза.Найти(ЭлементСостава.Метаданные) <> Неопределено
			И ЭлементСостава.АвтоРегистрация <> АвтоРегистрацияИзменений.Запретить Тогда
			
			ОтключитьАвторегистрацию.Добавить(ЭлементСостава.Метаданные);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Формируем и выводим текст исключения при необходимости
	Если ВключитьВСостав.Количество() <> 0
		ИЛИ ИсключитьИзСостава.Количество() <> 0
		ИЛИ ОтключитьАвторегистрацию.Количество() <> 0 Тогда
		
		Если ВключитьВСостав.Количество() <> 0 Тогда
			
			ОписаниеИсключения1 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В состав плана обмена %1 должны входить следующие объекты метаданных: %2'"),
				ИмяПланаОбмена,
				СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ПредставлениеОбъектовМетаданных(ВключитьВСостав), ", "));
			
		КонецЕсли;
		
		Если ИсключитьИзСостава.Количество() <> 0 Тогда
			
			ОписаниеИсключения2 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В состав плана обмена %1 НЕ должны входить следующие объекты метаданных: %2'"),
				ИмяПланаОбмена,
				СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ПредставлениеОбъектовМетаданных(ИсключитьИзСостава), ", "));
			
		КонецЕсли;
		
		Если ОтключитьАвторегистрацию.Количество() <> 0 Тогда
			
			ОписаниеИсключения3 = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В составе плана обмена %1 не должно быть объектов с установленным признаком авторегистрации.
				|Требуется запретить авторегистрацию для следующих объектов метаданных: %2'"),
				ИмяПланаОбмена,
				СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ПредставлениеОбъектовМетаданных(ОтключитьАвторегистрацию), ", "));
			
		КонецЕсли;
		
		ОписаниеИсключения = "[ОписаниеИсключения1]
		|
		|[ОписаниеИсключения2]
		|
		|[ОписаниеИсключения3]
		|";
		
		ОписаниеИсключения = СтрЗаменить(ОписаниеИсключения, "[ОписаниеИсключения1]", ОписаниеИсключения1);
		ОписаниеИсключения = СтрЗаменить(ОписаниеИсключения, "[ОписаниеИсключения2]", ОписаниеИсключения2);
		ОписаниеИсключения = СтрЗаменить(ОписаниеИсключения, "[ОписаниеИсключения3]", ОписаниеИсключения3);
		
		ВызватьИсключение СокрЛП(ОписаниеИсключения);
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет, является ли переданный объект, объектом начального образа подчиненного узла РИБ.
//
// Параметры:
//  Объект – ОбъектМетаданных. Объект метаданных, который необходимо проверить.
// 
//  Возвращаемое значение:
// Тип: Булево.
// Истина – объект используется в РИБ только в момент создания начального образа подчиненного узла;
// Ложь – в противном случае.
// 
Функция ЭтоОбъектНачальногоОбразаУзлаРИБ(Знач Объект) Экспорт
	
	Возврат СтандартныеПодсистемыПовтИсп.ОбъектыНачальногоОбраза(
		).Получить(Объект.ПолноеИмя()) <> Неопределено;
	
КонецФункции

// Выполняет регистрацию изменений объекта на всех узлах плана обмена.
// Для разделенных конфигураций должны выполняться условия:
//  план обмена должен быть разделенным,
//  регистрируемый объект должен быть неразделенным.
//
//  Параметры:
// Объект – Объект данных (СправочникОбъект, ДокументОбъект и пр.). Объект, который требуется зарегистрировать.
// Объект должен быть неразделенным, иначе будет выдано исключение.
//
// ИмяПланаОбмена – Строка. Имя плана обмена, на всех узлах которого требуется выполнить регистрацию объекта.
// План обмена должен быть разделенным, иначе будет выдано исключение.
//
Процедура ЗарегистрироватьОбъектНаВсехУзлах(Знач Объект, Знач ИмяПланаОбмена) Экспорт
	
	Если Метаданные.ПланыОбмена[ИмяПланаОбмена].Состав.Найти(Объект.Метаданные()) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		
		Если ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
			ВызватьИсключение НСтр("ru = 'Регистрация изменений неразделенных данных в разделенном режиме.'");
		КонецЕсли;
		
		Если Не ОбщегоНазначенияПовтИсп.ЭтоРазделенныйОбъектМетаданных("ПланОбмена." + ИмяПланаОбмена,
				ОбщегоНазначенияПовтИсп.РазделительОсновныхДанных())
			Тогда
			ВызватьИсключение НСтр("ru = 'Регистрация изменений для неразделенных планов обмена не поддерживается.'");
		КонецЕсли;
		
		Если ОбщегоНазначенияПовтИсп.ЭтоРазделенныйОбъектМетаданных(Объект.Метаданные().ПолноеИмя(),
				ОбщегоНазначенияПовтИсп.РазделительОсновныхДанных())
			Тогда
			ВызватьИсключение НСтр("ru = 'Регистрация изменений для разделенных объектов не поддерживается.'");
		КонецЕсли;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПланОбмена.Ссылка КАК Получатель
		|ИЗ
		|	ПланОбмена.[ИмяПланаОбмена] КАК ПланОбмена
		|ГДЕ
		|	ПланОбмена.РегистрироватьИзменения
		|	И НЕ ПланОбмена.ПометкаУдаления";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяПланаОбмена]", ИмяПланаОбмена);
		
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		
		Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
		
		Для Каждого Получатель Из Получатели Цикл
			
			Объект.ОбменДанными.Получатели.Добавить(Получатель);
			
		КонецЦикла;
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПланОбмена.Ссылка КАК Получатель
		|ИЗ
		|	ПланОбмена.[ИмяПланаОбмена] КАК ПланОбмена
		|ГДЕ
		|	ПланОбмена.Ссылка <> &ЭтотУзел
		|	И НЕ ПланОбмена.ПометкаУдаления";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "[ИмяПланаОбмена]", ИмяПланаОбмена);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена[ИмяПланаОбмена].ЭтотУзел());
		Запрос.Текст = ТекстЗапроса;
		
		Получатели = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
		
		Для Каждого Получатель Из Получатели Цикл
			
			Объект.ОбменДанными.Получатели.Добавить(Получатель);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики отправки и получения данных для обмена в распределенной ИБ

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриОтправкеДанныхПодчиненному() в синтаксис-помощнике.
// 
Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, Знач СозданиеНачальногоОбраза, Знач Получатель = Неопределено) Экспорт
	
	ИгнорироватьОтправкуОбъектовНачальногоОбраза(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза);
	
	Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
		Возврат;
	КонецЕсли;
	
	// Отправка идентификаторов объектов метаданных выполняется в другой секции сообщения обмена.
	ИгнорироватьОтправкуИдентификаторовОбъектовМетаданных(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза);
	
	Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
		Возврат;
	КонецЕсли;
	
	// Вставка кода от подсистемы обмена данными должна быть первой.
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиСобытия = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСобытия");
		МодульОбменДаннымиСобытия.ПриОтправкеДанныхКорреспонденту(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель, Ложь);
		
		Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОтправкеДанныхПодчиненному");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриОтправкеДанныхПодчиненному(
			ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель);
		Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Вставка кода от подсистемы обмена данными в модели сервиса должна быть последней.
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.ОбменДаннымиВМоделиСервиса") Тогда
		МодульОбменДаннымиВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиВМоделиСервиса");
		МодульОбменДаннымиВМоделиСервиса.ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель);
		
		Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриОтправкеДанныхГлавному() в синтаксис-помощнике.
// 
Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Знач Получатель = Неопределено) Экспорт
	
	ИгнорироватьОтправкуОбъектовНачальногоОбраза(ЭлементДанных, ОтправкаЭлемента);
	
	Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
		Возврат;
	КонецЕсли;
	
	// Отправка идентификаторов объектов метаданных выполняется в другой секции сообщения обмена.
	ИгнорироватьОтправкуИдентификаторовОбъектовМетаданных(ЭлементДанных, ОтправкаЭлемента);
	
	Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
		Возврат;
	КонецЕсли;
	
	// Вставка кода от подсистемы обмена данными должна быть первой.
	// При отправке данных главному обработчик не вызываем,
	// т.к. ограничение миграции "снизу-вверх" в РИБ по умолчанию не предусмотрено.
	
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОтправкеДанныхГлавному");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Получатель);
		Если ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриПолученииДанныхОтПодчиненного() в синтаксис-помощнике.
// 
Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Знач Отправитель = Неопределено) Экспорт
	
	ИгнорироватьПолучениеОбъектовНачальногоОбраза(ЭлементДанных, ПолучениеЭлемента);
	
	Если ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать Тогда
		Возврат;
	КонецЕсли;
	
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииДанныхОтПодчиненного");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриПолученииДанныхОтПодчиненного(
			ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);
		Если ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Вставка кода от подсистемы обмена данными должна быть последней.
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиСобытия = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСобытия");
		МодульОбменДаннымиСобытия.ПриПолученииДанныхОтПодчиненногоВКонце(ЭлементДанных, ПолучениеЭлемента, Отправитель);
	КонецЕсли;
	
КонецПроцедуры

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриПолученииДанныхОтГлавного() в синтаксис-помощнике.
// 
Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Знач Отправитель = Неопределено) Экспорт
	
	ИгнорироватьПолучениеОбъектовНачальногоОбраза(ЭлементДанных, ПолучениеЭлемента);
	
	Если ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать Тогда
		Возврат;
	КонецЕсли;
	
	// Вставка кода от подсистемы обмена данными должна быть первой.
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиСобытия = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСобытия");
		МодульОбменДаннымиСобытия.ПриПолученииДанныхОтГлавногоВНачале(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);
		
		Если ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииДанныхОтГлавного");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриПолученииДанныхОтГлавного(
			ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель);
		Если ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Вставка кода от подсистемы обмена данными должна быть последней.
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными")
		И Не СозданиеНачальногоОбраза(ЭлементДанных) Тогда
		
		МодульОбменДаннымиСобытия = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСобытия");
		МодульОбменДаннымиСобытия.ПриПолученииДанныхОтГлавногоВКонце(ЭлементДанных, ПолучениеЭлемента, Отправитель);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики служебных событий базовой функциональности

// Заполняет переименования тех объектов метаданных, которые невозможно
// автоматически найти по типу, но ссылки на которые требуется сохранять
// в базе данных (например: подсистемы, роли).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьПереименование().
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	
	Библиотека = "СтандартныеПодсистемы";
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"2.0.1.2",
		"Роль.ДобавлениеИзменениеОбщихПоставляемыхДанных",
		"Роль.ДобавлениеИзменениеОбщейБазовойНСИ",
		Библиотека);
	
КонецПроцедуры

// Заполняет структуру параметров, необходимых для работы клиентского кода
// конфигурации.
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
Процедура ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистем(Параметры) Экспорт
	
	ДобавитьПараметрыРаботыКлиента(Параметры);
	
КонецПроцедуры

// Обработчик, вызываемый при определении объектов метаданных, не переносящихся между моделями при выгрузке / загрузке данных.
//
// Параметры
//  Объекты - Массив(ОбъектМетаданных).
//
Процедура ПриОпределенииОбъектовМетаданныхИсключаемыхИзВыгрузкиЗагрузки(Объекты) Экспорт
	
	Объекты.Добавить(Метаданные.РегистрыСведений.КэшПрограммныхИнтерфейсов);
	
КонецПроцедуры

// Используется для получения объектов метаданных обязательных для плана обмена.
// Если подсистема имеет объекты метаданных обязательные для включения в состав плана обмена,
// то в параметр <Объект> необходимо добавить эти объекты метаданных.
//
// Параметры:
// Объекты – Массив. Массив объектов метаданных конфигурации, которые необходимо включить в состав плана обмена.
// РаспределеннаяИнформационнаяБаза (только чтение) – Булево. Признак получения объектов для плана обмена РИБ.
// Истина – требуется получить список объектов плана обмена РИБ;
// Ложь – требуется получить список для плана обмена НЕ РИБ.
//
Процедура ПриПолученииОбязательныхОбъектовПланаОбмена(Объекты, Знач РаспределеннаяИнформационнаяБаза) Экспорт
	
	Если РаспределеннаяИнформационнаяБаза Тогда
		
		Объекты.Добавить(Метаданные.Справочники.ИдентификаторыОбъектовМетаданных);
		
	КонецЕсли;
	
КонецПроцедуры

// Используется для получения объектов метаданных, которые не следует включать в состав плана обмена.
// Если подсистема имеет объекты метаданных, которые не следует включать в состав плана обмена,
// то в параметр <Объект> необходимо добавить эти объекты метаданных.
//
// Параметры:
// Объекты – Массив. Массив объектов метаданных конфигурации, которые не следует включать в состав плана обмена.
// РаспределеннаяИнформационнаяБаза (только чтение) – Булево. Признак получения объектов для плана обмена РИБ.
// Истина – требуется получить список объектов-исключений плана обмена РИБ;
// Ложь – требуется получить список для плана обмена НЕ РИБ.
//
Процедура ПриПолученииОбъектовИсключенийПланаОбмена(Объекты, Знач РаспределеннаяИнформационнаяБаза) Экспорт
	
	Если РаспределеннаяИнформационнаяБаза Тогда
		
		Объекты.Добавить(Метаданные.Константы.ЗаголовокСистемы);
		Объекты.Добавить(Метаданные.Константы.ИспользоватьРазделениеПоОбластямДанных);
		Объекты.Добавить(Метаданные.Константы.НеИспользоватьРазделениеПоОбластямДанных);
		Объекты.Добавить(Метаданные.Константы.ЭтоАвтономноеРабочееМесто);
		Объекты.Добавить(Метаданные.Константы.КаталогВременныхФайловДляWindows);
		Объекты.Добавить(Метаданные.Константы.КаталогВременныхФайловДляLinux);
		
		Объекты.Добавить(Метаданные.РегистрыСведений.КэшПрограммныхИнтерфейсов);
		Объекты.Добавить(Метаданные.РегистрыСведений.НеразделенныеПользователи);
		
	КонецЕсли;
	
КонецПроцедуры

// Используется для получения объектов метаданных, которые должны входить в состав плана обмена
// и НЕ должны входить в состав подписок на события регистрации изменений для этого плана обмена.
// Эти объекты метаданных используются только в момент создания начального образа подчиненного узла
// и не мигрируют в процессе обмена.
// Если подсистема имеет объекты метаданных, которые участвуют только в создании начального образа подчиненного узла,
// то в параметр <Объект> необходимо добавить эти объекты метаданных.
//
// Параметры:
// Объекты – Массив. Массив объектов метаданных конфигурации.
//
Процедура ПриПолученииОбъектовНачальногоОбразаПланаОбмена(Объекты) Экспорт
	
	Объекты.Добавить(Метаданные.Константы.ПараметрыСлужебныхСобытий);
	Объекты.Добавить(Метаданные.Константы.ПараметрыБазовойФункциональности);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Дополнительные функции для работы с типами.

// Возвращает тип ссылки или ключа записи указанного объекта метаданных.
//
// Параметры:
//  ОбъектМетаданных – ОбъектМетаданных - регистр или ссылочный объект.
// 
//  Возвращаемое значение:
//   Тип ссылки или ключа записи.
//
Функция ТипСсылкиИлиКлючаЗаписиОбъектаМетаданных(ОбъектМетаданных) Экспорт
	
	Если ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
		
		Если ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрСведений";
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрНакопления";
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрБухгалтерии";
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрРасчета";
		КонецЕсли;
		Тип = Тип(ВидРегистра + "КлючЗаписи." + ОбъектМетаданных.Имя);
	Иначе
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		Тип = ТипЗнч(Менеджер.ПустаяСсылка());
	КонецЕсли;
	
	Возврат Тип;
	
КонецФункции

// Возвращает тип объекта или набора записей указанного объекта метаданных.
//
// Параметры:
//  ОбъектМетаданных – ОбъектМетаданных - регистр или ссылочный объект.
// 
//  Возвращаемое значение:
//   Тип объекта или набора записей.
//
Функция ТипОбъектаИлиНабораЗаписейОбъектаМетаданных(ОбъектМетаданных) Экспорт
	
	Если ОбщегоНазначения.ЭтоРегистр(ОбъектМетаданных) Тогда
		
		Если ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрСведений";
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрНакопления";
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрБухгалтерии";
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрРасчета(ОбъектМетаданных) Тогда
			ВидРегистра = "РегистрРасчета";
		КонецЕсли;
		Тип = Тип(ВидРегистра + "НаборЗаписей." + ОбъектМетаданных.Имя);
	Иначе
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
		ВидОбъекта = ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗнч(Менеджер.ПустаяСсылка()));
		Тип = Тип(ВидОбъекта + "Объект." + ОбъектМетаданных.Имя);
	КонецЕсли;
	
	Возврат Тип;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Прочие процедуры и функции.

// Возвращает имена предопределенных данных для указанного объекта
// метаданных. Может потребоваться при обновлении информационной базы.
//
// Параметры:
//  ПолноеИмя - полное имя объекта метаданных, который может содержать
//              предопределенные элементы.
//
// Возвращаемое значение:
//  ФиксированныйМассив имен предопределенных элементов.
//
Функция ИменаПредопределенныхДанных(ПолноеИмя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущаяТаблица.Ссылка КАК Ссылка,
	|	НЕОПРЕДЕЛЕНО КАК ИмяПредопределенныхДанных
	|ИЗ
	|	&ТекущаяТаблица КАК ТекущаяТаблица
	|ГДЕ
	|	ТекущаяТаблица.Предопределенный = ИСТИНА";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекущаяТаблица", ПолноеИмя);
	
	Если СтандартныеПодсистемыПовтИсп.ЭтоПлатформа83БезРежимаСовместимости() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕОПРЕДЕЛЕНО", "ТекущаяТаблица.ИмяПредопределенныхДанных");
	Иначе
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмя);
	КонецЕсли;
	
	ИменаПредопределенныхДанных = Новый СписокЗначений;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
	   И НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
	
		ОбщегоНазначения.УстановитьРазделениеСеанса(Истина, 0);
		Попытка
			Выборка = Запрос.Выполнить().Выбрать();
		Исключение
			ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
			ВызватьИсключение;
		КонецПопытки;
		
		Пока Выборка.Следующий() Цикл
			Если СтандартныеПодсистемыПовтИсп.ЭтоПлатформа83БезРежимаСовместимости() Тогда
				ИмяПредопределенныхДанных = Выборка.ИмяПредопределенныхДанных;
			Иначе
				ИмяПредопределенныхДанных = Менеджер.ПолучитьИмяПредопределенного(Выборка.Ссылка);
			КонецЕсли;
			Если ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
				ИменаПредопределенныхДанных.Добавить(ИмяПредопределенныхДанных);
			КонецЕсли;
		КонецЦикла;
		
		ОбщегоНазначения.УстановитьРазделениеСеанса(Ложь);
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если СтандартныеПодсистемыПовтИсп.ЭтоПлатформа83БезРежимаСовместимости() Тогда
				ИмяПредопределенныхДанных = Выборка.ИмяПредопределенныхДанных;
			Иначе
				ИмяПредопределенныхДанных = Менеджер.ПолучитьИмяПредопределенного(Выборка.Ссылка);
			КонецЕсли;
			Если ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
				ИменаПредопределенныхДанных.Добавить(ИмяПредопределенныхДанных);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ИменаПредопределенныхДанных.СортироватьПоЗначению();
	Возврат Новый ФиксированныйМассив(ИменаПредопределенныхДанных.ВыгрузитьЗначения());
	
КонецФункции

// Возвращает уточнения при возникновении проблем с параметрами работы программы.
Функция УточнениеОшибкиПараметровРаботыПрограммыДляРазработчика() Экспорт
	
	Возврат Символы.ПС + Символы.ПС +
		НСтр("ru = 'Для разработчика: возможно требуется обновить вспомогательные данные,
		           |которые влияют на работу программы. Для выполнения обновления можно:
		           |- воспользоваться внешней обработкой
		           |  ""Инструменты разработчика: Обновление вспомогательных данных"",
		           |- либо запустить программу с параметром командной строки 1С:Предприятия 8
		           |  ""/С ЗапуститьОбновлениеИнформационнойБазы"",
		           |- либо увеличить номер версии конфигурации, чтобы при очередном запуске
		           |  выполнились процедуры обновления данных информационной базы.'");
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает номер версии Библиотеки стандартных подсистем.
//
Функция ВерсияБиблиотеки() Экспорт
	
	Возврат СтандартныеПодсистемыПовтИсп.ОписанияПодсистем().ПоИменам["СтандартныеПодсистемы"].Версия;
	
КонецФункции

// Заполняет структуру параметров, необходимых для работы клиентского кода
// данной подсистемы при запуске конфигурации, т.е. в обработчиках событий
// - ПередНачаломРаботыСистемы,
// - ПриНачалеРаботыСистемы
//
// Важно: при запуске недопустимо использовать команды сброса кэша
// повторно используемых модулей, иначе запуск может привести
// к непредсказуемым ошибкам и лишним серверным вызовам
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
// Возвращаемое значение:
//   Булево   - Ложь, если дальнейшее заполнение параметров необходимо прервать.
//
Функция ДобавитьПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	// Обязательные параметры для продолжения работы.
	Параметры.Вставить("ИменаПодсистем", СтандартныеПодсистемыПовтИсп.ИменаПодсистем());
	
	// Проверка продолжения работы.
	Параметры.Вставить("ИнформационнаяБазаЗаблокированаДляОбновления",
		ОбновлениеИнформационнойБазы.ИнформационнаяБазаЗаблокированаДляОбновления(, Истина));
	
	Если ЗначениеЗаполнено(Параметры.ИнформационнаяБазаЗаблокированаДляОбновления) Тогда
		// Работа будет завершена.
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка запуска с пустым списком пользователей.
	Параметры.Вставить("ОшибкаЗапускаСПустымСпискомПользователей",
		ПользователиСлужебный.ПроверитьВозможностьЗапускаСПустымСпискомПользователейИБ(Истина));
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиПовтИсп = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиПовтИсп");
		Если МодульОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
			// Для автономного рабочего места проверка выполняется после загрузки данных.
			Параметры.ОшибкаЗапускаСПустымСпискомПользователей = "";
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.ОшибкаЗапускаСПустымСпискомПользователей) Тогда
		// Будет предложено создать администратора или завершить работу.
		Возврат Ложь;
	КонецЕсли;
	
	// Проверка необходимости предварительного обновления параметров работы программы.
	Параметры.Вставить("НеобходимоОбновлениеПараметровРаботыПрограммы",
		НеобходимоОбновлениеПараметровРаботыПрограммы());
	
	Если Параметры.НеобходимоОбновлениеПараметровРаботыПрограммы
	   И Параметры.ПервыйЗапросПараметров Тогда
		// Будет выполнено предварительное обновление.
		Параметры.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначения.ИнформационнаяБазаФайловая());
		
		Если ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ()
		   И ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
			
			МодульОбменДаннымиВызовСервера = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиВызовСервера");
			Если МодульОбменДаннымиВызовСервера.ВыполнитьЗагрузкуПараметровРаботыПрограммы() Тогда
				Параметры.Вставить("ПодтвердитьНастройкиЗагрузкиСообщенияВПодчиненномУзлеРИБ");
				Параметры.Вставить("ГлавныйУзел", ПланыОбмена.ГлавныйУзел());
			КонецЕсли;
		КонецЕсли;
		Возврат Ложь;
	КонецЕсли;
	
	// Обязательные параметры для всех режимов работы.
	Параметры.Вставить("ОбработчикиКлиентскихСобытий", СтандартныеПодсистемыПовтИсп.ПараметрыПрограммныхСобытий(
		).ОбработчикиСобытий.НаКлиенте);
	
	Параметры.Вставить("ДоступноИспользованиеРазделенныхДанных", 
		ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных());
	
	Параметры.Вставить("ПервыйЗапускИнформационнойБазы",
		ОбновлениеИнформационнойБазы.ПервыйЗапускИнформационнойБазы());
	
	Параметры.Вставить("РазделениеВключено", ОбщегоНазначенияПовтИсп.РазделениеВключено());
	Параметры.Вставить("ПодробнаяИнформация", Метаданные.ПодробнаяИнформация);
	
	Параметры.Вставить("НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы",
		ОбновлениеИнформационнойБазы.НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы());
	
	Параметры.Вставить("ЗагрузитьСообщениеОбменаДанными", Ложь);
	
	// При входе неразделенным пользователем в неразделенный сеанс ошибки авторизации нет.
	Параметры.Вставить("ОшибкаАвторизации", "");
	
	Если Параметры.РазделениеВключено И Не Параметры.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Параметры для работы в локальном режиме или
	// в сеансе с установленными значениями разделителей в модели сервиса.
	Параметры.Вставить("НеобходимоОбновлениеИнформационнойБазы",
		ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы());
	
	Если Не Параметры.РазделениеВключено
		И ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		
		МодульОбменДаннымиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСервер");
		Параметры.Вставить("ЗагрузитьСообщениеОбменаДанными", МодульОбменДаннымиСервер.ЗагрузитьСообщениеОбменаДанными());
	КонецЕсли;
	
	Параметры.Вставить("ЭтоРазделеннаяКонфигурация", ОбщегоНазначенияПовтИсп.ЭтоРазделеннаяКонфигурация());
	Параметры.Вставить("ЕстьДоступДляОбновленияВерсииПлатформы", ПравоДоступа("Администрирование", Метаданные));
	
	ОбщиеПараметры = ОбщегоНазначения.ОбщиеПараметрыБазовойФункциональности();
	Параметры.Вставить("МинимальноНеобходимаяВерсияПлатформы", ОбщиеПараметры.МинимальноНеобходимаяВерсияПлатформы);
	Параметры.Вставить("РаботаВПрограммеЗапрещена",            ОбщиеПараметры.РаботаВПрограммеЗапрещена);
	
	Параметры.Вставить("ОшибкаАвторизации", ПользователиСлужебный.АвторизоватьТекущегоПользователя(Истина));
	Если Параметры.ОшибкаАвторизации <> "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ИнформационнаяБазаЗаблокированаДляОбновления) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДобавитьОбщиеПараметрыРаботыКлиента(Параметры);
	
	Возврат Истина;
	
КонецФункции

// Заполняет структуру параметров, необходимых для работы клиентского кода
// данной подсистемы. 
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
Процедура ДобавитьПараметрыРаботыКлиента(Параметры) Экспорт
	
	Параметры.Вставить("ИменаПодсистем", СтандартныеПодсистемыПовтИсп.ИменаПодсистем());
	Параметры.Вставить("ДоступноИспользованиеРазделенныхДанных",
		ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных());
	Параметры.Вставить("РазделениеВключено", ОбщегоНазначенияПовтИсп.РазделениеВключено());
		
	ДобавитьОбщиеПараметрыРаботыКлиента(Параметры);
	
	Параметры.Вставить("ИмяКонфигурации",     Метаданные.Имя);
	Параметры.Вставить("СинонимКонфигурации", Метаданные.Синоним);
	Параметры.Вставить("ВерсияКонфигурации",  Метаданные.Версия);
	Параметры.Вставить("ПодробнаяИнформация", Метаданные.ПодробнаяИнформация);
	Параметры.Вставить("КодОсновногоЯзыка", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	Параметры.Вставить("ЭтоПлатформа83БезРежимаСовместимости", СтандартныеПодсистемыПовтИсп.ЭтоПлатформа83БезРежимаСовместимости());
	
	Параметры.Вставить("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы",
		ЗапрашиватьПодтверждениеПриЗавершенииПрограммы());
	
	// Параметры для внешних подключений пользователей
	Параметры.Вставить("ИнформацияОПользователе", ПолучитьИнформациюОПользователе());
	Параметры.Вставить("ИмяCOMСоединителя", ОбщегоНазначения.ИмяCOMСоединителя());
	
	Параметры.Вставить("ПоправкаКВремениСеанса", ТекущаяДатаСеанса()); // записываем серверное время для последующей замены его на разницу с клиентом.
	
КонецПроцедуры

// Заполняет структуру параметров, необходимых для работы клиентского кода
// при запуске конфигурации и в дальнейшем во время работы с ней. 
//
// Параметры:
//   Параметры   - Структура - структура параметров.
//
Процедура ДобавитьОбщиеПараметрыРаботыКлиента(Параметры) 
	
	Если Не Параметры.РазделениеВключено Или Параметры.ДоступноИспользованиеРазделенныхДанных Тогда
		
		Параметры.Вставить("АвторизованныйПользователь", Пользователи.АвторизованныйПользователь());
		Параметры.Вставить("ПредставлениеПользователя", Строка(Параметры.АвторизованныйПользователь));
		
		УстановитьПривилегированныйРежим(Истина);
		Параметры.Вставить("ЗаголовокПриложения", СокрЛП(Константы.ЗаголовокСистемы.Получить()));
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Параметры.Вставить("ЭтоГлавныйУзел", НЕ ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ());
	Параметры.Вставить("ИнформационнаяБазаФайловая", ОбщегоНазначения.ИнформационнаяБазаФайловая());
	
	Параметры.Вставить("ИнформационнаяБазаФайловаяБезМенеджераФоновыхЗаданий",
		ОбщегоНазначения.ИнформационнаяБазаФайловая()
		И НЕ ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83БезРежимаСовместимости());
	
	Параметры.Вставить("ТребуетсяОбновлениеКонфигурацииУзлаРИБ",
		ОбщегоНазначения.ТребуетсяОбновлениеКонфигурацииПодчиненногоУзлаРИБ());
	
	Параметры.Вставить("ЭтоБазоваяВерсияКонфигурации", ЭтоБазоваяВерсияКонфигурации());
	
КонецПроцедуры

// Возвращает массив поддерживаемых подсистемой ИмяПодсистемы названий номеров версий.
//
// Параметры:
// ИмяПодсистемы - Строка - Имя подсистемы.
//
// Возвращаемое значение:
// Массив строк.
//
Функция ПоддерживаемыеВерсии(ИмяПодсистемы) Экспорт
	
	МассивВерсий = Неопределено;
	СтруктураПоддерживаемыхВерсий = Новый Структура;
	
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(СтруктураПоддерживаемыхВерсий);
	КонецЦикла;
	
	СтруктураПоддерживаемыхВерсий.Свойство(ИмяПодсистемы, МассивВерсий);
	
	Если МассивВерсий = Неопределено Тогда
		Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(Новый Массив);
	Иначе
		Возврат ОбщегоНазначения.ЗначениеВСтрокуXML(МассивВерсий);
	КонецЕсли;
	
КонецФункции

// Возвращает соответствие имен событий массивам их обработчиков.
// 
// Возвращаемое значение:
//  Структура со свойствами:
//    НаКлиенте - Соответствие (см. ниже)
//    НаСервере - Соответствие (см. ниже)
//
//  Соответствие, где
//   Ключ     - Строка - полное имя события,
//   Значение - Массив структур со свойствами:
//               Версия - Строка - версия обработчика (пустая, если не была указана),
//               Модуль - имя модуля в котором размещен обработчик.
//
Функция ОбработчикиСобытий() Экспорт
	
	ОписанияПодсистем = СтандартныеПодсистемыПовтИсп.ОписанияПодсистем();
	
	// Определение всех доступных событий программы.
	КлиентскиеСобытия = Новый Массив;
	СерверныеСобытия  = Новый Массив;
	КлиентскиеСлужебныеСобытия = Новый Массив;
	СерверныеСлужебныеСобытия  = Новый Массив;
	
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		Описание = ОписанияПодсистем.ПоИменам[Подсистема];
		
		Если НЕ Описание.ДобавлятьСобытия
		   И НЕ Описание.ДобавлятьСлужебныеСобытия Тогда
			
			Продолжить;
		КонецЕсли;
		
		Модуль = ОбщегоНазначенияКлиентСервер.ОбщийМодуль(
			Описание.ОсновнойСерверныйМодуль);
		
		Если Описание.Имя = "СтандартныеПодсистемы" Тогда
			Модуль = СтандартныеПодсистемыСервер;
		КонецЕсли;
		
		Если Описание.ДобавлятьСобытия Тогда
			Модуль.ПриДобавленииСобытий(КлиентскиеСобытия, СерверныеСобытия);
		КонецЕсли;
		
		Если Описание.ДобавлятьСлужебныеСобытия Тогда
			Модуль.ПриДобавленииСлужебныхСобытий(КлиентскиеСлужебныеСобытия, СерверныеСлужебныеСобытия);
		КонецЕсли;
	КонецЦикла;
	
	ПроверкаУникальностиИменСобытий(КлиентскиеСобытия);
	ПроверкаУникальностиИменСобытий(СерверныеСобытия);
	ПроверкаУникальностиИменСобытий(КлиентскиеСлужебныеСобытия);
	ПроверкаУникальностиИменСобытий(СерверныеСлужебныеСобытия);
	
	// Подготовка новых массивов для добавления обработчиков.
	ОбработчикиКлиентскихСобытийПоПодсистемам = Новый Соответствие;
	ОбработчикиСерверныхСобытийПоПодсистемам  = Новый Соответствие;
	ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам = Новый Соответствие;
	ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам  = Новый Соответствие;
	
	ОбязательныеКлиентскиеСобытия = Новый Соответствие;
	ОбязательныеСерверныеСобытия  = Новый Соответствие;
	ОбязательныеКлиентскиеСлужебныеСобытия = Новый Соответствие;
	ОбязательныеСерверныеСлужебныеСобытия  = Новый Соответствие;
	
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		
		ОбработчикиКлиентскихСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(КлиентскиеСобытия, ОбязательныеКлиентскиеСобытия));
		
		ОбработчикиСерверныхСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(СерверныеСобытия, ОбязательныеСерверныеСобытия));
		
		ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(КлиентскиеСлужебныеСобытия, ОбязательныеКлиентскиеСлужебныеСобытия));
		
		ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам.Вставить(Подсистема,
			ШаблонОбработчиковСобытий(СерверныеСлужебныеСобытия, ОбязательныеСерверныеСлужебныеСобытия));
		
	КонецЦикла;
	
	// Добавление всех обработчиков для требуемых событий программы.
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		Описание = ОписанияПодсистем.ПоИменам[Подсистема];
		
		Если НЕ Описание.ДобавлятьОбработчикиСобытий
		   И НЕ Описание.ДобавлятьОбработчикиСлужебныхСобытий Тогда
			
			Продолжить;
		КонецЕсли;
		
		Модуль = ОбщегоНазначенияКлиентСервер.ОбщийМодуль(
			Описание.ОсновнойСерверныйМодуль);
		
		Если Описание.Имя = "СтандартныеПодсистемы" Тогда
			Модуль = СтандартныеПодсистемыСервер;
		КонецЕсли;
		
		Если Описание.ДобавлятьОбработчикиСобытий Тогда
			Модуль.ПриДобавленииОбработчиковСобытий(
				ОбработчикиКлиентскихСобытийПоПодсистемам[Подсистема],
				ОбработчикиСерверныхСобытийПоПодсистемам[Подсистема]);
		КонецЕсли;
		
		Если Описание.ДобавлятьОбработчикиСлужебныхСобытий Тогда
			Модуль.ПриДобавленииОбработчиковСлужебныхСобытий(
				ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам[Подсистема],
				ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам[Подсистема]);
		КонецЕсли;
	КонецЦикла;
	
	// Проверка обязательных событий.
	ОбязательныеСобытияБезОбработчиков = Новый Массив;
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеКлиентскиеСобытия, ОбработчикиКлиентскихСобытийПоПодсистемам);
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеСерверныеСобытия, ОбработчикиСерверныхСобытийПоПодсистемам);
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеКлиентскиеСлужебныеСобытия, ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам);
	
	ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
		ОбязательныеСерверныеСлужебныеСобытия, ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам);
	
	Если ОбязательныеСобытияБезОбработчиков.Количество() > 0 Тогда
		ИмяСобытия  = НСтр("ru = 'Обработчики событий'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
		
		Комментарий = НСтр("ru = 'Для следующих обязательных событий не определены обработчики:'")
			+ Символы.ПС + СтроковыеФункцииКлиентСервер.ПолучитьСтрокуИзМассиваПодстрок(ОбязательныеСобытияБезОбработчиков, Символы.ПС);
		
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		ВызватьИсключение НСтр("ru = 'Для обязательных событий не определены обработчики.
		                             |Подробности см. в журнале регистрации.'");
	КонецЕсли;
	
	// Форматирование описаний обработчиков событий программы.
	ВсеОбработчикиСобытий = Новый Структура;
	ВсеОбработчикиСобытий.Вставить("НаКлиенте", Новый Структура);
	ВсеОбработчикиСобытий.Вставить("НаСервере", Новый Структура);
	
	ВсеОбработчикиСобытий.НаКлиенте.Вставить("ОбработчикиСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиКлиентскихСобытийПоПодсистемам));
	
	ВсеОбработчикиСобытий.НаСервере.Вставить("ОбработчикиСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиСерверныхСобытийПоПодсистемам));
	
	ВсеОбработчикиСобытий.НаКлиенте.Вставить("ОбработчикиСлужебныхСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиКлиентскихСлужебныхСобытийПоПодсистемам));
	
	ВсеОбработчикиСобытий.НаСервере.Вставить("ОбработчикиСлужебныхСобытий", СтандартноеОписаниеОбработчиковСобытий(
		ОписанияПодсистем, ОбработчикиСерверныхСлужебныхСобытийПоПодсистемам));
	
	Возврат Новый ФиксированнаяСтруктура(ВсеОбработчикиСобытий);
	
КонецФункции

// Возвращает серверный общий модуль по имени.
Функция СерверныйОбщийМодуль(Имя) Экспорт
	
	Если Метаданные.ОбщиеМодули.Найти(Имя) <> Неопределено Тогда
		Модуль = Вычислить(Имя);
	Иначе
		Модуль = Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Модуль) <> Тип("ОбщийМодуль") Тогда
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Общий модуль ""%1"" не найден.'"), Имя);
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции

// Только для внутреннего использования.
Функция НеобходимоОбновлениеПараметровРаботыПрограммы(ВыполнитьЗагрузку = Истина) Экспорт
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		// Обновление в модели сервиса.
		Если НЕ ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных()
			И ОбновлениеИнформационнойБазы.НеобходимоОбновлениеНеразделенныхДанныхИнформационнойБазы() Тогда
			
			Возврат Истина;
		КонецЕсли;
	Иначе
		// Обновление в локальном режиме.
		Если ОбновлениеИнформационнойБазы.НеобходимоОбновлениеИнформационнойБазы() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
		МодульОбменДаннымиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСервер");
		
		Если МодульОбменДаннымиСервер.НастройкаПодчиненногоУзлаРИБ() Тогда
			ВыполнитьЗагрузку = Ложь;
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ПользователиСлужебныйПовтИсп.Параметры();
	Исключение
		ВыполнитьЗагрузку = Ложь;
		Возврат Истина;
	КонецПопытки;
		
	Возврат Ложь;
	
КонецФункции

// Только для внутреннего использования.
Процедура ЗагрузитьОбновитьПараметрыРаботыПрограммы(ОшибкаУстановкиМонопольногоРежима = Неопределено) Экспорт
	
	ВыполнитьЗагрузку = Истина;
	
	Если НЕ НеобходимоОбновлениеПараметровРаботыПрограммы(ВыполнитьЗагрузку) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено()
	   И ОбщегоНазначенияПовтИсп.ДоступноИспользованиеРазделенныхДанных() Тогда
		ВызватьИсключение
			НСтр("ru = 'Обновление параметров работы программы не может
			           |быть выполнено в разделенном режиме модели сервиса.'");
	КонецЕсли;
	
	Если СтандартныеПодсистемыПовтИсп.ОтключитьСправочникИдентификаторыОбъектовМетаданных() Тогда
		ВыполнитьЗагрузку = Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	СнятьМонопольныйРежим = Ложь;
	Попытка
		Если ВыполнитьЗагрузку
		   И ОбщегоНазначения.ЭтоПодчиненныйУзелРИБ() Тогда
			// Есть РИБ-обмен данными и обновление в подчиненном узле ИБ.
			
			Если КонфигурацияИзменена() Тогда
				ВызватьИсключение
					НСтр("ru = 'Найдены изменения программы, полученные из главного узла.
					           |Завершите работу программы. Откройте программу в конфигураторе и
					           |выполните команду ""Обновить конфигурацию базы данных (F7)"".
					           |
					           |После этого запустите программу.'");
			КонецЕсли;
			
			// Предварительное обновление кэша служебных событий.
			Константы.ПараметрыСлужебныхСобытий.СоздатьМенеджерЗначения().Обновить();
			
			СтандартнаяОбработка = Истина;
			ОбщегоНазначенияПереопределяемый.ПередЗагрузкойИдентификаторовОбъектовМетаданныхВПодчиненномРИБУзле(
				СтандартнаяОбработка);
			
			Если СтандартнаяОбработка = Истина
			   И ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
				
				Если НЕ МонопольныйРежим() Тогда
					Попытка
						УстановитьМонопольныйРежим(Истина);
						СнятьМонопольныйРежим = Истина;
					Исключение
						Если ОшибкаУстановкиМонопольногоРежима <> Неопределено Тогда
							ОшибкаУстановкиМонопольногоРежима =
								НСтр("ru = 'Невозможно выполнить обновление информационной базы:
								           |- Невозможно установить монопольный режим
								           |- Версия конфигурации не предусматривает обновление без установки монопольного режима.'");
						КонецЕсли;
						ВызватьИсключение ОшибкаУстановкиМонопольногоРежима;
					КонецПопытки;
				КонецЕсли;
				
				// Загрузка идентификаторов объектов метаданных из главного узла.
				МодульОбменДаннымиСервер = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ОбменДаннымиСервер");
				МодульОбменДаннымиСервер.ПередПроверкойИдентификаторовОбъектовМетаданныхВПодчиненномУзлеРИБ();
			КонецЕсли;
			
			// Проверка загрузки идентификаторов объектов метаданных из главного узла.
			ЕстьКритичныеИзменения = Ложь;
			Попытка
				Справочники.ИдентификаторыОбъектовМетаданных.ВыполнитьОбновлениеДанных(, , Истина, ЕстьКритичныеИзменения);
			Исключение
				Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
					// Сброс кэша сообщения обмена.
					МодульОбменДаннымиСервер.ПриОшибкеПроверкиИдентификаторовОбъектовМетаданныхВПодчиненномУзлеРИБ();
				КонецЕсли;
				
				ВызватьИсключение;
			КонецПопытки;
			
			Если ЕстьКритичныеИзменения Тогда
				Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.ОбменДанными") Тогда
					// Сброс кэша сообщения обмена, вызов исключения с пояснением дальнейших действий.
					МодульОбменДаннымиСервер.ПриОшибкеПроверкиИдентификаторовОбъектовМетаданныхВПодчиненномУзлеРИБ(Истина);
				КонецЕсли;
				
				ТекстОшибки =
					НСтр("ru = 'Из главного узла не загружены изменения справочника ""Идентификаторы объектов метаданных"".'");
				
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Обмен данными.Загрузка справочника Идентификаторы объектов метаданных'",
						ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,
					,
					,
					ТекстОшибки);
				
				ВызватьИсключение ТекстОшибки;
			КонецЕсли;
		КонецЕсли;
		
		// Нет РИБ-обмена данными
		// или обновление в главном узле ИБ
		// или обновление при первом запуске подчиненного узла
		// или обновление после загрузки справочника "Идентификаторы объектов метаданных" из главного узла.
		ОбновитьПараметрыРаботыПрограммы( , , ОшибкаУстановкиМонопольногоРежима);
	Исключение
		Если СнятьМонопольныйРежим Тогда
			УстановитьМонопольныйРежим(Ложь);
		КонецЕсли;
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

// Возвращает соответствие имен и серверных модулей.
Функция ИменаСерверныхМодулей() Экспорт
	
	СерверныеМодули = Новый Соответствие;
	ИнформационнаяБазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Для каждого ОбщийМодуль Из Метаданные.ОбщиеМодули Цикл
		Если ОбщийМодуль.Глобальный Тогда
			Продолжить;
		КонецЕсли;
		
		Если ОбщийМодуль.Сервер
	#Если ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		 Или ИнформационнаяБазаФайловая
	#КонецЕсли
		Тогда
			СерверныеМодули.Вставить(Вычислить(ОбщийМодуль.Имя), ОбщийМодуль.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СерверныеМодули);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Для обновления справочника ИдентификаторыОбъектовМетаданных

// Только для внутреннего использования.
Функция ПланыОбменаМенеджер() Экспорт
	
	Возврат ПланыОбмена;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////
// Инициализации параметров сеанса

// Инициализация параметров сеанса.
// Параметры
//  ИменаПараметровСеанса - массив, неопределено - 
//                         в массиве имена параметров сеанса для инициализации
//
//  Возвращает массив имен установленных параметров сеанса
//
Функция УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	Перем ТекстСообщения;
	
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
	// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры
	УстановленныеПараметры = Новый Массив;
	
	Если ИменаПараметровСеанса = Неопределено Тогда
		ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
		
		// Начальное выполнение на сервере перед запуском программы.
		ПередЗапускомПрограммы();
		Возврат УстановленныеПараметры;
		
	ИначеЕсли ИменаПараметровСеанса.Найти("ПараметрыКлиентаНаСервере") <> Неопределено Тогда
		
		ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
		УстановленныеПараметры.Добавить("ПараметрыКлиентаНаСервере");
	КонецЕсли;
	
	Обработчики = Новый Соответствие;
	ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииОбработчиковУстановкиПараметровСеанса");
	
	Для каждого Обработчик Из ОбработчикиСобытия Цикл
		Обработчик.Модуль.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	КонецЦикла;
	
	ОбработчикиСобственные = ОбщегоНазначенияПереопределяемый.ОбработчикиИнициализацииПараметровСеанса();
	
	Для Каждого Запись Из ОбработчикиСобственные Цикл
		Обработчики.Вставить(Запись.Ключ, Запись.Значение);
	КонецЦикла;
	
	// массив с ключами параметров сеанса
	// задаются начальным словом в имени параметра сеанса и символом "*"
	ПараметрыСеансаКлючи = Новый Массив;
	
	Для Каждого Запись Из Обработчики Цикл
		Если Найти(Запись.Ключ, "*") > 0 Тогда
			КлючПараметра = СокрЛП(Запись.Ключ);
			ПараметрыСеансаКлючи.Добавить(Лев(КлючПараметра, СтрДлина(КлючПараметра)-1));
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ИмяПараметра Из ИменаПараметровСеанса Цикл
		Если УстановленныеПараметры.Найти(ИмяПараметра) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Обработчик = Обработчики.Получить(ИмяПараметра);
		Если Обработчик <> Неопределено Тогда
			Если Не ОбщегоНазначения.ПроверитьИмяЭкспортнойПроцедуры(Обработчик, ТекстСообщения) Тогда
				ВызватьИсключение ТекстСообщения;
			КонецЕсли;
			
			Выполнить Обработчик + "(ИмяПараметра, УстановленныеПараметры)";
			Продолжить;
		КонецЕсли;
		Для Каждого ИмяКлючаПараметра Из ПараметрыСеансаКлючи Цикл
			Если Лев(ИмяПараметра, СтрДлина(ИмяКлючаПараметра)) = ИмяКлючаПараметра Тогда
				Обработчик = Обработчики.Получить(ИмяКлючаПараметра+"*");
				Если Не ОбщегоНазначения.ПроверитьИмяЭкспортнойПроцедуры(Обработчик, ТекстСообщения) Тогда
					ВызватьИсключение ТекстСообщения;
				КонецЕсли;
				Выполнить Обработчик + "(ИмяПараметра, УстановленныеПараметры)";
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат УстановленныеПараметры;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы

// Добавляет процедуры-обработчики обновления, необходимые данной подсистеме.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                  общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "СтандартныеПодсистемыСервер.УстановитьКонстантуНеИспользоватьРазделениеПоОбластямДанных";
	Обработчик.Приоритет = 99;
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.МонопольныйРежим = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "СтандартныеПодсистемыСервер.ПометитьЗаписиКэшаВерсийНеактуальными";
	Обработчик.Приоритет = 99;
	Обработчик.ОбщиеДанные = Истина;
	Обработчик.МонопольныйРежим = Ложь;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "2.1.3.4";
	Обработчик.Процедура = "СтандартныеПодсистемыСервер.УстановитьВерсиюОписанийИзменений";
	
КонецПроцедуры

// Устанавливает корректное значение константе НеИспользоватьРазделениеПоОбластямДанных
//
Процедура УстановитьКонстантуНеИспользоватьРазделениеПоОбластямДанных(Параметры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НовыеЗначения = Новый Соответствие;
	
	Если Константы.ИспользоватьРазделениеПоОбластямДанных.Получить() Тогда
		
		НовыеЗначения.Вставить("НеИспользоватьРазделениеПоОбластямДанных", Ложь);
		НовыеЗначения.Вставить("ЭтоАвтономноеРабочееМесто", Ложь)
		
	ИначеЕсли Константы.ЭтоАвтономноеРабочееМесто.Получить() Тогда
		
		НовыеЗначения.Вставить("НеИспользоватьРазделениеПоОбластямДанных", Ложь);
		
	Иначе
		
		НовыеЗначения.Вставить("НеИспользоватьРазделениеПоОбластямДанных", Истина);
		
	КонецЕсли;
	
	Для каждого КлючИЗначения Из НовыеЗначения Цикл
		
		Если Константы[КлючИЗначения.Ключ].Получить() <> КлючИЗначения.Значение Тогда
			
			Если НЕ Параметры.МонопольныйРежим Тогда
				Параметры.МонопольныйРежим = Истина;
				Возврат; // Требуется изменение
			КонецЕсли;
			
			Константы[КлючИЗначения.Ключ].Установить(КлючИЗначения.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Сбрасывает дату обновления всех записей кэша версий, таким
// образом все записи кэша начинают считаться неактуальными.
//
Процедура ПометитьЗаписиКэшаВерсийНеактуальными() Экспорт
	
	НачатьТранзакцию();
	
	НаборЗаписей = РегистрыСведений.КэшПрограммныхИнтерфейсов.СоздатьНаборЗаписей();
	
	Блокировка = Новый БлокировкаДанных;
	Блокировка.Добавить("РегистрСведений.КэшПрограммныхИнтерфейсов");
	Блокировка.Заблокировать();
	
	НаборЗаписей.Прочитать();
	Для каждого Запись Из НаборЗаписей Цикл
		Запись.ДатаОбновления = Неопределено;
	КонецЦикла;
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Устанавливает последнюю отображенную версию описания изменений всем пользователям
// области данных в текущую версию (по данным регистра ВерсииПодсистем)
//
Процедура УстановитьВерсиюОписанийИзменений() Экспорт
	
	ТекущаяВерсия = ОбновлениеИнформационнойБазы.ВерсияИБ(Метаданные.Имя);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Пользователи.ИдентификаторПользователяИБ КАК Идентификатор
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Служебный = ЛОЖЬ
	|	И Пользователи.ИдентификаторПользователяИБ <> &ПустойИдентификатор";
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Выборка.Идентификатор);
		Если ПользовательИБ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПоследняяВерсия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбновлениеИБ",
			"ПоследняяВерсияОтображенияИзмененийСистемы", , , ПользовательИБ.Имя);
			
		Если ПоследняяВерсия <> Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПоследняяВерсия = ТекущаяВерсия;
		
		ВыполненныеОбработчики = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбновлениеИБ", 
			"ВыполненныеОбработчики", , , ПользовательИБ.Имя);
			
		Если ВыполненныеОбработчики <> Неопределено Тогда
			
			Если ВыполненныеОбработчики.Строки.Количество() > 0 Тогда
				Версия = ВыполненныеОбработчики.Строки[ВыполненныеОбработчики.Строки.Количество() - 1].Версия;
				Если Версия <> "*" Тогда
					ПоследняяВерсия = Версия;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("ОбновлениеИБ",
			"ПоследняяВерсияОтображенияИзмененийСистемы", ПоследняяВерсия, , ПользовательИБ.Имя);
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Подтверждение завершения работы программы

// Прочитать настройку подтверждения завершения работы программы
// для текущего пользователя.
// 
// Возвращаемое значение:
//   Булево   - значение настройки.
// 
Функция ЗапрашиватьПодтверждениеПриЗавершенииПрограммы() Экспорт
	Результат = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("ОбщиеНастройкиПользователя", "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы");
	
	Если Результат = Неопределено Тогда
		
		Результат = ОбщегоНазначения.ОбщиеПараметрыБазовойФункциональности(
			).ЗапрашиватьПодтверждениеПриЗавершенииПрограммы;
		
		СтандартныеПодсистемыВызовСервера.СохранитьНастройкуПодтвержденияПриЗавершенииПрограммы(Результат);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработка подписок на события планов обмена РИБ

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриОтправкеДанныхПодчиненному() в синтаксис-помощнике.
// 
Процедура ПриОтправкеДанныхПодчиненномуСобытие(Источник, ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза) Экспорт
	
	ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Источник);
	
КонецПроцедуры

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриОтправкеДанныхГлавному() в синтаксис-помощнике.
// 
Процедура ПриОтправкеДанныхГлавномуСобытие(Источник, ЭлементДанных, ОтправкаЭлемента) Экспорт
	
	ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Источник);
	
КонецПроцедуры

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриПолученииДанныхОтПодчиненного() в синтаксис-помощнике.
// 
Процедура ПриПолученииДанныхОтПодчиненногоСобытие(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Источник);
	
КонецПроцедуры

// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
//
// Параметры:
// см. описание обработчика события ПриПолученииДанныхОтГлавного() в синтаксис-помощнике.
// 
Процедура ПриПолученииДанныхОтГлавногоСобытие(Источник, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	
	ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Источник);
	
КонецПроцедуры

// Процедура-обработчик подписки на событие ПередЗаписью для ПланОбменаОбъект
// Используется для вызова обработчика события ПослеПолученияДанных при обмене в распределенной ИБ.
//
Процедура ПослеПолученияДанных(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("Загрузка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Метаданные().РаспределеннаяИнформационнаяБаза Тогда
		
		Если Источник.НомерПринятого <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "НомерПринятого") Тогда
			
			Если ПланыОбмена.ГлавныйУзел() = Источник.Ссылка Тогда
				
				ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
					"СтандартныеПодсистемы.БазоваяФункциональность\ПослеПолученияДанныхОтГлавного");
				
				Для каждого Обработчик Из ОбработчикиСобытия Цикл
					Обработчик.Модуль.ПослеПолученияДанныхОтГлавного(Источник, Отказ);
				КонецЦикла;
				
			Иначе
				ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
					"СтандартныеПодсистемы.БазоваяФункциональность\ПослеПолученияДанныхОтПодчиненного");
				
				Для каждого Обработчик Из ОбработчикиСобытия Цикл
					Обработчик.Модуль.ПослеПолученияДанныхОтПодчиненного(Источник, Отказ);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура-обработчик подписки на событие ПередЗаписью для ПланОбменаОбъект
// Используется для вызова обработчика события ПослеОтправкиДанных при обмене в распределенной ИБ.
//
Процедура ПослеОтправкиДанных(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("Загрузка") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Метаданные().РаспределеннаяИнформационнаяБаза Тогда
		
		Если Источник.НомерОтправленного <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "НомерОтправленного") Тогда
			
			Если ПланыОбмена.ГлавныйУзел() = Источник.Ссылка Тогда
				
				ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
					"СтандартныеПодсистемы.БазоваяФункциональность\ПослеОтправкиДанныхГлавному");
				
				Для каждого Обработчик Из ОбработчикиСобытия Цикл
					Обработчик.Модуль.ПослеОтправкиДанныхГлавному(Источник, Отказ);
				КонецЦикла;
				
			Иначе
				
				ОбработчикиСобытия = ОбщегоНазначения.ОбработчикиСлужебногоСобытия(
					"СтандартныеПодсистемы.БазоваяФункциональность\ПослеОтправкиДанныхПодчиненному");
				
				Для каждого Обработчик Из ОбработчикиСобытия Цикл
					Обработчик.Модуль.ПослеОтправкиДанныхПодчиненному(Источник, Отказ);
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ПередЗапускомПрограммы()
	
	// Привилегированный режим (установлен платформой).
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		
		МодульРаботаВМоделиСервиса = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РаботаВМоделиСервиса");
		МодульРаботаВМоделиСервиса.ПриПроверкеВключенияБезопасногоРежимаРазделенияДанных();
		
	КонецЕсли;
	
	// Проверка заполнения версии конфигурации.
	Если ПустаяСтрока(Метаданные.Версия) Тогда
		ВызватьИсключение НСтр("ru = 'Не заполнено свойство конфигурации Версия.'");
	Иначе
		Попытка
			НулеваяВерсия = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Метаданные.Версия, "0.0.0.0") = 0;
		Исключение
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не правильно заполнено свойство конфигурации Версия: ""%1"".
				           |Правильный формат, например: ""2.1.3.70"".'"),
				Метаданные.Версия);
		КонецПопытки;
		Если НулеваяВерсия Тогда
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не правильно заполнено свойство конфигурации Версия: ""%1"".
				           |Версия не может быть нулевой.'"),
				Метаданные.Версия);
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса.РезервноеКопированиеОбластейДанных") Тогда
		// Установка флага активности пользователей в области
		МодульРезервноеКопированиеОбластейДанных = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("РезервноеКопированиеОбластейДанных");
		МодульРезервноеКопированиеОбластейДанных.УстановитьФлагАктивностиПользователяВОбласти();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьИнформациюОПользователе()
	
	// Вычисляем актуальное имя пользователя, даже если оно было ранее изменено в текущем сеансе;
	// Например, для подключения к текущей ИБ через внешнее соединение из этого сеанса;
	// Во всех остальных случаях достаточно получить ПользователиИнформационнойБазы.ТекущийПользователь()
	ТекущийПользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	
	Если ТекущийПользователь = Неопределено Тогда
		ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	КонецЕсли;
	
	Информация = Новый Структура;
	Информация.Вставить("Имя",                       ТекущийПользователь.Имя);
	Информация.Вставить("ПолноеИмя",                 ТекущийПользователь.ПолноеИмя);
	Информация.Вставить("ПарольУстановлен",          ТекущийПользователь.ПарольУстановлен);
	Информация.Вставить("АутентификацияOpenID",      ТекущийПользователь.АутентификацияOpenID);
	Информация.Вставить("АутентификацияСтандартная", ТекущийПользователь.АутентификацияСтандартная);
	Информация.Вставить("АутентификацияОС",          ТекущийПользователь.АутентификацияОС);
	
	Возврат Информация;
	
КонецФункции

Функция ПредставлениеОбъектовМетаданных(Объекты)
	
	Результат = Новый Массив;
	
	Для Каждого Объект Из Объекты Цикл
		
		Результат.Добавить(Объект.ПолноеИмя());
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ИгнорироватьОтправкуИдентификаторовОбъектовМетаданных(ЭлементДанных, ОтправкаЭлемента, Знач СозданиеНачальногоОбраза = Ложь)
	
	Если Не СозданиеНачальногоОбраза
		И ОбъектМетаданных(ЭлементДанных) = Метаданные.Справочники.ИдентификаторыОбъектовМетаданных Тогда
		
		ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИгнорироватьОтправкуОбъектовНачальногоОбраза(ЭлементДанных, ОтправкаЭлемента, Знач СозданиеНачальногоОбраза = Ложь)
	
	Если Не СозданиеНачальногоОбраза
		И ЭтоОбъектНачальногоОбразаУзлаРИБ(ОбъектМетаданных(ЭлементДанных)) Тогда
		
		ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИгнорироватьПолучениеОбъектовНачальногоОбраза(ЭлементДанных, ПолучениеЭлемента)
	
	Если Не СозданиеНачальногоОбраза(ЭлементДанных)
		И ЭтоОбъектНачальногоОбразаУзлаРИБ(ОбъектМетаданных(ЭлементДанных)) Тогда
		
		ПолучениеЭлемента = ПолучениеЭлементаДанных.Игнорировать;
		
	КонецЕсли;
	
КонецФункции

Функция ОбъектМетаданных(Знач ЭлементДанных)
	
	Возврат ?(ТипЗнч(ЭлементДанных) = Тип("УдалениеОбъекта"), ЭлементДанных.Ссылка.Метаданные(), ЭлементДанных.Метаданные());
	
КонецФункции

Функция СозданиеНачальногоОбраза(Знач ЭлементДанных)
	
	Возврат ?(ТипЗнч(ЭлементДанных) = Тип("УдалениеОбъекта"), Ложь, ЭлементДанных.ДополнительныеСвойства.Свойство("СозданиеНачальногоОбраза"));
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Объявление событий, к которым можно добавлять обработчики.

// Объявляет служебные события подсистемы БазоваяФункциональность:
//
// Клиентские события:
//   ПередНачаломРаботыСистемы,
//   ПриНачалеРаботыСистемы,
//   ПриОбработкеПараметровЗапуска,
//   ПередЗавершениемРаботыСистемы,
//   ПриПолученииСпискаПредупрежденийЗавершенияРаботы,
//   ПриОпределенииФормыАктивныхПользователей.
//
// Серверные события:
//   ПриДобавленииОбработчиковУстановкиПараметровСеанса,
//   ПриДобавленииИсключенийПоискаСсылок,
//   ПриОпределенииПредставленияПредмета,
//   ПриДобавленииПереименованийОбъектовМетаданных,
//   ПриДобавленииПараметровРаботыКлиентаПриЗапуске,
//   ПриДобавленииПараметровРаботыКлиента,
//   ПриДобавленииПараметровРаботыКлиентаПриЗавершении,
//   ПриВключенииРазделенияПоОбластямДанных,
//   ПриОтправкеДанныхПодчиненному,
//   ПриОтправкеДанныхГлавному,
//   ПриПолученииДанныхОтПодчиненного,
//   ПриПолученииДанныхОтГлавного,
//   ПослеПолученияДанныхОтПодчиненного,
//   ПослеПолученияДанныхОтГлавного,
//   ПослеОтправкиДанныхГлавному,
//   ПослеОтправкиДанныхПодчиненному,
//   ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов.
//
Процедура ПриДобавленииСлужебныхСобытийБазовойФункциональности(КлиентскиеСобытия, СерверныеСобытия) Экспорт
	
	// КЛИЕНТСКИЕ СОБЫТИЯ.
	
	// Вызывается перед интерактивным началом работы пользователя с областью данных.
	// Соответствует событию ПередНачаломРаботыСистемы модулей приложения.
	//
	// Параметры:
	//  Отказ - Булево - отказ в от начала работы. Если параметр установить
	//          Истина, тогда начало работы с областью данных будет прервано.
	//
	// Синтаксис:
	// Процедура ПередНачаломРаботыСистемы(Отказ) Экспорт
	//
	// (То же, что ОбщегоНазначенияКлиентПереопределяемый.ПередНачаломРаботыСистемы).
	КлиентскиеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПередНачаломРаботыСистемы");
	
	// Вызывается при интерактивном начале работы пользователя с областью данных.
	// Соответствует событию ПриНачалеРаботыСистемы модулей приложения.
	//
	// Синтаксис:
	// Процедура ПриНачалеРаботыСистемы() Экспорт
	//
	// (То же, что ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы).
	КлиентскиеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриНачалеРаботыСистемы");
	
	// Вызывается при интерактивном начале работы пользователя с областью данных.
	//
	// Параметры:
	//  ПервыйПараметр   - Строка - первое значение параметра запуска,
	//                     до первого символа ";" в верхнем регистре.
	//  ПараметрыЗапуска – Массив – массив строк разделенных символом ";" в параметре запуска,
	//                     переданным в конфигурацию с помощью ключа командной строки /C.
	//  Отказ            - Булево (возвращаемое значение), если установить Истина,
	//                     обработка события ПриНачалеРаботыСистемы будет прервана.
	//
	// Синтаксис:
	// Процедура ПриОбработкеПараметровЗапуска(ПервыйПараметр, ПараметрыЗапуска, Отказ) Экспорт
	//
	// (То же, что ОбщегоНазначенияКлиентПереопределяемый.ОбработатьПараметрыЗапуска).
	КлиентскиеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОбработкеПараметровЗапуска");
	
	// Вызывается перед интерактивным завершением работы пользователя с областью данных.
	// Соответствует событию ПередЗавершениемРаботыСистемы модулей приложения.
	//
	// Параметры:
	//  Отказ - Булево - отказ в от начала работы. Если параметр установить
	//          Истина, тогда начало работы с областью данных будет прервано.
	//
	// Синтаксис:
	// Процедура ПередЗавершениемРаботыСистемы(Отказ) Экспорт
	//
	// (То же, что ОбщегоНазначенияКлиентПереопределяемый.ПередЗавершениемРаботыСистемы).
	КлиентскиеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПередЗавершениемРаботыСистемы");
	
	// Доопределяет список предупреждений пользователю перед завершением работы системы.
	//
	// Параметры:
	//  Предупреждения - Массив, в который можно добавить элементы типа Структура с полями:
	//    ТекстФлажка      - Строка - текст флажка.
	//    ПоясняющийТекст  - Строка - текст, выводимый в форме сверху
	//                       управляющего элемента (флажок или гиперссылка).
	//    ТекстГиперссылки - Строка - текст гиперссылки.
	//    ДействиеПриУстановленномФлажке - Структура с полями:
	//      Форма          - путь к открываемой форме.
	//      ПараметрыФормы - произвольная структура параметров формы Форма. 
	//    ДействиеПриНажатииГиперссылки - Структура с полями:
	//      Форма          - Строка    - путь к форме, которая должна открываться по нажатию на гиперссылку.
	//      ПараметрыФормы - Структура - произвольная структура параметров для вышеописанной формы.
	//      ПрикладнаяФормаПредупреждения - Строка - путь к форме, которая должна открываться сразу
	//                                      вместо универсальной формы в случае, когда в списке 
	//                                      предупреждений оказывается только одно данное предупреждение.
	//      ПараметрыПрикладнойФормыПредупреждения - Структура - произвольная структура
	//                                               параметров для вышеописанной формы.
	// Синтаксис:
	// Процедура ПриПолученииСпискаПредупрежденийЗавершенияРаботы(Предупреждения) Экспорт
	//
	КлиентскиеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииСпискаПредупрежденийЗавершенияРаботы");
	
	// Переопределяет стандартное предупреждение открытием произвольной формы активных пользователей.
	//
	// Параметры:
	//  ИмяФормы - Строка (возвращаемое значение).
	//
	// Синтаксис:
	// Процедура ПриОткрытииФормыАктивныхПользователей(ИмяФормы) Экспорт
	//
	КлиентскиеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииФормыАктивныхПользователей");
	
	// СЕРВЕРНЫЕ СОБЫТИЯ.
	
	// Доопределяет обработчики установки параметров сеанса.
	//
	// Параметры:
	//  Обработчики - Соответствие, где
	//                Ключ     - Строка - <ИмяПараметраСеанса> или <НачалоИмениПараметраСеанса*>.
	//                Значение - Строка - полное имя обработчика.
	//
	//  Примечание. Символ '*'используется в конце имени параметра сеанса и обозначает,
	//              что один обработчик будет вызван для инициализации всех параметров сеанса
	//              с именем, начинающимся на слово НачалоИмениПараметраСеанса
	//
	// Для задания обработчиков параметров сеанса следует использовать шаблон:
	// Обработчики.Вставить("<ИмяПараметраСеанса>|<НачалоИмениПараметраСеанса*>", "Обработчик");
	//
	// Синтаксис:
	// Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.ОбработчикиИнициализацииПараметровСеанса).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииОбработчиковУстановкиПараметровСеанса");
	
	// Доопределяет список объектов метаданных, содержимое которых не должно учитывается в бизнес-логике приложения.
	//
	// Описание:
	//   Для документа "Реализация товаров и услуг" настроены подсистемы "Версионирование объектов" и "Свойства".
	//   При этом документ может быть указан в других объектах метаданных - документах или регистрах.
	//   Часть ссылок имеют значение для бизнес-логики (например движения по регистрам) и должны выводиться пользователю.
	//   Другая часть ссылок - "техногенные" ссылки на документ из данных подсистем "Версионирование объектов" и "Свойства",
	//     должны скрываться от пользователя при поиске ссылок на объект. 
	//     Например, в обработке удаления помеченных или в подсистеме запрета редактирования ключевых реквизитов.
	//   Список таких "техногенных" объектов нужно перечислить в этой функции.
	//
	// Важно:
	//   Для избежания появления пустых "битых" ссылок рекомендуется предусмотреть процедуру очистки указанных объектов метаданных.
	//   Для измерений регистров сведений - с помощью установки флажка "Ведущее",
	//     тогда запись регистра сведений будет удалена вместе с удалением ссылки, указанной в измерении.
	//   Для других реквизитов указанных объектов - с помощью подписки на событие ПередУдалением всех типов объектов метаданных,
	//     которые могут быть записаны в реквизиты указанных объектов метаданных.
	//     В обработчике необходимо найти "техногенные" объекты, в реквизитах которых указана ссылка удаляемого объекта,
	//     и выбрать как именно очищать ссылку: очищать значение реквизита, удалять строку таблицы или удалять весь объект.
	//
	// Параметры:
	//   Исключения (Массив) из
	//       |- (ОбъектМетаданных) Объект метаданных или его реквизит, например:
	//              Массив.Добавить(Метаданные.РегистрыСведений.ВерсииОбъектов);
	//              Массив.Добавить(Метаданные.РегистрыСведений.ВерсииОбъектов.Реквизиты.АвторВерсии);
	//       |- (Строка) Полное имя объекта метаданных, например:
	//              Массив.Добавить("РегистрСведений.ВерсииОбъектов");
	//
	// Синтаксис:
	// Процедура ПриДобавленииИсключенийПоискаСсылок(Исключения) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.ПолучитьИсключенияПоискаСсылок).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииИсключенийПоискаСсылок");
	
	// Переопределяет текстовое описание предмета.
	//
	// Параметры:
	//  СсылкаНаПредмет – ЛюбаяСсылка – объект ссылочного типа.
	//  Представление   - Строка (возвращаемое значение) - произвольное текстовое описание.
	//
	// Синтаксис:
	// Процедура ПриОпределенииПредставленияПредмета(СсылкаНаПредмет, Представление) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.УстановитьПредставлениеПредмета).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииПредставленияПредмета");
	
	
	// Доопределяет переименования тех объектов метаданных, которые невозможно
	// автоматически найти по типу, но ссылки на которые требуется сохранять
	// в базе данных (например: подсистемы, роли).
	//
	// Подробнее см. комментарий к процедуре ОбщегоНазначения.ДобавитьПереименование().
	//
	// Синтаксис:
	// Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.ЗаполнитьТаблицуПереименованияОбъектовМетаданных).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПереименованийОбъектовМетаданных");
	
	// Доопределяет структуру параметров, необходимых для работы клиентского кода
	// при запуске конфигурации, т.е. в обработчиках событий
	// - ПередНачаломРаботыСистемы,
	// - ПриНачалеРаботыСистемы.
	//
	// Важно: при запуске недопустимо использовать команды сброса кэша
	// повторно используемых модулей, иначе запуск может привести
	// к непредсказуемым ошибкам или лишним серверным вызовам.
	//
	// Параметры:
	//   Параметры - Структура, в которую можно вставить параметры работы клиента при запуске.
	//                 Ключ     - имя параметра,
	//                 Значение - значение параметра.
	//
	// Пример использования:
	//   Параметры.Вставить(<ИмяПараметра>, <Код получения значения параметра>);
	//
	// Синтаксис:
	// Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.ПараметрыРаботыКлиентаПриЗапуске).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентаПриЗапуске");
	
	// Доопределяет структуру параметров, необходимых для работы клиентского кода
	// конфигурации.
	//
	// Параметры:
	//   Параметры - Структура, в которую можно вставить параметры работы клиента при запуске.
	//                 Ключ     - имя параметра,
	//                 Значение - значение параметра.
	//
	// Пример использования:
	//   Параметры.Вставить(<ИмяПараметра>, <Код получения значения параметра>);
	//
	// Синтаксис:
	// Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.ПараметрыРаботыКлиента).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиента");
	
	// Доопределяет структуру параметров, необходимых для работы клиентского кода
	// конфигурации при завершении, т.е. в обработчиках:
	// - ПередЗавершениемРаботыСистемы,
	// - ПриЗавершенииРаботыСистемы.
	//
	// Параметры:
	//   Параметры - Структура, в которую можно вставить параметры работы клиента при запуске.
	//                 Ключ     - имя параметра,
	//                 Значение - значение параметра.
	//
	// Пример использования:
	//   Параметры.Вставить(<ИмяПараметра>, <Код получения значения параметра>);
	//
	// Синтаксис:
	// Процедура ПриДобавленииПараметровРаботыКлиентаПриЗавершении(Параметры) Экспорт
	//
	// (То же, что ОбщегоНазначенияПереопределяемый.ПараметрыРаботыКлиентаПриЗавершении).
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентаПриЗавершении");
	
	// Вызывается при включении разделения данных по областям данных.
	//
	СерверныеСобытия.Добавить(
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриВключенииРазделенияПоОбластямДанных");
	
	// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
	//
	// Параметры:
	// см. описание обработчика события ПриОтправкеДанныхПодчиненному() в синтаксис-помощнике.
	//
	// Синтаксис:
	// Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза, Получатель) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриОтправкеДанныхПодчиненному");
	
	// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
	//
	// Параметры:
	// см. описание обработчика события ПриОтправкеДанныхГлавному() в синтаксис-помощнике.
	//
	// Синтаксис:
	// Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента, Получатель) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриОтправкеДанныхГлавному");
	
	// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
	//
	// Параметры:
	// см. описание обработчика события ПриПолученииДанныхОтПодчиненного() в синтаксис-помощнике.
	//
	// Синтаксис:
	// Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииДанныхОтПодчиненного");
	
	// Процедура является обработчиком одноименного события, возникающего при обмене данными в распределенной информационной базе.
	//
	// Параметры:
	// см. описание обработчика события ПриПолученииДанныхОтГлавного() в синтаксис-помощнике.
	// 
	// Синтаксис:
	// Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад, Отправитель) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииДанныхОтГлавного");
	
	// Процедура-обработчик события после получения данных в главном узле от подчиненного узла распределенной ИБ.
	// Вызывается в момент завершения чтения сообщения обмена, когда все данные из сообщения обмена успешно прочитаны и записаны в ИБ.
	// 
	//  Параметры:
	// Отправитель – ПланОбменаОбъект. Объект узла плана обмена, от которого получены данные.
	// Отказ – Булево. Флаг отказа. Если установить данному параметру значение Истина,
	// то сообщение будет считаться не принятым. Также произойдет отмена транзакции загрузки данных,
	// если все данные были загружены в одной транзакции или отмена последней транзакции загрузки данных,
	// если данные были загружены порциями.
	//
	// Синтаксис:
	// Процедура ПослеПолученияДанныхОтПодчиненного(Источник = Неопределено, ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПослеПолученияДанныхОтПодчиненного");
	
	// Процедура-обработчик события после получения данных в подчиненном узле от главного узла распределенной ИБ.
	// Вызывается в момент завершения чтения сообщения обмена, когда все данные из сообщения обмена успешно прочитаны и записаны в ИБ.
	// 
	//  Параметры:
	// Отправитель – ПланОбменаОбъект. Объект узла плана обмена, от которого получены данные.
	// Отказ – Булево. Флаг отказа. Если установить данному параметру значение Истина,
	// то сообщение будет считаться не принятым. Также произойдет отмена транзакции загрузки данных,
	// если все данные были загружены в одной транзакции или отмена последней транзакции загрузки данных,
	// если данные были загружены порциями.
	//
	// Синтаксис:
	// Процедура ПослеПолученияДанныхОтГлавного(Отправитель, Отказ) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПослеПолученияДанныхОтГлавного");
	
	// Процедура-обработчик события после отправки данных из подчиненного узла в главный узел распределенной ИБ.
	// Вызывается в момент завершения записи сообщения обмена, когда все зарегистрированные изменения данных успешно выгружены в сообщение обмена.
	// 
	//  Параметры:
	// Получатель – ПланОбменаОбъект. Объект узла плана обмена, для которого формируется сообщение обмена.
	// Отказ – Булево. Флаг отказа. Если установить данному параметру значение Истина,
	// то сообщение не будет считаться сформированным и отправленным.
	//
	// Синтаксис:
	// Процедура ПослеОтправкиДанныхГлавному(Получатель, Отказ) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПослеОтправкиДанныхГлавному");
	
	// Процедура-обработчик события после отправки данных из главного узла в подчиненный узел распределенной ИБ.
	// Вызывается в момент завершения записи сообщения обмена, когда все зарегистрированные изменения данных успешно выгружены в сообщение обмена.
	// 
	//  Параметры:
	// Получатель – ПланОбменаОбъект. Объект узла плана обмена, для которого формируется сообщение обмена.
	// Отказ – Булево. Флаг отказа. Если установить данному параметру значение Истина,
	// то сообщение не будет считаться сформированным и отправленным.
	//
	// Синтаксис:
	// Процедура ПослеОтправкиДанныхПодчиненному(Получатель, Отказ) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПослеОтправкиДанныхПодчиненному");
	
	// Заполняет структуру массивами поддерживаемых версий всех подлежащих версионированию подсистем,
	// используя в качестве ключей названия подсистем.
	// Обеспечивает функциональность Web-сервиса InterfaceVersion.
	// При внедрении надо поменять тело процедуры так, чтобы она возвращала актуальные наборы версий (см. пример.ниже).
	//
	// Параметры:
	// СтруктураПоддерживаемыхВерсий - Структура: 
	//  - Ключи = Названия подсистем. 
	//  - Значения = Массивы названий поддерживаемых версий.
	//
	// Пример реализации:
	//
	//  // СервисПередачиФайлов
	//  МассивВерсий = Новый Массив;
	//  МассивВерсий.Добавить("1.0.1.1");
	//  МассивВерсий.Добавить("1.0.2.1");
	//  СтруктураПоддерживаемыхВерсий.Вставить("СервисПередачиФайлов", МассивВерсий);
	//  // Конец СервисПередачиФайлов
	//
	// Синтаксис:
	// Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач СтруктураПоддерживаемыхВерсий) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов");
	
	// Заполняет структуру параметров, необходимых для работы клиентского кода
	// при завершении работы конфигурации, т.е. в обработчиках:
	// - ПередЗавершениемРаботыСистемы,
	// - ПриЗавершенииРаботыСистемы
	//
	// Параметры:
	//   Параметры   - Структура - структура параметров.
	//
	// Синтаксис:
	// Процедура ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистемПриЗавершении(Параметры) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистемПриЗавершении");
	
	// Заполняет структуру параметров, необходимых для работы клиентского кода
	// при запуске конфигурации, т.е. в обработчиках событий
	// - ПередНачаломРаботыСистемы,
	// - ПриНачалеРаботыСистемы
	//
	// Важно: при запуске недопустимо использовать команды сброса кэша
	// повторно используемых модулей, иначе запуск может привести
	// к непредсказуемым ошибкам и лишним серверным вызовам
	//
	// Параметры:
	//   Параметры   - Структура - структура параметров.
	//
	// Возвращаемое значение:
	//   Булево   - Ложь, если дальнейшее заполнение параметров необходимо прервать.
	//
	// Синтаксис:
	// Процедура ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистемПриЗапуске(Параметры) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистемПриЗапуске");
	
	// Заполняет структуру параметров, необходимых для работы клиентского кода
	// конфигурации.
	//
	// Параметры:
	//   Параметры   - Структура - структура параметров.
	//
	// Синтаксис:
	// Процедура ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистем(Параметры) Экспорт
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистем");
	
	// Используется для получения объектов метаданных обязательных для плана обмена.
	// Если подсистема имеет объекты метаданных обязательные для включения в состав плана обмена,
	// то в параметр <Объект> необходимо добавить эти объекты метаданных.
	//
	// Параметры:
	// Объекты – Массив. Массив объектов метаданных конфигурации, которые необходимо включить в состав плана обмена.
	// РаспределеннаяИнформационнаяБаза (только чтение) – Булево. Признак получения объектов для плана обмена РИБ.
	// Истина – требуется получить список объектов плана обмена РИБ;
	// Ложь – требуется получить список для плана обмена НЕ РИБ.
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбязательныхОбъектовПланаОбмена");
	
	// Используется для получения объектов метаданных, которые не следует включать в состав плана обмена.
	// Если подсистема имеет объекты метаданных, которые не следует включать в состав плана обмена,
	// то в параметр <Объект> необходимо добавить эти объекты метаданных.
	//
	// Параметры:
	// Объекты – Массив. Массив объектов метаданных конфигурации, которые не следует включать в состав плана обмена.
	// РаспределеннаяИнформационнаяБаза (только чтение) – Булево. Признак получения объектов для плана обмена РИБ.
	// Истина – требуется получить список объектов-исключений плана обмена РИБ;
	// Ложь – требуется получить список для плана обмена НЕ РИБ.
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбъектовИсключенийПланаОбмена");
	
	// Используется для получения объектов метаданных, которые должны входить в состав плана обмена
	// и НЕ должны входить в состав подписок на события регистрации изменений для этого плана обмена.
	// Эти объекты метаданных используются только в момент создания начального образа подчиненного узла
	// и не мигрируют в процессе обмена.
	// Если подсистема имеет объекты метаданных, которые участвуют только в создании начального образа подчиненного узла,
	// то в параметр <Объект> необходимо добавить эти объекты метаданных.
	//
	// Параметры:
	// Объекты – Массив. Массив объектов метаданных конфигурации.
	//
	СерверныеСобытия.Добавить("СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбъектовНачальногоОбразаПланаОбмена");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Добавление обработчиков событий

// Доопределяет обработчики подсистемы БазоваяФункциональность.
Процедура ПриДобавленииОбработчиковСлужебныхСобытийБазовойФункциональности(КлиентскиеОбработчики, СерверныеОбработчики) Экспорт
	
	// СЕРВЕРНЫЕ ОБРАБОТЧИКИ.
	
	СерверныеОбработчики[
		"СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПараметровРаботыКлиентскойЛогикиСтандартныхПодсистем"].Добавить(
		"СтандартныеПодсистемыСервер");
	
	СерверныеОбработчики["СтандартныеПодсистемы.ОбновлениеВерсииИБ\ПриДобавленииОбработчиковОбновления"].Добавить(
		"СтандартныеПодсистемыСервер");
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаВМоделиСервиса") Тогда
		СерверныеОбработчики[
			"СтандартныеПодсистемы.РаботаВМоделиСервиса.ВыгрузкаЗагрузкаДанных\ПриОпределенииОбъектовМетаданныхИсключаемыхИзВыгрузкиЗагрузки"].Добавить(
				"СтандартныеПодсистемыСервер");
	КонецЕсли;
	
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбязательныхОбъектовПланаОбмена"].Добавить(
		"СтандартныеПодсистемыСервер");
	
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбъектовИсключенийПланаОбмена"].Добавить(
		"СтандартныеПодсистемыСервер");
	
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриПолученииОбъектовНачальногоОбразаПланаОбмена"].Добавить(
		"СтандартныеПодсистемыСервер");
	
	СерверныеОбработчики["СтандартныеПодсистемы.БазоваяФункциональность\ПриДобавленииПереименованийОбъектовМетаданных"].Добавить(
		"СтандартныеПодсистемыСервер");
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Для функции ОбработчикиСобытий

Процедура ПроверкаУникальностиИменСобытий(События)
	
	ВсеСобытия    = Новый Соответствие;
	
	Для каждого Событие Из События Цикл
		
		Если ВсеСобытия.Получить(Событие) = Неопределено Тогда
			ВсеСобытия.Вставить(Событие, Истина);
		Иначе
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при подготовке списка событий.
				           |
				           |Событие ""%1""
				           |уже добавлено.'"),
				Событие);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ШаблонОбработчиковСобытий(События, ОбязательныеСобытия)
	
	ОбработчикиСобытий  = Новый Соответствие;
	
	Для каждого Событие Из События Цикл
		
		Если ТипЗнч(Событие) = Тип("Строка") Тогда // Имя события в виде строки.
			ОбработчикиСобытий.Вставить(Событие, Новый Массив);
			
		Иначе// Описание события в виде структуры - см. ОбщегоНазначения.НовоеСобытие().
			ОбработчикиСобытий.Вставить(Событие.Имя, Новый Массив);
			Если Событие.Обязательное Тогда
				Если ОбязательныеСобытия.Получить(Событие.Имя) = Неопределено Тогда
					ОбязательныеСобытия.Вставить(Событие.Имя, Истина);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ОбработчикиСобытий;
	
КонецФункции

Процедура ДобавитьОбязательныеСобытияБезОбработчиков(ОбязательныеСобытияБезОбработчиков,
                                                     ОбязательныеСобытия,
                                                     ОбработчикиСобытийПоПодсистемам)
	
	Для каждого ОбязательноеСобытие Из ОбязательныеСобытия Цикл
		
		ОбработчикНайден = Ложь;
		Для каждого ОбработчикиСобытийПодсистемы Из ОбработчикиСобытийПоПодсистемам Цикл
			
			Если ОбработчикиСобытийПодсистемы.Значение.Получить(ОбязательноеСобытие.Ключ).Количество() <> 0 Тогда
				ОбработчикНайден = Истина;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если Не ОбработчикНайден Тогда
			ОбязательныеСобытияБезОбработчиков.Добавить(ОбязательноеСобытие.Ключ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СтандартноеОписаниеОбработчиковСобытий(ОписанияПодсистем, ОбработчикиСобытийПоПодсистемам)
	
	ОбработчикиСобытий  = Новый Соответствие;
	МодулиОбработчиков  = Новый Соответствие;
	СобытияОбработчиков = Новый Соответствие;
	
	Для каждого Подсистема Из ОписанияПодсистем.Порядок Цикл
		ОбработчикиСобытийПодсистемы = ОбработчикиСобытийПоПодсистемам[Подсистема];
		
		Для каждого КлючИЗначение Из ОбработчикиСобытийПодсистемы Цикл
			Событие              = КлючИЗначение.Ключ;
			ОписанияОбработчиков = КлючИЗначение.Значение;
			
			Обработчики = ОбработчикиСобытий[Событие];
			Если Обработчики = Неопределено Тогда
				Обработчики = Новый Массив;
				ОбработчикиСобытий.Вставить(Событие, Обработчики);
				МодулиОбработчиков.Вставить(Событие, Новый Соответствие);
			КонецЕсли;
			
			Для каждого ОписаниеОбработчика Из ОписанияОбработчиков Цикл
				Если ТипЗнч(ОписаниеОбработчика) = Тип("Структура") Тогда
					Обработчик = ОписаниеОбработчика;
				Иначе
					Обработчик = Новый Структура;
					Обработчик.Вставить("Модуль", ОписаниеОбработчика);
				КонецЕсли;
				Если НЕ Обработчик.Свойство("Версия") Тогда
					Обработчик.Вставить("Версия", "");
				КонецЕсли;
				Обработчик.Вставить("Подсистема", Подсистема);
				
				// Проверка полного имени модуля процедуры обработчика события.
				Если ТипЗнч(Обработчик.Модуль) <> Тип("Строка")
				 ИЛИ НЕ ЗначениеЗаполнено(Обработчик.Модуль) Тогда
					
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при подготовке обработчиков события
						           |""%1"".
						           |
						           |Ошибка в имени модуля ""%2"".'"),
						Событие,
						Обработчик.Модуль);
				КонецЕсли;
				
				// Проверка, что один и тот же модуль указан для события только раз.
				Если МодулиОбработчиков[Событие].Получить(Обработчик.Модуль) = Неопределено Тогда
					МодулиОбработчиков[Событие].Вставить(Обработчик.Модуль, Истина);
				Иначе
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при подготовке обработчиков события
						           |""%1"".
						           |
						           |Модуль ""%2"" уже добавлен.'"),
						Событие,
						Обработчик.Модуль);
				КонецЕсли;
				Обработчики.Добавить(Новый ФиксированнаяСтруктура(Обработчик));
				
				// Проверка, что один и тот же обработчик указан для событий только один раз.
				ИмяПроцедуры = Сред(Событие, Найти(Событие, "\") + 1);
				ИмяОбработчика = Обработчик.Модуль + "." + ИмяПроцедуры;
				
				Если СобытияОбработчиков[ИмяОбработчика] = Неопределено Тогда
					СобытияОбработчиков.Вставить(ИмяОбработчика, Событие);
				Иначе
					ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru = 'Ошибка при подготовке обработчиков события
						           |""%1"".
						           |
						           |Обработчик ""%2"" уже добавлен для события
						           |""%3"".'"),
						Событие,
						ИмяОбработчика,
						СобытияОбработчиков[ИмяОбработчика]);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	// Фиксация массивов обработчиков.
	Для каждого КлючИЗначение Из ОбработчикиСобытий Цикл
		ОбработчикиСобытий[КлючИЗначение.Ключ] = Новый ФиксированныйМассив(КлючИЗначение.Значение);
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(ОбработчикиСобытий);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Для функции ОбновитьПараметрыРаботыПрограммы

Процедура ПроверитьОбновитьПараметрыРаботыПрограммы(ЕстьИзменения, ТолькоПроверка, БезИзменений = Неопределено)
	
	Если ТипЗнч(БезИзменений) <> Тип("Структура") Тогда
		БезИзменений = Новый Структура;
	КонецЕсли;
	
	// СтандартныеПодсистемы.БазоваяФункциональность
	Если НЕ БезИзменений.Свойство("БазоваяФункциональностьСлужебныеСобытия") Тогда
		ЕстьТекущиеИзменения = Ложь;
		Константы.ПараметрыСлужебныхСобытий.СоздатьМенеджерЗначения().Обновить(ЕстьТекущиеИзменения, ТолькоПроверка);
		Если ЕстьТекущиеИзменения Тогда
			ЕстьИзменения = Истина;
		Иначе
			БезИзменений.Вставить("БазоваяФункциональностьСлужебныеСобытия");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ СтандартныеПодсистемыПовтИсп.ОтключитьСправочникИдентификаторыОбъектовМетаданных() Тогда
		Если ТолькоПроверка И НЕ ЕстьИзменения Тогда
			// Проверка только критичных изменений: добавление, удаление или переименование объектов метаданных.
			Справочники.ИдентификаторыОбъектовМетаданных.ВыполнитьОбновлениеДанных(, ЕстьИзменения, ТолькоПроверка, ЕстьИзменения, ЕстьИзменения);
		ИначеЕсли НЕ ТолькоПроверка Тогда
			Справочники.ИдентификаторыОбъектовМетаданных.ВыполнитьОбновлениеДанных(ЕстьИзменения);
		КонецЕсли;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.БазоваяФункциональность
	
	// СтандартныеПодсистемы.Пользователи
	Если НЕ БезИзменений.Свойство("ПользователиПараметрыРаботы")
	   И НЕ (ТолькоПроверка И ЕстьИзменения) Тогда
		
		ЕстьТекущиеИзменения = Ложь;
		ПользователиСлужебный.ОбновитьПараметрыРаботыПользователей(ЕстьТекущиеИзменения, ТолькоПроверка);
		Если ЕстьТекущиеИзменения Тогда
			ЕстьИзменения = Истина;
		Иначе
			БезИзменений.Вставить("ПользователиПараметрыРаботы");
		КонецЕсли;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Пользователи
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступомСлужебный = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("УправлениеДоступомСлужебный");
		
		Если НЕ БезИзменений.Свойство("УправлениеДоступомПараметрыОграниченияДоступа")
		   И НЕ (ТолькоПроверка И ЕстьИзменения) Тогда
			
			ЕстьТекущиеИзменения = Ложь;
			МодульУправлениеДоступомСлужебный.ОбновитьПараметрыОграниченияДоступа(ЕстьТекущиеИзменения, ТолькоПроверка);
			Если ЕстьТекущиеИзменения Тогда
				ЕстьИзменения = Истина;
			Иначе
				БезИзменений.Вставить("УправлениеДоступомПараметрыОграниченияДоступа");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры
