////////////////////////////////////////////////////////////////////////////////
// Подсистема "Регламентные задания".
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Запускает новый сеанс, выполняющий регламентные задания.
//  Только для тонкого и обычного клиентов (Web не поддерживается).
//
// Возвращаемое значение:
//  Структура
//    Отказ             - Булево.
//    ОписаниеОшибки    - Строка.
// 
Функция ЗапуститьОтдельныйСеансДляВыполненияРегламентныхЗаданий() Экспорт
	
	Параметры = РегламентныеЗаданияСлужебныйВызовСервера
		.ПараметрыЗапускаОтдельногоСеансаВыполненияРегламентныхЗаданий(Ложь);
	
	Если НЕ Параметры.Отказ И Параметры.ТребуетсяОткрытьОтдельныйСеанс Тогда
		РегламентныеЗаданияСлужебныйКлиент.
			ПопыткаЗапуститьОтдельныйСеансДляВыполненияРегламентныхЗаданий(Параметры);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции
