
Процедура ПроверитьВозможностьВключенияОбъектаВСогласование(Задание) Экспорт
		
	Если ТипЗнч(Задание) = Тип("ДокументСсылка.Задание_ат") Тогда
		
		Заявки = Планирование_Сервер_ат.ПолучитьРодительскиеЗаявки(Задание);
		
		Для Каждого Заявка Из Заявки Цикл
		
			Согласование = Согласование_ат.ПолучитьОткрытоеСогласование(Заявка);
			
			Если НЕ Согласование = Неопределено Тогда
				
				Ответ = Вопрос("По заявке имеется Согласование в подготовке.
					|Включить Задание в состав согласования?", РежимДиалогаВопрос.ДаНет, 30);
				
				Если Ответ = КодВозвратаДиалога.Да Тогда
					
					Согласование_ат.ДобавитьОбъектСогласованияВСогласование(Задание, Заявка, Согласование);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыбратьЗадание(Ссылка, СвязанныеЗаявки, ВидДокументаСтрокой, Элемент) Экспорт
	
	ДоступныеЗадания = Согласование_ат.ПолучитьДоступныеЗадания(СвязанныеЗаявки, ВидДокументаСтрокой);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("ДоступныеЗадания",		ДоступныеЗадания);
	ПараметрыОткрытияФормы.Вставить("РежимВыбора",			Истина);
	ПараметрыОткрытияФормы.Вставить("МножественныйВыбор",	Истина);
	
	ОткрытьФорму("Документ.Задание_ат.ФормаСписка", ПараметрыОткрытияФормы, Элемент);
	
КонецПроцедуры
