
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С
		ИЛИ ТипПродукта = Перечисления.ТипыПродуктов_ат.Платформа1С
		ИЛИ ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С
		ИЛИ ТипПродукта = Перечисления.ТипыПродуктов_ат.ПрочийППMS Тогда
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Количество"));
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Если ПустаяСтрока(НаименованиеУПоставщика)
		ИЛИ (ТипПродукта <> Перечисления.ТипыПродуктов_ат.Платформа1С
			И ТипПродукта <> Перечисления.ТипыПродуктов_ат.Сервер1С
			И ТипПродукта <> Перечисления.ТипыПродуктов_ат.Конфигурация1С) Тогда
		
		ПроверятьОбновления = Ложь;
		
	КонецЕсли;

	Если ТипПродукта = Перечисления.ТипыПродуктов_ат.Платформа1С
		ИЛИ ТипПродукта = Перечисления.ТипыПродуктов_ат.Конфигурация1С Тогда
		
		Количество = 0;
		
	ИначеЕсли ТипПродукта = Перечисления.ТипыПродуктов_ат.Сервер1С
		ИЛИ ТипПродукта = Перечисления.ТипыПродуктов_ат.СерверMSWindows
		ИЛИ ТипПродукта = Перечисления.ТипыПродуктов_ат.УдаленныйДоступMSServer Тогда	
		
		Количество = 1;	
		
	КонецЕсли;
	
КонецПроцедуры
