
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыОткрытия = Новый Структура("Документы", ПараметрКоманды);
	
	ОткрытьФорму("РегистрСведений.ИсторияСтатусовОтправкиФинДокументов_ат.Форма.ФормаГрупповогоИзмененияСтатусовКорреспонденции",
		ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
