
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ДобавитьЗапись(ПолученныеДанные, Идентификатор = Неопределено, ДатаВремя = Неопределено) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.РегистрацияОшибок_ат.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИдентификаторОшибки = ?(Идентификатор = Неопределено, Новый УникальныйИдентификатор, Идентификатор);
	МенеджерЗаписи.ДатаВремяПолучения = ?(ДатаВремя = Неопределено, ТекущаяДатаСеанса(), ДатаВремя);
	МенеджерЗаписи.ПолученныеДанные = ПолученныеДанные;
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
