
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.АрендаПП_ат.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаПоставокДляАренды Из ТаблицаПоставокДляАренды Цикл
		Движение = Движения.АрендаПП_ат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ПоставкаПродукта = ТекСтрокаТаблицаПоставокДляАренды.Поставка;
		Движение.Организация = Организация;
		Движение.Ресурс = ТекСтрокаТаблицаПоставокДляАренды.Поставка.Продукт.Количество;
	КонецЦикла;
	
КонецПроцедуры
