////////////////////////////////////////////////////////////////////////////////
// Подсистема "Варианты отчетов" (клиент, сервер)
// 
// Выполняется на клиенте и на сервере.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Представление наименования данной подсистемы, используется
//   для записи в журнале регистрации и в других местах.
//
Функция НаименованиеПодсистемы(КодЯзыка) Экспорт
	Возврат НСтр("ru = 'Варианты отчетов'", ?(КодЯзыка = Неопределено, ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка(), КодЯзыка));
КонецФункции

// Представление группы важности.
//
Функция ПредставлениеСмТакже() Экспорт
	Возврат НСтр("ru = 'См. также'");
КонецФункции 

// Представление группы важности.
//
Функция ПредставлениеВажный() Экспорт
	Возврат НСтр("ru = 'Важный'");
КонецФункции

// Имя события оповещения для изменения варианта отчета.
//
Функция ИмяСобытияИзменениеВарианта() Экспорт
	Возврат "СтандартныеПодсистемы.ВариантыОтчетов.ИзменениеВарианта";
КонецФункции

