
#Область ОбработчикиСтандартныхСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Строка(Данные.Наименование) +
		?(ЗначениеЗаполнено(Данные.Описание), " - " + Данные.Описание, "");
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Описание");
	
КонецПроцедуры

#КонецОбласти
