
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Свойства = ДатыЗапретаИзмененияПовтИсп.СвойстваРазделов();
	
	// Установка варианта отчета.
	Если Параметры.ПоРазделамОбъектам = Истина Тогда
		
		Если Свойства.ПоказыватьРазделы И НЕ Свойства.ВсеРазделыБезОбъектов Тогда
			УстановитьТекущийВариант("ДатыЗапретаЗагрузкиПоРазделамОбъектамДляПользователей");
			
		ИначеЕсли Свойства.ВсеРазделыБезОбъектов Тогда
			УстановитьТекущийВариант("ДатыЗапретаЗагрузкиПоРазделамДляПользователей");
		Иначе
			УстановитьТекущийВариант("ДатыЗапретаЗагрузкиПоОбъектамДляПользователей");
		КонецЕсли;
	Иначе
		Если Свойства.ПоказыватьРазделы И НЕ Свойства.ВсеРазделыБезОбъектов Тогда
			УстановитьТекущийВариант("ДатыЗапретаЗагрузкиПоПользователям");
			
		ИначеЕсли Свойства.ВсеРазделыБезОбъектов Тогда
			УстановитьТекущийВариант("ДатыЗапретаЗагрузкиПоПользователямБезОбъектов");
		Иначе
			УстановитьТекущийВариант("ДатыЗапретаЗагрузкиПоПользователямБезРазделов");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

