
#Область ПрограммныйИнтерфейс

Процедура ИзменитьОтборПоКлиентуДляОтбора(Список, ИмяРеквизита = "Клиент", Знач ЗначениеОтбора = Неопределено) Экспорт

	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(Список.КомпоновщикНастроек.Настройки.Отбор, ИмяРеквизита);
	
	Если ЗначениеЗаполнено(ЗначениеОтбора) Тогда
		
		Если ТипЗнч(ЗначениеОтбора) <> Тип("СправочникСсылка.Контрагенты_ат")
			И ТипЗнч(ЗначениеОтбора) <> Тип("Массив")
			И ТипЗнч(ЗначениеОтбора) <> Тип("СписокЗначений") Тогда
			
			ЗначениеОтбора = ПредопределенноеЗначение("Справочник.Контрагенты_ат.ПустаяСсылка");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеОтбора) = Тип("Массив")
		ИЛИ ТипЗнч(ЗначениеОтбора) = Тип("СписокЗначений") Тогда
		
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
		
	Иначе
		
		ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
	
	ИспользованиеОтбора = ЗначениеЗаполнено(ЗначениеОтбора);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, ИмяРеквизита, ЗначениеОтбора, ВидСравненияОтбора, , ИспользованиеОтбора, 
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры

#КонецОбласти
