
&НаСервере
Процедура ДобавитьНаСервере()
	
	//
	//ДиапазонIP = new массив;	
	//
	//Если Диапазон = Истина тогда
	//	Если E >= A тогда
	//		Для IPa=A По E Цикл
	//			Если B >= F Тогда
	//				Для IPb=B По F Цикл
	//					
	//					
	//				КонецЦикла;
	//				
	//			КонецЕсли;
	//			Для IPb=B По F Цикл
	//				
	//			КонецЦикла;
	//		КонецЦикла	
	//	Иначе
	//	КонецЕсли;
		
	//КонецЕсли;

	//	
	//	
	//ДиапазонIP.Добавить(
	//ЗаписьВРегистрIP = РегистрыСведений.АдресаIPиПорты_ат.СоздатьНаборЗаписей();
	//НаборЗаписей = ЗаписьВРегистрIP.Отбор.Добавить
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ДобавитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДиапазонПриИзменении(Элемент)
	
	Если Диапазон = Истина тогда 
		ЭтаФорма.Элементы.Группа2.Видимость = истина;
	Иначе
		ЭтаФорма.Элементы.Группа2.Видимость = ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Диапазон = ложь тогда
		ЭтаФорма.Элементы.Группа2.Видимость = ложь;
	Иначе
		ЭтаФорма.Элементы.Группа2.Видимость = истина;
    КонецЕсли;	
КонецПроцедуры
