
&НаКлиенте
Процедура ОписаниеТиповЗначенийОтбораПриИзменении(Элемент)
	
	СписокЗначенийОтбора.Очистить();
	Если ЗначениеЗаполнено(ОписаниеТиповЗначенийОтбора) Тогда
		
		СписокЗначенийОтбора.ТипЗначения = ОписаниеТиповЗначенийОтбора;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ТекущийОбъект.ЗначенияОтбора = Новый ХранилищеЗначения(СписокЗначенийОтбора);
	//ТекущийОбъект.ТипЗначенийОтбора = Новый(ОписаниеТиповЗначенийОтбора.Типы()[0]);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	СписокЗначенийОтбора = СправочникОбъект.ЗначенияОтбора.Получить();
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ТипЗнч(Объект.ТипЗначенийОтбора));
	ОписаниеТиповЗначенийОтбора = Новый ОписаниеТипов(МассивТипов);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ЗначенияОтбора = Новый ХранилищеЗначения(СписокЗначенийОтбора);
	ТекущийОбъект.ТипЗначенийОтбора = Новый(ОписаниеТиповЗначенийОтбора.Типы()[0]);
	
КонецПроцедуры
