
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Пользователь = Параметры.Пользователь;
	ПарольПользователяСервиса = Параметры.ПарольПользователяСервиса;
	СтараяПочта = Параметры.СтараяПочта;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЗапросНаСменуПочты()
	
	ПользователиСлужебный.ПриСозданииЗапросаНаСменуПочты(НоваяПочта, Пользователь, ПарольПользователяСервиса);
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьПочту(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = "";
	Если Не ЗначениеЗаполнено(СтараяПочта) Тогда
		ТекстВопроса = Нстр("ru = 'Адрес электронной почты пользователя сервиса изменен.
			|Владельцы и администраторы абонента больше не смогут изменять параметры пользователя.'") 
			+ Символы.ПС;
	КонецЕсли;
	ТекстВопроса = ТекстВопроса + Нстр("ru = 'Выполнить изменение адреса электронной почты?'");
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		СоздатьЗапросНаСменуПочты();
		Предупреждение(Нстр("ru = 'На указанный адрес отправлено письмо с запросом на подтверждение.
			|Почта будет изменена только после подтверждения запроса пользователем.'"));
		Закрыть();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


