
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Контрагенты_ат.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты_ат КАК Контрагенты_ат
		|ГДЕ
		|	Контрагенты_ат.Клиент";
	
	СписокКлиентов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент"));
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	МассивВыбранных = Новый Массив;
	Представление = "";
	
	Для Каждого Клиент Из СписокКлиентов Цикл
		Если Клиент.Пометка Тогда
			МассивВыбранных.Добавить(Клиент.Значение);
			Представление = Представление + Клиент + "; ";
		КонецЕсли;
	КонецЦикла;
	
	Если МассивВыбранных.Количество() > 0 Тогда 
		Представление = ?(МассивВыбранных.Количество() > 1, "Клиенты: " + Представление, "Клиент: " + Представление); 
		Представление = Лев(Представление, СтрДлина(Представление) - 2) + ".";
	КонецЕсли;
	
	Закрыть(Новый Структура("Клиенты, Представление", МассивВыбранных, Представление));
	
КонецПроцедуры
