////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация"
// 
////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЙ ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Разбирает представление контактной информации и возвращает строку XML со значениями полей
//
//  Параметры:
//      Текст        - строка XML
//      ОжидаемыйТип - ссылка на вид КИ или перечисление типа КИ для контроля типов
//
Функция ПарсингКонтактнойИнформацииXML(Знач Текст, Знач ОжидаемыйВид) Экспорт
	Возврат КонтактнаяИнформацияСлужебный.ПарсингКонтактнойИнформацииXML(Текст, ОжидаемыйВид);
КонецФункции

//  Возвращает значение перечисления тип вида контактной информации
//
//  Параметры:
//    ВидИнформации - перечисление типа, ссылка на справочник ВидыКонтактнойИнформации или объект
//                    с полем "Тип"
//
Функция ТипВидаКонтактнойИнформации(Знач ВидИнформации) Экспорт
	Возврат УправлениеКонтактнойИнформацией.ТипВидаКонтактнойИнформации(ВидИнформации);
КонецФункции

// Возвращает строку состава из значения контактной информации.
//
//  Параметры:
//      XMLДанные - строка XML данных контакной информации
//
// Если значение состава сложного типа, то возвращает Неопределено
//
Функция СтрокаСоставаКонтактнойИнформации(Знач XMLДанные) Экспорт;
	Возврат КонтактнаяИнформацияXML.СтрокаСоставаКонтактнойИнформации(XMLДанные);
КонецФункции

// Преобразует все входящие форматы контактной информации в XML
//
Функция ПривестиКонтактнуюИнформациюXML(Знач Данные) Экспорт
	Возврат КонтактнаяИнформацияXML.ПривестиКонтактнуюИнформациюXML(Данные);
КонецФункции

// Возвращает найденную ссылку или создает новую страну мира и возвращает ссылку на нее
//
Функция СтранаМираПоДаннымКлассификатора(Знач КодСтраны) Экспорт
	Возврат Справочники.СтраныМира.СсылкаПоДаннымКлассификатора(
		Новый Структура("Код", КодСтраны)
	);
КонецФункции

// Заполняет коллекцию ссылками на найденные или созданные страны мира
//
Процедура КоллекцияСтранМираПоДаннымКлассификатора(Коллекция) Экспорт
	Для Каждого КлючЗначение Из Коллекция Цикл
		Коллекция[КлючЗначение.Ключ] = Справочники.СтраныМира.СсылкаПоДаннымКлассификатора(
			Новый Структура("Код", КлючЗначение.Значение.Код)
		);
	КонецЦикла;
КонецПроцедуры

