
Функция   ПолучитьАдресХранилищаПодключений() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	АдресаВременныхХранилищ_ат.АдресВременногоХранилища
		|ИЗ
		|	РегистрСведений.АдресаВременныхХранилищ_ат КАК АдресаВременныхХранилищ_ат
		|ГДЕ
		|	АдресаВременныхХранилищ_ат.УникальныйИдентификаторПользователяИБ = &УникальныйИдентификатор");
	Запрос.УстановитьПараметр("УникальныйИдентификатор", ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если  Выборка.Следующий() Тогда 
		
		АдресВременногоХранилища = Выборка.АдресВременногоХранилища;
		
		Если ТипЗнч(ПолучитьИзВременногоХранилища(АдресВременногоХранилища)) = Тип("Структура") Тогда
			Возврат АдресВременногоХранилища;
		Иначе 
			Возврат ПодключениеКИБ_ат.СоздатьВременноеХранилище();
		КонецЕсли;
		
	Иначе
		
		Возврат ПодключениеКИБ_ат.СоздатьВременноеХранилище();
		
	КонецЕсли;
	
КонецФункции
