//Процедура ЗаписатьДанныеФайлаВСправочникХранимыхФайлов(ПрисоединенныйФайл, ДвоичныеДанные) Экспорт 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	ХранимыеФайлы_ат.Ссылка
//	               |ИЗ
//	               |	Справочник.ХранимыеФайлы_ат КАК ХранимыеФайлы_ат
//	               |ГДЕ
//	               |	ХранимыеФайлы_ат.ХранимыйФайл = &ПрисоединенныйФайлСсылка";
//	
//	Запрос.УстановитьПараметр("ПрисоединенныйФайлСсылка", ПрисоединенныйФайл);
//	ТаблицаХранимыхФайлов = Запрос.Выполнить().Выгрузить();
//	
//	Если ТаблицаХранимыхФайлов.Количество() <> 0 Тогда
//		СсылкаНаХранимыйФайл = ТаблицаХранимыхФайлов[0].Ссылка;
//		ОбъектХранимыйФаил = СсылкаНаХранимыйФайл.ПолучитьОбъект();
//	КонецЕсли;
//	ОбъектХранимыйФаил.ХранимыйФаил = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
//	ОбъектХранимыйФаил.Записать();
//	
//КонецПроцедуры
