////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РеквизитСправочника = Метаданные.Справочники.РассылкиОтчетов.Реквизиты.FTPПорт;
	ЗаполнитьЗначенияСвойств(Элементы.Порт, РеквизитСправочника, "Подсказка, МаксимальноеЗначение, МинимальноеЗначение");
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "Сервер, Каталог, Порт, Логин, Пароль, ПассивноеСоединение");
	Если ЭтаФорма.Сервер = "" Тогда
		ЭтаФорма.Сервер = "сервер";
	КонецЕсли;
	Если ЭтаФорма.Каталог = "" Тогда
		ЭтаФорма.Каталог = "/каталог/";
	КонецЕсли;
	ВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура СерверИКаталогПриИзменении(Элемент)
	ЗаполнитьЗначенияСвойств(ЭтаФорма, РассылкаОтчетовКлиентСервер.РазобратьFTPАдрес(СерверИКаталог), "Сервер, Каталог");
	ВидимостьДоступность(ЭтаФорма);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Заполнить(Команда)
	Если Сервер = "" Тогда
		ПолныйАдрес = НСтр("ru = 'ftp://логин:пароль@сервер:порт/каталог/'");
	Иначе
		Если Логин = "" Тогда
			ПолныйАдрес = "ftp://"+ Сервер +":"+ Формат(Порт, "ЧН=21; ЧГ=0") + Каталог;
		Иначе
			ПолныйАдрес = "ftp://"+ Логин +":"+ Пароль +"@"+ Сервер +":"+ Формат(Порт, "ЧН=0; ЧГ=0") + Каталог;
		КонецЕсли;
	КонецЕсли;
	
	Если ВвестиСтроку(ПолныйАдрес, НСтр("ru = 'Введите полный ftp адрес'")) Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, РассылкаОтчетовКлиентСервер.РазобратьFTPАдрес(ПолныйАдрес));
		ВидимостьДоступность(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ЗначениеВыбора = Новый Структура("Сервер, Каталог, Порт, Логин, Пароль, ПассивноеСоединение");
	ЗаполнитьЗначенияСвойств(ЗначениеВыбора, ЭтаФорма);
	ОповеститьОВыборе(ЗначениеВыбора);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьДоступность(ЭтаФорма, Изменения = "")
	Если Прав(ЭтаФорма.Каталог, 1) <> "/" Тогда
		ЭтаФорма.Каталог = ЭтаФорма.Каталог + "/";
	КонецЕсли;
	ЭтаФорма.СерверИКаталог = "ftp://"+ ЭтаФорма.Сервер + ЭтаФорма.Каталог;
КонецПроцедуры

