////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ИзменятьВТранзакции",    ИзменятьВТранзакции);
	Параметры.Свойство("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	Параметры.Свойство("НастройкаПорции",        НастройкаПорции);
	Параметры.Свойство("ПроцентОбъектовВПорции", ПроцентОбъектовВПорции);
	Параметры.Свойство("ЧислоОбъектовВПорции",   ЧислоОбъектовВПорции);
	Параметры.Свойство("ПрерыватьПриОшибке",     ПрерыватьПриОшибке);
	
	Если НЕ Параметры.УчитыватьИерархию Тогда
		Элементы.ОбрабатыватьГруппыРекурсивно.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИзменятьВТранзакцииПриИзменении(Элемент)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменятьПорциямиПриИзменении(Элемент)
	
	УстановитьЭлементыФормы();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатВыбора = Новый Структура;
	РезультатВыбора.Вставить("ИзменятьВТранзакции",    ИзменятьВТранзакции);
	РезультатВыбора.Вставить("ОбрабатыватьРекурсивно", ОбрабатыватьРекурсивно);
	РезультатВыбора.Вставить("НастройкаПорции",        НастройкаПорции);
	РезультатВыбора.Вставить("ПроцентОбъектовВПорции", ПроцентОбъектовВПорции);
	РезультатВыбора.Вставить("ЧислоОбъектовВПорции",   ЧислоОбъектовВПорции);
	РезультатВыбора.Вставить("ПрерыватьПриОшибке",     ИзменятьВТранзакции Или ПрерыватьПриОшибке);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьЭлементыФормы()
	
	Если ИзменятьВТранзакции Тогда
		Элементы.ГруппаПрерываниеПриОшибке.Доступность = Ложь;
	Иначе
		Элементы.ГруппаПрерываниеПриОшибке.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
