
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ОДЗ) Тогда
		
		ОжидаемаяДатаЗавершения = Параметры.ОДЗ;
		СвойстваЗаявки = Планирование_Сервер_ат.ПолучитьСвойстваЗаявки(Параметры.Заявка);
		
		Если СвойстваЗаявки.Свойство("ПлановаяДатаНачала") Тогда
			ПлановаяДатаНачала = СвойстваЗаявки.ПлановаяДатаНачала;
		КонецЕсли;
		
	Иначе
		
		ОжидаемаяДатаЗавершения = ТекущаяДатаСеанса();
		
	КонецЕсли;
	
	ПричинаПереноса = Планирование_Сервер_ат.ПолучитьПричинуПереносаОДЗ(Параметры.Заявка, Параметры.Задание);
	
	Если ПричинаПереноса.ДобавлятьКомментарий Тогда
		
		ТекущийЭлемент = Элементы.Комментарий;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Если НачалоДня(ПлановаяДатаНачала) >= КонецДня(ОжидаемаяДатаЗавершения) Тогда
		
		ПоказатьПредупреждение(, "Ожидаемая Дата Завершения должна быть больше плановой даты начала!", 5);
		Возврат;
		
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ОДЗ", ОжидаемаяДатаЗавершения);
	СтруктураРезультата.Вставить("Причина", ПричинаПереноса);
	СтруктураРезультата.Вставить("Комментарий", Комментарий);
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры
