
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетРесурсов_ат Приход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Для Каждого ТекСтрокаПоступившиеСХД Из ПоступившиеСХД Цикл
		Движение = Движения.УчетРесурсов_ат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сервер = ТекСтрокаПоступившиеСХД.ТипСХД.Ссылка;
		Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат;
		Движение.ЗначениеРесурса = ТекСтрокаПоступившиеСХД.ТипСХД.ОбщийОбъем;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
