
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаФорма.ОбъектКонфигурации = "Документ";
	ЭтаФорма.ИмяОбъекта = "Заявка_ат";
	ЭтаФорма.ПараметрСвязи = "РодительскаяЗаявка";
	ЭтаФорма.МаксимальнаяДлинаПути = 8;
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	
	ТранзитивноеЗамыкание();
	
КонецПроцедуры

&НаСервере
Процедура ТранзитивноеЗамыкание() //(ОбъектКонфигурации, ИмяОбъекта, ПараметрСвязи, МаксимальнаяДлинаПути) Экспорт

    Пролог = "ВЫБРАТЬ " + ПараметрСвязи + " НачалоДуги, Ссылка КонецДуги ПОМЕСТИТЬ ЗамыканияДлины1 ИЗ " + ОбъектКонфигурации + "." + ИмяОбъекта+"

            | ГДЕ " + ПараметрСвязи + " <> Значение(" + ОбъектКонфигурации + "." + ИмяОбъекта + ".ПустаяСсылка)

            | ОБЪЕДИНИТЬ ВЫБРАТЬ Ссылка, Ссылка ИЗ " + ОбъектКонфигурации + "." + ИмяОбъекта + ";";

    Рефрен = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПерваяДуга.НачалоДуги, ВтораяДуга.КонецДуги ПОМЕСТИТЬ ЗамыканияДлины#2 ИЗ ЗамыканияДлины#1 КАК ПерваяДуга

            | ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины#1 КАК ВтораяДуга ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги;

            | УНИЧТОЖИТЬ ЗамыканияДлины#1;";

    Эпилог = "ВЫБРАТЬ НачалоДуги Предок, КонецДуги Потомок ИЗ ЗамыканияДлины#2 ГДЕ НачалоДуги <> КонецДуги";

    Запрос = Новый Запрос(Пролог);

    МаксимальнаяДлинаЗамыканий = 1;

    Пока МаксимальнаяДлинаЗамыканий < МаксимальнаяДлинаПути Цикл

        Запрос.Текст = Запрос.Текст + СтрЗаменить(СтрЗаменить(Рефрен, "#1", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0")), "#2", Формат(2 * МаксимальнаяДлинаЗамыканий, "ЧГ=0"));

        МаксимальнаяДлинаЗамыканий = 2 * МаксимальнаяДлинаЗамыканий;

    КонецЦикла;

    Запрос.Текст = Запрос.Текст + СтрЗаменить(Эпилог, "#2", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0"));

	ТаблицаРезультатов.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры


&НаКлиенте
Процедура Отфильтровать(Команда)
	
	Отфильтровать_Сервер();
	
КонецПроцедуры

&НаСервере
Процедура Отфильтровать_Сервер()
	
	МаксимальнаяДлинаПути = 8;
	
    Пролог = "ВЫБРАТЬ " + ПараметрСвязи + " НачалоДуги, Ссылка КонецДуги ПОМЕСТИТЬ ЗамыканияДлины1 ИЗ " + ОбъектКонфигурации + "." + ИмяОбъекта + "

            | ГДЕ " + ПараметрСвязи + " <> Значение(" + ОбъектКонфигурации + "." + ИмяОбъекта + ".ПустаяСсылка)

            | ОБЪЕДИНИТЬ ВЫБРАТЬ Ссылка, Ссылка ИЗ " + ОбъектКонфигурации + "." + ИмяОбъекта + ";";

    Рефрен = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПерваяДуга.НачалоДуги, ВтораяДуга.КонецДуги ПОМЕСТИТЬ ЗамыканияДлины#2 ИЗ ЗамыканияДлины#1 КАК ПерваяДуга

            | ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗамыканияДлины#1 КАК ВтораяДуга ПО ПерваяДуга.КонецДуги = ВтораяДуга.НачалоДуги;

            | УНИЧТОЖИТЬ ЗамыканияДлины#1;";

	
    Эпилог = "ВЫБРАТЬ НачалоДуги Предок, КонецДуги Потомок ИЗ ЗамыканияДлины#2 ГДЕ НачалоДуги <> КонецДуги И (НачалоДуги = &Входящий ИЛИ КонецДуги = &Входящий)";

    Запрос = Новый Запрос(Пролог);

    МаксимальнаяДлинаЗамыканий = 1;

    Пока МаксимальнаяДлинаЗамыканий < МаксимальнаяДлинаПути Цикл

        Запрос.Текст = Запрос.Текст + СтрЗаменить(СтрЗаменить(Рефрен, "#1", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0")), "#2", Формат(2 * МаксимальнаяДлинаЗамыканий, "ЧГ=0"));

        МаксимальнаяДлинаЗамыканий = 2 * МаксимальнаяДлинаЗамыканий;

    КонецЦикла;

    Запрос.Текст = Запрос.Текст + СтрЗаменить(Эпилог, "#2", Формат(МаксимальнаяДлинаЗамыканий, "ЧГ=0"));

	Запрос.УстановитьПараметр("Входящий", ЭтаФорма.Входящий);
	
	ТаблицаОтобраных.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

