
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Клиент") Тогда
		
		МассивКлиентов = Новый Массив;
		МассивКлиентов.Добавить(Параметры.Отбор.Клиент);
		МассивКлиентов.Добавить(Справочники.Контрагенты_ат.ПустаяСсылка());
		
		Параметры.Отбор.Клиент = МассивКлиентов;
		
	КонецЕсли;
		
КонецПроцедуры

Процедура СгенерироватьНаименования(Объект) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяПроектаДляОтчетов) Тогда	
		
		Объект.ИмяПроектаДляОтчетов = Объект.ИмяПроекта;
		
	КонецЕсли;
	
	Объект.Наименование = Объект.ИмяПроекта + ?(ЗначениеЗаполнено(Объект.Родитель), " / " + Объект.Родитель.Наименование, "");
	Объект.НаименованиеДляОтчетов = Объект.ИмяПроектаДляОтчетов +
		?(ЗначениеЗаполнено(Объект.Родитель), " / " + Объект.Родитель.НаименованиеДляОтчетов, "");
	
КонецПроцедуры 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если РольДоступна("КлиентСотрудник_ат") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Представление = Данные.Ссылка.ИмяПроектаДляОтчетов;
		
	КонецЕсли;
	
КонецПроцедуры
