
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные.Значение = ложь тогда
		СтандартнаяОбработка = ложь;
		Сообщение = новый СообщениеПользователю;
		Сообщение.Текст = "На Этом Сервере нельзя создать контейнер! на нем не разрещена аренда!";
		//Сообщение.ПутьКДанным = "Элемент.ТекущиеДанные.Значение";
		//Сообщение.Поле =  "Элемент.ТекущиеДанные.Значение";
		Сообщение.Сообщить();
		
	Иначе
	КонецЕсли;
	
	
КонецПроцедуры

//&НаСервере
//Процедура СписокВыборНаСервере()
//	
//КонецПроцедуры
