#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Определяет конечные точки (подписчиков) для широковещательного канала
// типа "Публикация/Подписка".
//
// Параметры:
//  КаналСообщений – Строка. Идентификатор широковещательного канала сообщений.
//
// Возвращаемое значение:
//  Тип: Массив. Массив элементов конечных точек.
//  Массив содержит элементы типа ПланОбменаСсылка.ОбменСообщениями.
//
Функция ПодписчикиКаналаСообщений(Знач КаналСообщений) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПодпискиПолучателей.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.ПодпискиПолучателей КАК ПодпискиПолучателей
	|ГДЕ
	|	ПодпискиПолучателей.КаналСообщений = &КаналСообщений";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КаналСообщений", КаналСообщений);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
КонецФункции

#КонецЕсли