
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ВнутреннегоИспользования_КлиентСерверПовтИсп_ат.СотрудникОрганизации() Тогда
		
		Если НЕ ПустаяСтрока(Данные.НаименованиеВнутреннее) Тогда
			
			СтандартнаяОбработка = Ложь;
			
			Представление = Данные.НаименованиеВнутреннее;
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ Данные.ОтображениеКлиенту.Пустая() Тогда
			
			СтандартнаяОбработка = Ложь;
			
			Представление = Данные.ОтображениеКлиенту;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("НаименованиеВнутреннее");
	Поля.Добавить("ОтображениеКлиенту");
	
КонецПроцедуры

Функция   ПолучитьПредставлениеТипаЗаявки(ТипЗаявки, Внутреннее) Экспорт
	
	Представление = ТипЗаявки.Наименование;
	
	Если Внутреннее Тогда
		
		Если НЕ ПустаяСтрока(ТипЗаявки.НаименованиеВнутреннее) Тогда
			Представление = ТипЗаявки.НаименованиеВнутреннее;
		КонецЕсли;
		
	Иначе
		
		Если НЕ ТипЗаявки.ОтображениеКлиенту.Пустая() Тогда
			Представление = Строка(ТипЗаявки.ОтображениеКлиенту);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции