// Форма параметризуется:
//
//      Заголовок     (строка)  - заголовок формы
//      ЗначенияПолей (строка)  - сериализованное значение контактной информации или пустая строка для 
//                                ввода нового
//      Представление (строка)  - представление адреса (используется только при работе со старыми данными)
//      ВидКонтактнойИнформации - ссылка на справочник ВидыКонтактнойИнформации, описывающий то, что мы 
//                                редактируем или структура, совместимая по полям со справочником.
//      Комментарий (строка)    - необязательный комментарий, для подстановки в поле "Комментарий"
//
//      ВозвращатьСписокЗначений (булево) - необязательный флаг того, что возвращаемое значение поля 
//                               КонтактнаяИнформация будет иметь тип СписокЗначений (совместимость)
//
//  Результатом выбора является структура с полями:
//      "КонтактнаяИнформация, Представление, Комментарий, ВведеноВСвободнойФорме"
//
// -------------------------------------------------------------------------------------------------

////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.Свойство("ОткрытаПоСценарию") Тогда
		ВызватьИсключение НСтр("ru='Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	ЭтоПлатформа83 = ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83();
	
	Параметры.Свойство("ВозвращатьСписокЗначений", ВозвращатьСписокЗначений);
	
	// Внутренняя инициализация
	ЦветФонаУправляющегоПоля = ЦветаСтиля.ФонУправляющегоПоля;
	ЦветФонаФормы            = ЦветаСтиля.ЦветФонаФормы;
	ЦветКорректногоПоля      = Новый Цвет;   // (243, 255, 243);
	АвтоЦвет                 = Новый Цвет;
	
	СтранаРоссия = Справочники.СтраныМира.Россия;
	
	ВидКонтактнойИнформации = УправлениеКонтактнойИнформацией.СтруктураВидаКонтактнойИнформации();
	ЗаполнитьЗначенияСвойств(ВидКонтактнойИнформации, Параметры.ВидКонтактнойИнформации);
	
	// Заголовок
	Если ПустаяСтрока(Параметры.Заголовок) Тогда
		Если ТипЗнч(ВидКонтактнойИнформации)=Тип("СправочникСсылка.ВидыКонтактнойИнформации") Тогда
			Заголовок = Строка(ВидКонтактнойИнформации);
			// Иначе останется заголовок, заданный в форме
		КонецЕсли;
	Иначе
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	// Режимы
	ПроверятьКорректность       = ВидКонтактнойИнформации.ПроверятьКорректность;
	ЗапрещатьВводНекорректного  = ВидКонтактнойИнформации.ЗапрещатьВводНекорректного;
	МожноЗагружатьКлассификатор = КонтактнаяИнформацияСлужебный.ЕстьВозможностьИзмененияАдресногоКлассификатора();
	СкрыватьНеактуальныеАдреса  = ВидКонтактнойИнформации.СкрыватьНеактуальныеАдреса;
	
	АдресТолькоРоссийский       = ВидКонтактнойИнформации.АдресТолькоРоссийский;
	ТипКонтактнойИнформации     = ВидКонтактнойИнформации.Тип;
	
	// Возможные варианты дома, строения, квартиры
	УстановитьСписокВыбораЭлемента(Элементы.ТипДома,      Элементы.Дом,       КонтактнаяИнформацияСлужебный.ВариантыДанныхДом());
	УстановитьСписокВыбораЭлемента(Элементы.ТипСтроения,  Элементы.Строение,  КонтактнаяИнформацияСлужебный.ВариантыДанныхСтроение());
	УстановитьСписокВыбораЭлемента(Элементы.ТипПомещения, Элементы.Помещение, КонтактнаяИнформацияСлужебный.ВариантыДанныхПомещение());
	
	// Пытаемся заполнить из параметров
	Если КонтактнаяИнформацияКлиентСервер.ЭтоСтрокаXML(Параметры.ЗначенияПолей) 
		И ТипКонтактнойИнформации=Перечисления.ТипыКонтактнойИнформации.Адрес
	Тогда
		РезультатыЧтения = Новый Структура;
		XDTOКонтактная = КонтактнаяИнформацияСлужебный.ДесериализацияКонтактнойИнформации(Параметры.ЗначенияПолей, ТипКонтактнойИнформации, РезультатыЧтения);
		Если РезультатыЧтения.Свойство("ТекстОшибки") Тогда
			// Распознали с ошибками, сообщим при открытии
			ТекстПредупрежденияПриОткрытии = РезультатыЧтения.ТекстОшибки;
			XDTOКонтактная.Представление = Параметры.Представление;
			XDTOКонтактная.Состав.Страна = Строка(СтранаРоссия);
		КонецЕсли;
	Иначе
		XDTOКонтактная = КонтактнаяИнформацияСлужебный.ДесериализацияАдреса(Параметры.ЗначенияПолей, Параметры.Представление, );
	КонецЕсли;
	
	Если Параметры.Комментарий<>Неопределено Тогда
		// Ставим новый комментарий, иначе он придет из информации
		КонтактнаяИнформацияСлужебный.КомментарийКонтактнойИнформации(XDTOКонтактная, Параметры.Комментарий);
	КонецЕсли;
	
	ЗначениеРеквизитовПоКонтактнойИнформации(ЭтаФорма, XDTOКонтактная);
	Если ЗначениеЗаполнено(Страна) Тогда
		// Нашли в справочнике стран
		ИсходноеПредставлениеСтраны = "";
		
	ИначеЕсли ПустаяСтрока(КодСтраны) Тогда
		// Нашли в классификаторе, но не нашли в справочнике, возможно стоит завести?
		ИсходноеПредставлениеСтраны = СокрЛП(XDTOКонтактная.Состав.Страна);
		
	Иначе
		// Не нашли ни в классификаторе ни в справочнике
		ИсходноеПредставлениеСтраны = СокрЛП(XDTOКонтактная.Состав.Страна);
		
	КонецЕсли;
		
	ОтрисоватьДополнительныеЗданияИПомещения();
	
	// Возможно пустые значения, чтобы не смущали
	Если ПустаяСтрока(Дом) И ПустаяСтрока(ТипДома) Тогда
		ТипДома = КонтактнаяИнформацияКлиентСервер.ПервыйИлиПустой(Элементы.ТипДома);
	КонецЕсли;
	Если ПустаяСтрока(Строение) И ПустаяСтрока(ТипСтроения) Тогда
		ТипСтроения = КонтактнаяИнформацияКлиентСервер.ПервыйИлиПустой(Элементы.ТипСтроения);
	КонецЕсли;
	Если ПустаяСтрока(Помещение) И ПустаяСтрока(ТипПомещения) Тогда
		ТипПомещения = КонтактнаяИнформацияКлиентСервер.ПервыйИлиПустой(Элементы.ТипПомещения);
	КонецЕсли;
	
	// Проверяем на корректность
	Если АдресТолькоРоссийский Тогда
		Элементы.Страна.Доступность = Ложь;
		Элементы.Страна.ЦветФона = АвтоЦвет;
		Если Страна<>СтранаРоссия Тогда
			Если Не ПустаяСтрока(Параметры.ЗначенияПолей) Тогда
				// Считаем адрес российским, но введенным в свободной форме.
				ПредставлениеАдреса = СокрЛП(
					СокрЛП(Страна) + " " + СокрЛП(ПредставлениеАдреса) + " " + СокрЛП(ПредставлениеИностранногоАдреса)
				);
				РазрешитьВводАдресаВСвободнойФорме = Истина;
				ПредставлениеАдресаИзменено        = Истина;
			КонецЕсли;
			Страна = СтранаРоссия;
		КонецЕсли;
	КонецЕсли;
	
	// По умолчанию все русские
	Если Не ЗначениеЗаполнено(Страна) Тогда
		Если ПустаяСтрока(ИсходноеПредставлениеСтраны) Тогда
			Страна = СтранаРоссия;
		Иначе 
			// Не определили страну, но точно не Россия
			Если ПустаяСтрока(ТекстПредупрежденияПриОткрытии) Тогда
				ПолеПредупрежденияПриОткрытии = "Страна";
			КонецЕсли;
			ТекстПредупрежденияПриОткрытии = ТекстПредупрежденияПриОткрытии
				+ СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Страна ""%1"" не найдена в справочнике стран мира.'"), ИсходноеПредставлениеСтраны
				);
		КонецЕсли;
	КонецЕсли;
	
	// Инициализируем элементы
	Если Страна=СтранаРоссия Тогда
		Элементы.ТипАдреса.ТекущаяСтраница = Элементы.РоссийскийАдрес;
		ТекущийЭлемент = Элементы.НаселенныйПункт;
	Иначе
		Элементы.ТипАдреса.ТекущаяСтраница = Элементы.ИностранныйАдрес;
		ТекущийЭлемент = Элементы.ПредставлениеИностранногоАдреса;
	КонецЕсли;
	
	// Обход особености платформы 8.3
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		МожноЗагружатьКлассификатор = Ложь;
	Иначе
		КнопкаПанели = Элементы.Добавить("ФормаЗагрузитьКлассификатор", Тип("КнопкаФормы"));
		КнопкаПанели.ИмяКоманды = "ЗагрузитьКлассификатор";
		Элементы.Переместить(КнопкаПанели, Элементы.ФормаВсеДействия, Элементы.ФормаВводАдресаВСвободнойФорме); 
		Элементы.ФормаЗагрузитьКлассификатор.Видимость = МожноЗагружатьКлассификатор;
	КонецЕсли;
	
	УстановитьКлючИспользованияФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ДобавитьОбъект.Доступность = МожноДобавлятьДополнительныеОбъекты();
	
	ОбработкаИзмененияСтраныКлиент();
	СостояниеВводаПредставленияАдреса(РазрешитьВводАдресаВСвободнойФорме, Ложь);
	ВизуализироватьКорректностьВыбора();
	
	Если Не ПустаяСтрока(ТекстПредупрежденияПриОткрытии) Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПредупредитьПослеОткрытияФормы", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ЗапроситьПодтверждениеЗакрытияФормы(Отказ, 
		МодифицированностьПриВыборе(), ВыбраноДействиеВыбора() ); 
	
	Если Не Отказ Тогда
		УстановитьКлючИспользованияФормы();
		СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ
//

&НаКлиенте
Процедура СтранаПриИзменении(Элемент)
	ОбработкаИзмененияСтраныКлиент();
	
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
#Если ВебКлиент Тогда
	// Обход особенности платформы
	Элемент.ОбновитьТекстРедактирования();
#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СтранаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если Ожидание=0 Тогда
		// Формирование списка быстрого выбора
		Если ПустаяСтрока(Текст) Тогда
			ДанныеВыбора = Новый СписокЗначений;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
#Если ВебКлиент Тогда
	// Обход особенности платформы
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = Новый СписокЗначений;
	Возврат;
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СтранаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
#Если ВебКлиент Тогда
	// Обход особенности платформы
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора         = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Страна);
	Возврат;
#КонецЕсли

КонецПроцедуры

&НаКлиенте
Процедура СтранаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
#Если ВебКлиент Тогда
	// Обход особенности платформы
	Если ТипЗнч(ВыбранноеЗначение)<>Тип("СправочникСсылка.СтраныМира") Тогда
		СтандартнаяОбработка = Ложь;
		ВыбранноеЗначение    = Неопределено;
		Возврат;
	КонецЕсли;
#КонецЕсли
	
	УправлениеКонтактнойИнформациейКлиент.СтранаМираОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИндексПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
КонецПроцедуры

&НаКлиенте
Процедура ТипДомаПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ДомПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ОбновитьИндексИПредставление(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ТипСтроенияПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ОбновитьИндексИПредставление(Контекст);
	КонтекстФормыКлиент(Контекст);
КонецПроцедуры

&НаКлиенте
Процедура ТипПомещенияПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ОбработкаИзмененияНаселенногоПунктаСервер(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// Если пришли впрямую после редактирования, то сбрасываем адрес
	Если Элемент.ТекстРедактирования<>НаселенныйПункт Тогда
		КодКлассификатораНаселенногоПункта = 0;
		НаселенныйПункт                    = Элемент.ТекстРедактирования;
		
		НаселенныйПунктНайденТочно = Ложь;
		УлицаНайденаТочно          = Ложь;
		ДомНайденТочно             = Ложь;
		
		Контекст = КонтекстФормыКлиент();
		СформироватьДетальныйНаселенныйПункт(Контекст, НаселенныйПункт);
		КонтекстФормыКлиент(Контекст);
		
		Модифицированность = Истина;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ВводКонтактнойИнформации.Форма.НаселенныйПунктАдреса",
		Новый Структура("НаселенныйПунктДетально, СкрыватьНеактуальныеАдреса", 
			НаселенныйПунктДетально, СкрыватьНеактуальныеАдреса
		), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Перем МожноЗагружатьРегион;
	
	СтандартнаяОбработка = Ложь;
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	
	ТипЗначения = ТипЗнч(ВыбранноеЗначение);
	ФормироватьДетально = Истина;
	Если ТипЗначения=Тип("Структура") Тогда
		// Результат автоподбора или выбора кнопкой, берем все оттуда
		КодКлассификатораНаселенногоПункта = ВыбранноеЗначение.Код;
		НаселенныйПункт                    = ВыбранноеЗначение.Представление;
		НаселенныйПунктНайденТочно         = КодКлассификатораНаселенногоПункта>0;
		
		Если ВыбранноеЗначение.Свойство("НаселенныйПунктДетально") Тогда
			// Выбор из формы детального ввода
			НаселенныйПунктДетально = ВыбранноеЗначение.НаселенныйПунктДетально;
			ФормироватьДетально = Ложь;
		КонецЕсли;
		
		РегионНеЗагружен = ВыбранноеЗначение.Свойство("МожноЗагружатьРегион") И ВыбранноеЗначение.МожноЗагружатьРегион;
		Если МожноЗагружатьКлассификатор И РегионНеЗагружен Тогда
			// Предлагаем загрузить классификатор
			УправлениеКонтактнойИнформациейКлиент.ПредложениеЗагрузкиКлассификатора(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru='Данные для ""%1"" не загружены.'"), ВыбранноеЗначение.Представление));
		КонецЕсли;
		
	Иначе
		// Иной источник, будет попытка разобрать
		КодКлассификатораНаселенногоПункта = 0;
	 	НаселенныйПункт                    = Строка(ВыбранноеЗначение);
		
		НаселенныйПунктНайденТочно  = Ложь;
		УлицаНайденаТочно           = Ложь;
		ДомНайденТочно              = Ложь;
	КонецЕсли;
	
	// Если город был выбран точно, то по коду будет восстановлен детальный населенный пункт, иначе сохранится введенная 
	// детальная информация
	Контекст = КонтекстФормыКлиент();
	ОбработкаИзмененияНаселенногоПунктаСервер(Контекст, ФормироватьДетально);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если Ожидание=0 Тогда
		// Формирование списка быстрого выбора
		Если ПустаяСтрока(Текст) Тогда
			ДанныеВыбора = Новый СписокЗначений;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Элементы.НаселенныйПункт.ЦветФона = АвтоЦвет;
	
	СтандартнаяОбработка = Ложь;
	Если СтрДлина(Текст)<3 Тогда 
		ВизуализироватьКорректностьВыбора();
		Возврат;
	КонецЕсли;
	
#Если ВебКлиент Тогда
	ПредупреждатьОНеактуальных = Ложь;
#Иначе
	ПредупреждатьОНеактуальных = Истина;
#КонецЕсли
	
	АнализКлассификатора = РезультатыАвтоПодбораНаселенногоПункта(Текст, СкрыватьНеактуальныеАдреса, ПредупреждатьОНеактуальных);
	ДанныеВыбора = АнализКлассификатора.ДанныеВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура НаселенныйПунктОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	// Выход из поля с текстом, измененным руками
	СтандартнаяОбработка = Ложь;
	
	Модифицированность = Истина;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Текст);
	
	// Населенный пункт становится недостоверным
	КодКлассификатораНаселенногоПункта = 0;
	НаселенныйПунктНайденТочно         = Ложь;
	НаселенныйПункт                    = Текст;
	
	// Улица становится недостоверной
	КодКлассификатораУлицы = 0;
	УлицаНайденаТочно      = Ложь;
	
	// Дом становится недостоверным
	ДомНайденТочно = Ложь;
	
	Контекст = КонтекстФормыКлиент();
	ОбработкаИзмененияНаселенногоПунктаСервер(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура УлицаПриИзменении(Элемент)
	Контекст = КонтекстФормыКлиент();
	ОбработкаИзмененияУлицыСервер(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура УлицаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	// Если пришли впрямую после редактирования, то сбрасываем
	Если Элемент.ТекстРедактирования<>Улица Тогда
		Улица = Элемент.ТекстРедактирования;
	КонецЕсли;
	
	Если КодКлассификатораНаселенногоПункта>0 Тогда
		ПараметрыФормы = Новый Структура("СкрыватьНеактуальныеАдреса, КодКлассификатораНаселенногоПункта, Улица", 
			СкрыватьНеактуальныеАдреса, КодКлассификатораНаселенногоПункта, Улица);
	Иначе
		// Родитель улицы неопределен, открываем форму в которой ничего нет
		ПараметрыФормы = Новый Структура("СкрыватьНеактуальныеАдреса, КодКлассификатораНаселенногоПункта, Улица, Заголовок", 
			СкрыватьНеактуальныеАдреса, -1, Улица, НаселенныйПункт + " (не найден)");
	КонецЕсли;
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбораУлицы(Элемент, КодКлассификатораНаселенногоПункта, Улица, ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура УлицаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ВыбранноеЗначение=Неопределено Тогда
		Возврат;
	КонецЕсли;
	Модифицированность = Истина;
	
	ТипВыбора = ТипЗнч(ВыбранноеЗначение);
	Если ТипВыбора=Тип("Структура") Тогда
		// Результат автоподбора или выбора кнопкой, берем все оттуда
		КодКлассификатораУлицы = ВыбранноеЗначение.Код;
		Улица                  = ВыбранноеЗначение.Представление;
		УлицаНайденаТочно      = Истина;
	Иначе
		// Иной источник, будет попытка разобрать
		КодКлассификатораУлицы = 0;
	 	Улица                  = Строка(ВыбранноеЗначение);
		
		УлицаНайденаТочно = Ложь;
		ДомНайденТочно    = Ложь;
	КонецЕсли;
	
	Контекст = КонтекстФормыКлиент();
	ОбработкаИзмененияУлицыСервер(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
КонецПроцедуры

&НаКлиенте
Процедура УлицаАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	Если Ожидание=0 Тогда
		// Формирование списка быстрого выбора
		Если ПустаяСтрока(Текст) Тогда
			ДанныеВыбора = Новый СписокЗначений;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Элементы.Улица.ЦветФона = АвтоЦвет;
	
	СтандартнаяОбработка = Ложь;
	Если СтрДлина(Текст)<3 Или КодКлассификатораНаселенногоПункта<=0 Тогда 
		ВизуализироватьКорректностьВыбора();
		Возврат;
	КонецЕсли;
	
#Если ВебКлиент Тогда
	ПредупреждатьОНеактуальных = Ложь;
#Иначе
	ПредупреждатьОНеактуальных = Истина;
#КонецЕсли
	
	АнализКлассификатора = РезультатыАвтоПодбораУлицы(КодКлассификатораНаселенногоПункта, Текст, СкрыватьНеактуальныеАдреса, ПредупреждатьОНеактуальных);
	ДанныеВыбора = АнализКлассификатора.ДанныеВыбора;
КонецПроцедуры

&НаКлиенте
Процедура УлицаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	// Выход из поля с текстом, измененным руками
	Модифицированность = Истина;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Текст);
	Улица = Текст;
	
	// Улица становится непроверенной
	КодКлассификатораУлицы = 0;
	УлицаНайденаТочно = Ложь;
	
	// Дом становится непроверенным
	ДомНайденТочно = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеАдресаПриИзменении(Элемент)
	ПредставлениеАдресаИзменено = Истина;
	ПредставлениеАдресаПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ОткрытьФормуРедактированияКомментария(Элемент.ТекстРедактирования, Комментарий, Модифицированность);
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура КомандаОК(Команда)
	// При немодифицированности работает как "отмена"
	
	Если Модифицированность Тогда
		// Изменено значение адреса 
		
		Контекст = КонтекстФормыКлиент();
		Результат = РезультатВыбора(Контекст, ВозвращатьСписокЗначений);
		Если ПроверятьКорректность И (Не РазрешитьВводАдресаВСвободнойФорме) И Результат.ОшибкиЗаполнения.Количество()>0 Тогда
			СообщитьОбОшибкахЗаполнения(Результат.ОшибкиЗаполнения, Ложь);
			Если ЗапрещатьВводНекорректного Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		Результат = Результат.ДанныеВыбора;
		
		СброситьМодифицированностьПриВыборе();
#Если ВебКлиент Тогда
		ФлагЗакрытия = ЗакрыватьПриВыборе;
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(Результат);
		ЗакрыватьПриВыборе = ФлагЗакрытия;
#Иначе
		ОповеститьОВыборе(Результат);
#КонецЕсли
		
	ИначеЕсли Комментарий<>КопияКомментария Тогда
		// Изменен только комментарий, пробуем вернуть обновленное
		Результат = РезультатВыбораТолькоКомментария(Параметры.ЗначенияПолей, Параметры.Представление, Комментарий);
		Результат = Результат.ДанныеВыбора;
		
		СброситьМодифицированностьПриВыборе();
#Если ВебКлиент Тогда
		ФлагЗакрытия = ЗакрыватьПриВыборе;
		ЗакрыватьПриВыборе = Ложь;
		ОповеститьОВыборе(Результат);
		ЗакрыватьПриВыборе = ФлагЗакрытия;
#Иначе
		ОповеститьОВыборе(Результат);
#КонецЕсли
		
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Если (МодальныйРежим Или ЗакрыватьПриВыборе) И Открыта() Тогда
		СброситьМодифицированностьПриВыборе();
		Закрыть(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗаполнениеАдреса(Команда)
	
	Если РазрешитьВводАдресаВСвободнойФорме Тогда
		Предупреждение(НСтр("ru='Адрес не может быть проверен, так как он введен в свободной форме.'"));
		Возврат;
	КонецЕсли;

	Контекст = КонтекстФормыКлиент();
	СписокОшибок = СписокОшибокЗаполнения(Контекст);
	СообщитьОбОшибкахЗаполнения(СписокОшибок, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьАдрес(Команда)
	ОчиститьАдресКлиент();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКлассификатор(Команда)
	УправлениеКонтактнойИнформациейКлиент.ЗагрузитьАдресныйКлассификатор();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОбъект(Команда)
	Варианты = НеиспользованныеЭлементыДополнительнойТаблицы(ДополнительныеЗдания, Элементы.ТипСтроения, 1);
	Для Каждого ЭлементОбъект Из НеиспользованныеЭлементыДополнительнойТаблицы(ДополнительныеПомещения, Элементы.ТипПомещения, 2) Цикл
		ЗаполнитьЗначенияСвойств(Варианты.Добавить(), ЭлементОбъект);
	КонецЦикла;
	
	КоличествоВариантов = Варианты.Количество();
	Если КоличествоВариантов>0 Тогда
		Выбрано = ВыбратьИзМеню(Варианты);
	Иначе
		Выбрано = Неопределено;
	КонецЕсли;
	
	Если Выбрано<>Неопределено Тогда
		Если Выбрано.Значение=1 Тогда
			Строка = ДополнительныеЗдания.Добавить();
			
			Строка.Тип = Выбрано.Представление;
			Строка.ПутьXPath = КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(Строка.Тип);
			ИмяТекущего = ОтрисоватьДополнительныеЗдания();
		Иначе
			Строка = ДополнительныеПомещения.Добавить();
			
			Строка.Тип = Выбрано.Представление;
			Строка.ПутьXPath = КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(Строка.Тип);
			ИмяТекущего = ОтрисоватьДополнительныеПомещения();
		КонецЕсли;
		
		// Запрещаем добавлять больше чем есть вариантов
		Элементы.ДобавитьОбъект.Доступность = КоличествоВариантов>1;
		
		Если ИмяТекущего<>Неопределено Тогда
			ТекущийЭлемент = Элементы[ИмяТекущего];
		КонецЕсли;
		
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиАдресВСвободнойФорме(Команда)
	
	Если РазрешитьВводАдресаВСвободнойФорме Тогда
		ТекстВопроса = НСтр("ru='Изменения, введенные вручную, будут потеряны.
		                        |Продолжить?'");
	Иначе
		ТекстВопроса = НСтр("ru='Ввести адрес в свободной форме?
		                        |Адреса, введенные в свободной форме, могут не пройти проверку по адресному классификатору.'");
	КонецЕсли;
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , НСтр("ru='Подтверждение'"));
	Если Ответ<>КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	РазрешитьВводАдресаВСвободнойФорме = Не РазрешитьВводАдресаВСвободнойФорме;
	СостояниеВводаПредставленияАдреса(РазрешитьВводАдресаВСвободнойФорме);
	
	Модифицированность = Истина;
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Функция МодифицированностьПриВыборе()
	Возврат Модифицированность Или Комментарий<>КопияКомментария;
КонецФункции

&НаКлиенте
Функция ВыбраноДействиеВыбора()
	Возврат Не (Модифицированность Или Комментарий<>КопияКомментария);
КонецФункции

&НаКлиенте
Процедура СброситьМодифицированностьПриВыборе()
	Модифицированность = Ложь;
	КопияКомментария   = Комментарий;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПредупредитьПослеОткрытияФормы()
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияПриОткрытии,, ПолеПредупрежденияПриОткрытии);
КонецПроцедуры

&НаСервереБезКонтекста
Функция РезультатВыбора(Контекст, ВозвращатьСписокЗначений=Ложь)
	XDTOИнформация = КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст);
	Результат      = Новый Структура("ДанныеВыбора, ОшибкиЗаполнения");
	
	Если ВозвращатьСписокЗначений Тогда
		ДанныеВыбора = КонтактнаяИнформацияСлужебный.КонтактнаяИнформацияВСтаруюСтруктуру(XDTOИнформация);
		ДанныеВыбора = ДанныеВыбора.ЗначенияПолей;
	ИначеЕсли Контекст.Страна<>Контекст.СтранаРоссия И ПустаяСтрока(Контекст.ПредставлениеИностранногоАдреса) Тогда
		// Иностранный адрес с пустой страной, вернем чистый адрес
		ДанныеВыбора = "";
	Иначе
		ДанныеВыбора = КонтактнаяИнформацияСлужебный.СериализацияКонтактнойИнформации(XDTOИнформация);
	КонецЕсли;
	
	Результат.ДанныеВыбора = Новый Структура("КонтактнаяИнформация, Представление, Комментарий, ВведеноВСвободнойФорме",
		ДанныеВыбора,
		XDTOИнформация.Представление,
		XDTOИнформация.Комментарий,
		КонтактнаяИнформацияСлужебный.АдресВведенВСвободнойФорме(XDTOИнформация));
	
	Результат.ОшибкиЗаполнения = КонтактнаяИнформацияСлужебный.ОшибкиЗаполненияАдреса(
		XDTOИнформация.Состав,
		Контекст.ВидКонтактнойИнформации);
	
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция СписокОшибокЗаполнения(Контекст)
	XDTOИнформация = КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст);
	Возврат КонтактнаяИнформацияСлужебный.ОшибкиЗаполненияАдреса(
		XDTOИнформация.Состав,
		Контекст.ВидКонтактнойИнформации);
КонецФункции

&НаСервере
Функция РезультатВыбораТолькоКомментария(КонтактнаяИнфо, Представление, Комментарий)
	
	Если ПустаяСтрока(КонтактнаяИнфо) Тогда
		НоваяКонтактная = КонтактнаяИнформацияСлужебный.ДесериализацияАдреса("");
		// Модифицируем значение "НоваяКонтактная"
		КонтактнаяИнформацияСлужебный.КомментарийКонтактнойИнформации(НоваяКонтактная, Комментарий);
		НоваяКонтактная = КонтактнаяИнформацияСлужебный.СериализацияКонтактнойИнформации(НоваяКонтактная);
		АдресВведенВСвободнойФорме = Ложь;
		
	ИначеЕсли КонтактнаяИнформацияКлиентСервер.ЭтоКонтактнаяИнформацияВXML(КонтактнаяИнфо) Тогда
		// Копия
		НоваяКонтактная = КонтактнаяИнфо;
		// Модифицируем значение "НоваяКонтактная"
		КонтактнаяИнформацияСлужебный.КомментарийКонтактнойИнформации(НоваяКонтактная, Комментарий);
		АдресВведенВСвободнойФорме = КонтактнаяИнформацияСлужебный.АдресВведенВСвободнойФорме(КонтактнаяИнфо);
		
	Иначе
		НоваяКонтактная = КонтактнаяИнфо;
		АдресВведенВСвободнойФорме = Ложь;
	КонецЕсли;
	
	Результат = Новый Структура("ДанныеВыбора, ОшибкиЗаполнения", Новый Структура, Новый СписокЗначений);
	Результат.ДанныеВыбора.Вставить("КонтактнаяИнформация", НоваяКонтактная);
	Результат.ДанныеВыбора.Вставить("Представление", Представление);
	Результат.ДанныеВыбора.Вставить("Комментарий", Комментарий);
	Результат.ДанныеВыбора.Вставить("ВведеноВСвободнойФорме", АдресВведенВСвободнойФорме);
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработкаИзмененияНаселенногоПунктаСервер(Контекст, ПереформироватьДетально=Истина)
	
	Если Контекст.КодКлассификатораНаселенногоПункта<=0 Тогда
		// Данные вводились вручную, пробуем разбор введенной строки
		АнализКлассификатора = НаселенныеПунктыПоПредставлению(
			Контекст.НаселенныйПункт, Контекст.СкрыватьНеактуальныеАдреса);
		Контекст.НаселенныйПунктНайденТочно = АнализКлассификатора.ДанныеВыбора.Количество()=1;
		Если Контекст.НаселенныйПунктНайденТочно Тогда
			ВыбранноеЗначение = АнализКлассификатора.ДанныеВыбора[0].Значение.Значение;
			Контекст.КодКлассификатораНаселенногоПункта = ВыбранноеЗначение.Код;
			Контекст.НаселенныйПункт                    = ВыбранноеЗначение.Представление;
		Иначе
			Контекст.УлицаНайденаТочно = Ложь;
			Контекст.ДомНайденТочно    = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	// Населенный пункт, разбитый по частям
	Если ПереформироватьДетально Тогда
		СформироватьДетальныйНаселенныйПункт(Контекст);
	КонецЕсли;
	
	// Перепроверяем улицу, индекс и представление обновятся там
	ОбработкаИзмененияУлицыСервер(Контекст);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработкаИзмененияУлицыСервер(Контекст)
	
	Если Контекст.КодКлассификатораУлицы<=0 Тогда
		// Данные вводились вручную, пробуем разбор введенной строки
		АнализКлассификатора = УлицыПоПредставлению(
			Контекст.КодКлассификатораНаселенногоПункта, Контекст.Улица, Контекст.СкрыватьНеактуальныеАдреса);
		Контекст.УлицаНайденаТочно = АнализКлассификатора.ДанныеВыбора.Количество()=1;
		Если Контекст.УлицаНайденаТочно Тогда
			ВыбранноеЗначение = АнализКлассификатора.ДанныеВыбора[0].Значение.Значение;
			Контекст.КодКлассификатораУлицы = ВыбранноеЗначение.Код;
			Контекст.Улица                  = ВыбранноеЗначение.Представление;
			Контекст.УлицаНайденаТочно      = Истина;
		КонецЕсли;
	Иначе
		// Соответствие улицы населенному пункту
		Контекст.УлицаНайденаТочно = ЯвляетсяПотомком(Контекст.КодКлассификатораУлицы, Контекст.КодКлассификатораНаселенногоПункта);
	КонецЕсли;
	
	// Перепроверяем дом, индекс и представление обновятся там
	ОбработкаИзмененияДомаСервер(Контекст);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработкаИзмененияДомаСервер(Контекст)
	Контекст.ДомНайденТочно = Истина;
	
	ОбновитьИндексИПредставление(Контекст);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияСтраныКлиент()
	ЭтоРоссийскийАдрес = Страна=СтранаРоссия;
	Элементы.Индекс.Видимость = ЭтоРоссийскийАдрес;
	Элементы.ТипАдреса.ТекущаяСтраница = ?(ЭтоРоссийскийАдрес, Элементы.РоссийскийАдрес, Элементы.ИностранныйАдрес);
	
	// Проверять можем только российские адреса
	Элементы.ПроверитьЗаполнениеАдреса.Доступность = ЭтоРоссийскийАдрес;
	
	// Загружать можем только российские адреса
	Если МожноЗагружатьКлассификатор Тогда
		КнопкаПанели = Элементы.Найти("ФормаЗагрузитьКлассификатор");
		Если КнопкаПанели<>Неопределено Тогда
			Элементы.ФормаЗагрузитьКлассификатор.Доступность = ЭтоРоссийскийАдрес;
		КонецЕсли;
	КонецЕсли;
	
	// Вводить в свободной форме можем только российские адреса
	Элементы.ВвестиАдресВСвободнойФорме.Доступность =  ЭтоРоссийскийАдрес;
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокВыбораЭлемента(ЭлементВид, ЭлементЗначение, Данные)
	ЭлементЗначение.КнопкаСпискаВыбора = Данные.МожноПодбиратьЗначения;
	
	СписокТипов = Данные.ВариантыТипа;
	ЭлементВид.КнопкаВыбора = СписокТипов.Количество()>0;
	Если ЭлементВид.КнопкаВыбора Тогда
		ЭлементВид.СписокВыбора.ЗагрузитьЗначения(СписокТипов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВизуализироватьКорректностьВыбора()
	
	Элементы.НаселенныйПункт.ЦветФона = ?(НаселенныйПунктНайденТочно, ЦветКорректногоПоля, АвтоЦвет);
	Элементы.Улица.ЦветФона           = ?(УлицаНайденаТочно, ЦветКорректногоПоля, АвтоЦвет);
	
	НужныйЦвет = ?(ДомНайденТочно, ЦветКорректногоПоля, АвтоЦвет);
	
	// Основные
	Элементы.ТипДома.ЦветФона = НужныйЦвет;
	Элементы.Дом.ЦветФона     = НужныйЦвет;
	
	Элементы.ТипСтроения.ЦветФона  = НужныйЦвет;
	Элементы.Строение.ЦветФона     = НужныйЦвет;
	
	Элементы.ТипПомещения.ЦветФона = НужныйЦвет;
	Элементы.Помещение.ЦветФона   = НужныйЦвет;
	
	// Дополнительные
	Для НомерСтроки=0 По ДополнительныеЗдания.Количество()-1 Цикл
		Идентификатор = Формат(НомерСтроки, "ЧН=; ЧГ=");
		Элементы["ТипСтроения" + Идентификатор].ЦветФона = НужныйЦвет;
		Элементы["Строение" + Идентификатор].ЦветФона    = НужныйЦвет;
	КонецЦикла;
	
	Для НомерСтроки=0 По ДополнительныеПомещения.Количество()-1 Цикл
		Идентификатор = Формат(НомерСтроки, "ЧН=; ЧГ=");
		Элементы["ТипПомещения" + Идентификатор].ЦветФона = НужныйЦвет;
		Элементы["Помещение" + Идентификатор].ЦветФона    = НужныйЦвет;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИндексИПредставление(Контекст, XDTOКонтактная=Неопределено)
	Инфо = ?(XDTOКонтактная=Неопределено, КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст), XDTOКонтактная);
	УстановитьЗначениеИндекса(Контекст, Инфо);
	ЗаполнитьПредставлениеАдреса(Контекст, Инфо);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеИндекса(Контекст, XDTOКонтактная=Неопределено)
	Инфо = ?(XDTOКонтактная=Неопределено, КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст), XDTOКонтактная);
	
	ИндексПоКлассификатору = КонтактнаяИнформацияСлужебный.ОпределитьПочтовыйИндексАдреса(Инфо.Состав);
	Если Не Пустаястрока(ИндексПоКлассификатору) Тогда
		Контекст.Индекс = ИндексПоКлассификатору;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПредставлениеАдреса(Контекст, XDTOКонтактная=Неопределено)
	
	// Код страны ставим всегда
	Если ТипЗнч(Контекст.Страна)=Тип("СправочникСсылка.СтраныМира") Тогда
		Контекст.КодСтраны = Контекст.Страна.Код
	Иначе
		Контекст.КодСтраны = "";
	КонецЕсли;
	
	Если Контекст.РазрешитьВводАдресаВСвободнойФорме И Контекст.ПредставлениеАдресаИзменено Тогда
		Возврат;
	КонецЕсли;
		
	Инфо = ?(XDTOКонтактная=Неопределено, КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст), XDTOКонтактная);
	Контекст.ПредставлениеАдреса = Инфо.Представление;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗначениеРеквизитовПоКонтактнойИнформации(Контекст, РедактируемаяИнформация)
	
	ДанныеАдреса = РедактируемаяИнформация.Состав;
	
	// Общие реквизиты
	Контекст.ПредставлениеАдреса = РедактируемаяИнформация.Представление;
	Контекст.Комментарий         = РедактируемаяИнформация.Комментарий;
	
	// Копия комментария для анализа измененности
	Контекст.КопияКомментария = Контекст.Комментарий;
	
	// Страна по наименованию
	НаименованиеСтраны = СокрЛП(ДанныеАдреса.Страна);
	Если ПустаяСтрока(НаименованиеСтраны) Тогда
		Контекст.Страна = Справочники.СтраныМира.ПустаяСсылка();
	Иначе
		СсылкаНаРоссию = Справочники.СтраныМира.Россия;
		Если ВРЕГ(НаименованиеСтраны)=ВРЕГ(СокрЛП(СсылкаНаРоссию.Наименование)) Тогда
			Контекст.Страна    = СсылкаНаРоссию;
			Контекст.КодСтраны = СсылкаНаРоссию.Код;
		Иначе
			ДанныеСтраны = Справочники.СтраныМира.ДанныеСтраныМира(, НаименованиеСтраны);
			Если ДанныеСтраны=Неопределено Тогда
				// Не нашли ни в справочнике, ни в классификаторе
				Контекст.Страна    = Неопределено;
				Контекст.КодСтраны = Неопределено;
			Иначе
				Контекст.Страна    = ДанныеСтраны.Ссылка;
				Контекст.КодСтраны = ДанныеСтраны.Код;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ВычисленноеПредставление = КонтактнаяИнформацияСлужебный.СформироватьПредставлениеКонтактнойИнформации(
		РедактируемаяИнформация, Контекст.ВидКонтактнойИнформации);
		
	Если КонтактнаяИнформацияСлужебный.ЭтоРоссийскийАдрес(ДанныеАдреса) Тогда
		Контекст.РазрешитьВводАдресаВСвободнойФорме = Не ПустаяСтрока(ДанныеАдреса.Состав.Адрес_по_документу);
		
		// Дополнительно проверяем случай, когда представление по документу равно вычисленному
		Если Контекст.РазрешитьВводАдресаВСвободнойФорме Тогда
			Если ПредставленияАдресаОдинаковы(ВычисленноеПредставление, ДанныеАдреса.Состав.Адрес_по_документу, Истина) 
				И ПредставленияАдресаОдинаковы(РедактируемаяИнформация.Представление, ДанныеАдреса.Состав.Адрес_по_документу, Истина) 
			Тогда
				Контекст.РазрешитьВводАдресаВСвободнойФорме = Ложь;
				ДанныеАдреса.Состав.Адрес_по_документу      = "";
			КонецЕсли;
		КонецЕсли;
	Иначе
		Контекст.ПредставлениеИностранногоАдреса = Строка(ДанныеАдреса.Состав);
	КонецЕсли;
	
	// Индекс просто ставим
	Контекст.Индекс = Формат(КонтактнаяИнформацияСлужебный.ПочтовыйИндексАдреса(ДанныеАдреса), "ЧГ=");
	
	// Синтетический "Населенный пункт" получаем как представление
	Контекст.НаселенныйПункт = КонтактнаяИнформацияСлужебный.ПредставлениеНаселенногоПункта(ДанныеАдреса);
	АнализКлассификатора = КонтактнаяИнформацияСлужебный.НаселенныеПунктыПоПредставлению(Контекст.НаселенныйПункт);
	Если АнализКлассификатора.ДанныеВыбора.Количество()=1 Тогда
		ВыбранноеЗначение = АнализКлассификатора.ДанныеВыбора[0].Значение.Значение;
		Контекст.КодКлассификатораНаселенногоПункта = ВыбранноеЗначение.Код;
		Контекст.НаселенныйПунктНайденТочно         = Истина;
		Контекст.НаселенныйПункт                    = ВыбранноеЗначение.Представление;
	Иначе
		Контекст.КодКлассификатораНаселенногоПункта = 0;
		Контекст.НаселенныйПунктНайденТочно         = Ложь;
		// Наименование населенного пункта не трогаем
	КонецЕсли;
	
	СформироватьДетальныйНаселенныйПункт(Контекст, ДанныеАдреса);
	
	// Синтетическую "Улицу" получаем как представление
	Контекст.Улица = КонтактнаяИнформацияСлужебный.ПредставлениеУлицы(ДанныеАдреса);
	АнализКлассификатора = КонтактнаяИнформацияСлужебный.УлицыПоПредставлению(Контекст.КодКлассификатораНаселенногоПункта, Контекст.Улица);
	Если АнализКлассификатора.ДанныеВыбора.Количество()=1 Тогда
		ВыбранноеЗначение = АнализКлассификатора.ДанныеВыбора[0].Значение.Значение;
		Контекст.КодКлассификатораУлицы = ВыбранноеЗначение.Код;
		Контекст.УлицаНайденаТочно      = Истина;
		Контекст.Улица                  = ВыбранноеЗначение.Представление;
	Иначе
		Контекст.КодКлассификатораУлицы = 0;
		Контекст.УлицаНайденаТочно      = Ложь;
		// Наименование улицы не трогаем
	КонецЕсли;
	
	// Дом, строение, помещение
	ЗданияИПомещения = КонтактнаяИнформацияСлужебный.ЗданияИПомещенияАдреса(ДанныеАдреса);
	
	// Первые два здания выделяем отдельно, остальное в списке
	ТаблицаДанных = ЗданияИПомещения.Здания;
	
	// Вид = 1 - признак дома, владения. Вид = 2, доп строение
	СтрокаДома = ТаблицаДанных.Найти(1, "Вид");
	Если СтрокаДома<>Неопределено Тогда
		Контекст.ТипДома = СтрокаДома.Тип;
		Контекст.Дом     = СтрокаДома.Значение;
		Контекст.ДомНайденТочно = Истина;
		ТаблицаДанных.Удалить(СтрокаДома);
	Иначе
		Контекст.ДомНайденТочно = Ложь;
	КонецЕсли;
	
	СтрокаДома = ТаблицаДанных.Найти(2, "Вид");
	Если СтрокаДома<>Неопределено Тогда
		Контекст.ТипСтроения = СтрокаДома.Тип;
		Контекст.Строение    = СтрокаДома.Значение;
		ТаблицаДанных.Удалить(СтрокаДома);
	КонецЕсли;
	
	НомерСтроки  = ТаблицаДанных.Количество();
	Пока НомерСтроки>0 Цикл 
		НомерСтроки = НомерСтроки - 1;
		ЗаполнитьЗначенияСвойств(Контекст.ДополнительныеЗдания.Вставить(0), ТаблицаДанных[НомерСтроки]);
	КонецЦикла;
	
	// Первое помещение указываем отдельно, остальные в списке
	ТаблицаДанных = ЗданияИПомещения.Помещения;
	НомерСтроки   = ТаблицаДанных.Количество();
	Если НомерСтроки>0 Тогда
		Контекст.ТипПомещения = ТаблицаДанных[0].Тип;
		Контекст.Помещение    = ТаблицаДанных[0].Значение;
	КонецЕсли;
	Пока НомерСтроки>1 Цикл 
		НомерСтроки = НомерСтроки - 1;
		ЗаполнитьЗначенияСвойств(Контекст.ДополнительныеПомещения.Вставить(0), ТаблицаДанных[НомерСтроки]);
	КонецЦикла;
	
	// Если переданное представление отличается от вычисленного, то адрес изменен
	Если Не Контекст.РазрешитьВводАдресаВСвободнойФорме И Не ПредставленияАдресаОдинаковы(Контекст.ПредставлениеАдреса, ВычисленноеПредставление) Тогда
		Контекст.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст)
	ПространствоИмен = КонтактнаяИнформацияКлиентСерверПовтИсп.ПространствоИмен();
	
	Результат = ФабрикаXDTO.Создать( ФабрикаXDTO.Тип(ПространствоИмен, "КонтактнаяИнформация") );
	Результат.Комментарий = Контекст.Комментарий;
	
	Результат.Состав = ФабрикаXDTO.Создать( ФабрикаXDTO.Тип(ПространствоИмен, "Адрес") );
	Адрес = Результат.Состав;
	
	Адрес.Страна = Строка(Контекст.Страна);
	Если ВРег(Контекст.Страна)<>ВРег(Контекст.СтранаРоссия.Наименование) Тогда
		Адрес.Состав = Контекст.ПредставлениеИностранногоАдреса;
		Результат.Представление = КонтактнаяИнформацияСлужебный.ПредставлениеАдреса(Адрес, Контекст.ВидКонтактнойИнформации);
		Возврат Результат;
	КонецЕсли;
	
	Адрес.Состав = ФабрикаXDTO.Создать( ФабрикаXDTO.Тип(ПространствоИмен, "АдресРФ") );
	АдресРФ = Адрес.Состав;
	
	// Населенный пункт
	Если Контекст.КодКлассификатораНаселенногоПункта>0 Тогда
		КонтактнаяИнформацияСлужебный.УстановитьНаселенныйПунктАдресаПоКоду(
			АдресРФ, Контекст.КодКлассификатораНаселенногоПункта);
		// Добавляем возможно непустые данные
		Для Каждого КлючЗначение Из Контекст.НаселенныйПунктДетально Цикл
			ЧастьПункта = КлючЗначение.Значение;
			ТекущееЗначение = КонтактнаяИнформацияСлужебный.ЗначениеСвойстваПоXPath(АдресРФ, ЧастьПункта.ПутьXPath);
			Если ПустаяСтрока(ТекущееЗначение) И (Не ПустаяСтрока(ЧастьПункта.Значение)) Тогда
				КонтактнаяИнформацияСлужебный.УстановитьСвойствоПоXPath(АдресРФ, ЧастьПункта.ПутьXPath, ЧастьПункта.Значение);
			КонецЕсли;
		КонецЦикла;
	Иначе
		НетДетальныхДанных = Истина;
		Для Каждого КлючЗначение Из Контекст.НаселенныйПунктДетально Цикл
			ЧастьПункта = КлючЗначение.Значение;
			Если Не ПустаяСтрока(ЧастьПункта.Значение) Тогда
				НетДетальныхДанных = Ложь;
			КонецЕсли;
			КонтактнаяИнформацияСлужебный.УстановитьСвойствоПоXPath(АдресРФ, ЧастьПункта.ПутьXPath, ЧастьПункта.Значение);
		КонецЦикла;
		Если НетДетальныхДанных Тогда
			АдресРФ.НаселПункт = Контекст.НаселенныйПункт;
		КонецЕсли;
	КонецЕсли;
	
	Если Контекст.КодКлассификатораУлицы>0 Тогда
		КонтактнаяИнформацияСлужебный.УстановитьУлицуАдресаПоКоду(АдресРФ, Контекст.КодКлассификатораУлицы);
	Иначе
		АдресРФ.Улица = Контекст.Улица;
	КонецЕсли;
	
	// Здания и помещения
	ТипТаблицаЗначений = Тип("ТаблицаЗначений");
	Если ТипЗнч(Контекст.ДополнительныеЗдания)=ТипТаблицаЗначений Тогда
		ТаблицаЗданий = Контекст.ДополнительныеЗдания.Скопировать();
	Иначе
		ТаблицаЗданий = ДанныеФормыВЗначение(Контекст.ДополнительныеЗдания, ТипТаблицаЗначений);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Контекст.Дом) Тогда
		СтрокаЗдания = ТаблицаЗданий.Вставить(0);
		СтрокаЗдания.Тип      = Контекст.ТипДома;
		СтрокаЗдания.Значение = Контекст.Дом;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Контекст.Строение) Тогда
		СтрокаЗдания = ТаблицаЗданий.Вставить(0);
		СтрокаЗдания.Тип      = Контекст.ТипСтроения;
		СтрокаЗдания.Значение = Контекст.Строение;
	КонецЕсли;
	
	Если ТипЗнч(Контекст.ДополнительныеПомещения)=ТипТаблицаЗначений Тогда
		ТаблицаПомещений = Контекст.ДополнительныеПомещения.Скопировать();
	Иначе
		ТаблицаПомещений = ДанныеФормыВЗначение(Контекст.ДополнительныеПомещения, ТипТаблицаЗначений);
	КонецЕсли;
	
	Если Не ПустаяСтрока(Контекст.Помещение) Тогда
		СтрокаЗдания = ТаблицаЗданий.Вставить(0);
		СтрокаЗдания.Тип      = Контекст.ТипПомещения;
		СтрокаЗдания.Значение = Контекст.Помещение;
	КонецЕсли;
	
	КонтактнаяИнформацияСлужебный.ЗданияИПомещенияАдреса(АдресРФ, 
		Новый Структура("Здания, Помещения", ТаблицаЗданий, ТаблицаПомещений));
	
	// Индекс
	КонтактнаяИнформацияСлужебный.ПочтовыйИндексАдреса(АдресРФ, Контекст.Индекс);
	
	// Представление и свободный ввод адреса
	РасчетноеПредставление = КонтактнаяИнформацияСлужебный.ПредставлениеАдреса(Адрес, Контекст.ВидКонтактнойИнформации);
	ВведенноеПредставление = СокрЛП(Контекст.ПредставлениеАдреса);
	Если Контекст.РазрешитьВводАдресаВСвободнойФорме И Контекст.ПредставлениеАдресаИзменено Тогда
		Если ПредставленияАдресаОдинаковы(ВведенноеПредставление, РасчетноеПредставление) Тогда
			Результат.Представление = РасчетноеПредставление;
			АдресРФ.Сбросить("Адрес_по_документу");
		Иначе
			Результат.Представление    = ВведенноеПредставление;
			АдресРФ.Адрес_по_документу = ВведенноеПредставление;
		КонецЕсли;
	Иначе
		АдресРФ.Сбросить("Адрес_по_документу");
		Результат.Представление = РасчетноеПредставление;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

// Перезаполняет структуру "НаселенныйПунктДетально" по текущим данным адреса или по данным реквизитов формы
&НаСервереБезКонтекста
Процедура СформироватьДетальныйНаселенныйПункт(Контекст, XDTOДанныеАдреса=Неопределено)
	
	Если XDTOДанныеАдреса=Неопределено И Контекст.КодКлассификатораНаселенногоПункта>0 Тогда
		// Перезаполняем
		Контекст.НаселенныйПунктДетально = КонтактнаяИнформацияСлужебный.СписокРеквизитовНаселенныйПункт(
			Контекст.КодКлассификатораНаселенногоПункта);
		Возврат;
	ИначеЕсли ТипЗнч(XDTOДанныеАдреса)=Тип("Строка") Тогда
		// Попытка разбора
		АнализКлассификатора = НаселенныеПунктыПоПредставлению(XDTOДанныеАдреса, Контекст.СкрыватьНеактуальныеАдреса);
		Если АнализКлассификатора.ДанныеВыбора.Количество()=1 Тогда
			Вариант = АнализКлассификатора.ДанныеВыбора[0].Значение.Значение;
			Контекст.НаселенныйПунктДетально = КонтактнаяИнформацияСлужебный.СписокРеквизитовНаселенныйПункт(Вариант.Код);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Контекст.НаселенныйПунктДетально = КонтактнаяИнформацияСлужебный.СписокРеквизитовНаселенныйПункт();
	
	Если XDTOДанныеАдреса=Неопределено Тогда
		// Из реквизитов формы все идет в предопределенный детальный пункт
		Для Каждого КлючЗначение Из Контекст.НаселенныйПунктДетально Цикл
			Значение = КлючЗначение.Значение;
			Если Значение.Предопределенный Тогда
				Значение.Значение = Контекст.НаселенныйПункт;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	// Из переданного XDTO
	АдресРФ = КонтактнаяИнформацияСлужебный.РоссийскийАдрес(XDTOДанныеАдреса);
	Если АдресРФ<>Неопределено Тогда
		Для Каждого КлючЗначение Из Контекст.НаселенныйПунктДетально Цикл
			Значение = КлючЗначение.Значение;
			ЗначениеЗначения = КонтактнаяИнформацияСлужебный.ЗначениеСвойстваПоXPath(АдресРФ, Значение.ПутьXPath);
			
			Части = КонтактнаяИнформацияКлиентСервер.НаименованиеСокращение(ЗначениеЗначения);
			Значение.Наименование = Части.Наименование;
			Значение.Сокращение   = Части.Сокращение;
			Значение.Значение     = ЗначениеЗначения;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьГруппуЭлементов(Группа)
	Пока Группа.ПодчиненныеЭлементы.Количество()>0 Цикл
		Элемент = Группа.ПодчиненныеЭлементы[0];
		Если ТипЗнч(Элемент)=Тип("ГруппаФормы") Тогда
			УдалитьГруппуЭлементов(Элемент);
		КонецЕсли;
		Элементы.Удалить(Элемент);
	КонецЦикла;
	Элементы.Удалить(Группа);
КонецПроцедуры

&НаСервере
Функция ОтрисоватьДополнительныеЗданияИПомещения() 
	Возврат Новый Структура("ИмяЗдания, ИмяПомещения",
		ОтрисоватьДополнительныеЗдания(),
		ОтрисоватьДополнительныеПомещения());
КонецФункции

&НаСервере
Функция ОтрисоватьДополнительныеЗдания() 
	
	Удалять = Новый Массив;
	Пока Элементы.ГруппаСтроенияДополнительно.ПодчиненныеЭлементы.Количество()>0 Цикл
		Группа = Элементы.ГруппаСтроенияДополнительно.ПодчиненныеЭлементы[0];
		Если ТипЗнч(Группа)=Тип("ГруппаФормы") Тогда
			Идентификатор = Сред(Группа.Имя, 1 + СтрДлина("ГруппаСтроение"));
			Если Не ПустаяСтрока(Идентификатор) Тогда
				Удалять.Добавить("ТипСтроения" + Идентификатор);
				Удалять.Добавить("Строение"    + Идентификатор);
				КомандаУдалить = Команды.Найти("УдалитьСтроение" + Идентификатор);
				Если КомандаУдалить<>Неопределено Тогда
					Команды.Удалить(КомандаУдалить);
				КонецЕсли;
			КонецЕсли;
			УдалитьГруппуЭлементов(Группа);
		Иначе
			Элементы.Удалить(Группа);
		КонецЕсли;
	КонецЦикла;
	ИзменитьРеквизиты(,Удалять);
	
	КоличествоЗданий = ДополнительныеЗдания.Количество()-1;
	КоличествоТипов  = Элементы.ТипСтроения.СписокВыбора.Количество()-2;
	
	Результат = Неопределено;
	Для НомерСтроки=0 По КоличествоЗданий Цикл
		Строка = ДополнительныеЗдания[НомерСтроки];
		Идентификатор = Формат(НомерСтроки, "ЧН=; ЧГ=");
		
		НоваяГруппа = Элементы.Добавить("ГруппаСтроение" + Идентификатор, Тип("ГруппаФормы"), Элементы.ГруппаСтроенияДополнительно);
		ЗаполнитьЗначенияСвойств(НоваяГруппа, Элементы.ГруппаСтроениеНачальное, , "ПутьКДаннымЗаголовка");
		
		НовыйТип = Элементы.Добавить("ТипСтроения" + Идентификатор, Тип("ПолеФормы"), НоваяГруппа);
		ЗаполнитьЗначенияСвойств(НовыйТип, Элементы.ТипСтроения, , "ПутьКДанным, СписокВыбора, ВыделенныйТекст, СвязьПоТипу");
		НовыйТип.СписокВыбора.ЗагрузитьЗначения(Элементы.ТипСтроения.СписокВыбора.ВыгрузитьЗначения());
		НовыйТип.УстановитьДействие("ПриИзменении", "Подключаемый_ТипСтроенияПриИзменении");
		
		НовыйЭлемент = Элементы.Добавить("Строение" + Идентификатор, Тип("ПолеФормы"), НоваяГруппа);
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.Строение, , "ПутьКДанным, СписокВыбора, ВыделенныйТекст, СвязьПоТипу");
		НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(Элементы.Строение.СписокВыбора.ВыгрузитьЗначения());
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_СтроениеПриИзменении");
		
		Если НомерСтроки=КоличествоЗданий Тогда
			Результат = НовыйЭлемент.Имя;
		КонецЕсли;
		
		Добавлять = Новый Массив;
		Добавлять.Добавить(Новый РеквизитФормы(НовыйТип.Имя, Новый ОписаниеТипов("Строка")));
		Добавлять.Добавить(Новый РеквизитФормы(НовыйЭлемент.Имя, Новый ОписаниеТипов("Строка")));
		
		ИзменитьРеквизиты(Добавлять);
		ЭтаФорма[НовыйТип.Имя]     = Строка.Тип;
		ЭтаФорма[НовыйЭлемент.Имя] = Строка.Значение;
		
		НовыйТип.ПутьКДанным     = НовыйТип.Имя;
		НовыйЭлемент.ПутьКДанным = НовыйЭлемент.Имя;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Подключаемый_ТипСтроенияПриИзменении(Элемент)
	НомерСтроки = Сред(Элемент.Имя, 1 + СтрДлина("ТипСтроения"));
	СтрокаЗданий = ДополнительныеЗдания.Получить(НомерСтроки);
	СтрокаЗданий.Тип = ЭтаФорма[Элемент.Имя];
	СтрокаЗданий.ПутьXPath = КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(СтрокаЗданий.Тип);
	
	Контекст = КонтекстФормыКлиент();
	ОбновитьИндексИПредставление(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СтроениеПриИзменении(Элемент)
	НомерСтроки = Сред(Элемент.Имя, 1 + СтрДлина("Строение"));
	СтрокаЗданий = ДополнительныеЗдания.Получить(НомерСтроки);
	СтрокаЗданий.Значение = ЭтаФорма[Элемент.Имя];
	
	Контекст = КонтекстФормыКлиент();
	ОбновитьИндексИПредставление(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ОтрисоватьДополнительныеПомещения()
	
	Удалять = Новый Массив;
	Пока Элементы.ГруппаПомещенияДополнительно.ПодчиненныеЭлементы.Количество()>0 Цикл
		Группа = Элементы.ГруппаПомещенияДополнительно.ПодчиненныеЭлементы[0];
		Если ТипЗнч(Группа)=Тип("ГруппаФормы") Тогда
			Идентификатор = Сред(Группа.Имя, 1 + СтрДлина("ГруппаПомещение"));
			Если Не ПустаяСтрока(Идентификатор) Тогда
				Удалять.Добавить("ТипПомещения" + Идентификатор);
				Удалять.Добавить("Помещение"    + Идентификатор);
				КомандаУдалить = Команды.Найти("УдалитьПомещение" + Идентификатор);
				Если КомандаУдалить<>Неопределено Тогда
					Команды.Удалить(КомандаУдалить);
				КонецЕсли;
			КонецЕсли;
			УдалитьГруппуЭлементов(Группа);
		Иначе
			Элементы.Удалить(Группа);
		КонецЕсли;
	КонецЦикла;
	ИзменитьРеквизиты(,Удалять);
	
	КоличествоПомещений = ДополнительныеПомещения.Количество()-1;
	КоличествоТипов     = Элементы.ТипПомещения.СписокВыбора.Количество()-2;
	
	Результат = Неопределено;
	Для НомерСтроки=0 По КоличествоПомещений Цикл
		Строка = ДополнительныеПомещения[НомерСтроки];
		Идентификатор = Формат(НомерСтроки, "ЧН=; ЧГ=");
		
		НоваяГруппа = Элементы.Добавить("ГруппаПомещение" + Идентификатор, Тип("ГруппаФормы"), Элементы.ГруппаПомещенияДополнительно);
		ЗаполнитьЗначенияСвойств(НоваяГруппа, Элементы.ГруппаПомещениеНачальное, , "ПутьКДаннымЗаголовка");
		
		НовыйТип = Элементы.Добавить("ТипПомещения" + Идентификатор, Тип("ПолеФормы"), НоваяГруппа);
		ЗаполнитьЗначенияСвойств(НовыйТип, Элементы.ТипПомещения, , "ПутьКДанным, СписокВыбора, ВыделенныйТекст, СвязьПоТипу");
		НовыйТип.СписокВыбора.ЗагрузитьЗначения(Элементы.ТипПомещения.СписокВыбора.ВыгрузитьЗначения());
		НовыйТип.УстановитьДействие("ПриИзменении", "Подключаемый_ТипПомещенияПриИзменении");
		
		НовыйЭлемент = Элементы.Добавить("Помещение" + Идентификатор, Тип("ПолеФормы"), НоваяГруппа);
		ЗаполнитьЗначенияСвойств(НовыйЭлемент, Элементы.Помещение, , "ПутьКДанным, СписокВыбора, ВыделенныйТекст, СвязьПоТипу");
		НовыйЭлемент.СписокВыбора.ЗагрузитьЗначения(Элементы.Помещение.СписокВыбора.ВыгрузитьЗначения());
		НовыйЭлемент.УстановитьДействие("ПриИзменении", "Подключаемый_ПомещениеПриИзменении");
		
		Если НомерСтроки=КоличествоПомещений Тогда
			Результат = НовыйЭлемент.Имя;
		КонецЕсли;
		
		Добавлять = Новый Массив;
		Добавлять.Добавить(Новый РеквизитФормы(НовыйТип.Имя, Новый ОписаниеТипов("Строка")));
		Добавлять.Добавить(Новый РеквизитФормы(НовыйЭлемент.Имя, Новый ОписаниеТипов("Строка")));
		
		ИзменитьРеквизиты(Добавлять);
		ЭтаФорма[НовыйТип.Имя]     = Строка.Тип;
		ЭтаФорма[НовыйЭлемент.Имя] = Строка.Значение;
		
		НовыйТип.ПутьКДанным     = НовыйТип.Имя;
		НовыйЭлемент.ПутьКДанным = НовыйЭлемент.Имя;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура Подключаемый_ТипПомещенияПриИзменении(Элемент)
	НомерСтроки = Сред(Элемент.Имя, 1 + СтрДлина("ТипПомещения"));
	СтрокаПомещений = ДополнительныеПомещения.Получить(НомерСтроки);
	СтрокаПомещений.Тип = ЭтаФорма[Элемент.Имя];
	СтрокаПомещений.ПутьXPath = КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(СтрокаПомещений.Тип);
	
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПомещениеПриИзменении(Элемент)
	НомерСтроки = Сред(Элемент.Имя, 1 + СтрДлина("Помещение"));
	СтрокаЗданий = ДополнительныеПомещения.Получить(НомерСтроки);
	СтрокаЗданий.Значение = ЭтаФорма[Элемент.Имя];
	
	Контекст = КонтекстФормыКлиент();
	ЗаполнитьПредставлениеАдреса(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте 
Процедура СообщитьОбОшибкахЗаполнения(СписокОшибок, ПредупреждатьОбОтсутствии)
	
	ОчиститьСообщения();
	
	Если СписокОшибок.Количество()=0 И ПредупреждатьОбОтсутствии Тогда
		Предупреждение(НСтр("ru='Адрес введен корректно.'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из СписокОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Элемент.Представление,,,
			ПутьКДаннымФормыПоПутиXPath(Элемент.Значение));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Функция ПутьКДаннымФормыПоПутиXPath(ПутьXPath) 
	
	Если ПутьXPath="СубъектРФ" Тогда
		Возврат "НаселенныйПункт";
		
	ИначеЕсли ПутьXPath="Округ" Тогда
		Возврат "НаселенныйПункт";
		
	ИначеЕсли ПутьXPath=КонтактнаяИнформацияКлиентСерверПовтИсп.XPathРайона() Тогда
		Возврат "НаселенныйПункт";
		
	ИначеЕсли ПутьXPath="Город" Тогда
		Возврат "НаселенныйПункт";
		
	ИначеЕсли ПутьXPath="ВнутригРайон" Тогда
		Возврат "НаселенныйПункт";
		
	ИначеЕсли ПутьXPath="НаселПункт" Тогда
		Возврат "НаселенныйПункт";
		
	ИначеЕсли ПутьXPath="Улица" Тогда
		Возврат "Улица";
		
	ИначеЕсли ПутьXPath=КонтактнаяИнформацияКлиентСерверПовтИсп.XPathПочтовогоИндекса() Тогда
		Возврат "Индекс";
		
	ИначеЕсли ПутьXPath=КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(ТипДома) Тогда
		Возврат "Дом";
		
	ИначеЕсли ПутьXPath=КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(ТипСтроения) Тогда
		Возврат "Строение";
		
	ИначеЕсли ПутьXPath=КонтактнаяИнформацияКлиентСерверПовтИсп.XPathНомераДополнительногоОбъектаАдресации(ТипПомещения) Тогда
		Возврат "Помещение";
		
	Иначе
		// Дополнительно добавленные
		Фильтр = Новый Структура("ПутьXPath", ПутьXPath);
		Строки = ДополнительныеЗдания.НайтиСтроки(Фильтр); 
		Если Строки.Количество()>0 Тогда
			Возврат "Строение" + Формат(ДополнительныеЗдания.Индекс(Строки[0]), "ЧН=; ЧГ=");
		КонецЕсли;
		
		Строки = ДополнительныеПомещения.НайтиСтроки(Фильтр); 
		Если Строки.Количество()>0 Тогда
			Возврат "Помещение" + Формат(ДополнительныеПомещения.Индекс(Строки[0]), "ЧН=; ЧГ=");
		КонецЕсли;
	КонецЕсли;
	
	Возврат "";
КонецФункции

&НаКлиенте
Процедура ОчиститьАдресКлиент()
	
	Контекст = КонтекстФормыКлиент();
	ОчиститьАдресСервер(Контекст);
	КонтекстФормыКлиент(Контекст);
	
	ВизуализироватьКорректностьВыбора();
	
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ОчиститьАдресСервер(Контекст)
	
	Если Контекст.Страна<>Контекст.СтранаРоссия Тогда
		Контекст.ПредставлениеИностранногоАдреса = "";
		Возврат;
	КонецЕсли;
	
	Контекст.Комментарий = "";
	
	Контекст.Индекс = Неопределено;
	
	Контекст.КодКлассификатораНаселенногоПункта = 0;
	Контекст.НаселенныйПунктНайденТочно         = Ложь;
	Контекст.НаселенныйПункт                    = "";
	Контекст.НаселенныйПунктДетально = КонтактнаяИнформацияСлужебный.СписокРеквизитовНаселенныйПункт();
	
	Контекст.КодКлассификатораУлицы = 0;
	Контекст.УлицаНайденаТочно      = Ложь;
	Контекст.Улица = "";
	
	Контекст.ТипДома      = КонтактнаяИнформацияКлиентСервер.ПервыйИлиПустой(Элементы.ТипДома.СписокВыбора);
	Контекст.ТипСтроения  = КонтактнаяИнформацияКлиентСервер.ПервыйИлиПустой(Элементы.ТипСтроения.СписокВыбора);
	Контекст.ТипПомещения = КонтактнаяИнформацияКлиентСервер.ПервыйИлиПустой(Элементы.ТипПомещения.СписокВыбора);
	
	Контекст.Дом       = "";
	Контекст.Строение  = "";
	Контекст.Помещение = "";
	
	Контекст.ДомНайденТочно = Ложь;
	
	Контекст.ДополнительныеЗдания.Очистить();
	Контекст.ДополнительныеПомещения.Очистить();
	
	XDTOКонтактнаяИнфо = КонтактнаяИнформацияПоЗначениюРеквизитов(Контекст);
	СформироватьДетальныйНаселенныйПункт(Контекст, XDTOКонтактнаяИнфо.Состав);
	ЗаполнитьПредставлениеАдреса(Контекст, XDTOКонтактнаяИнфо);
	
	// Очищаем непосредственно на форме, в контексте уже очищено
	ДополнительныеЗдания.Очистить();
	ДополнительныеПомещения.Очистить();
	ОтрисоватьДополнительныеЗданияИПомещения();
КонецПроцедуры

&НаКлиенте
Функция НеиспользованныеЭлементыДополнительнойТаблицы(ТаблицаДанных, ЭлементИсточник, ЗначениеМаркера)
	Использованные = Новый Соответствие;
	Использованные.Вставить(ЭтаФорма[ЭлементИсточник.Имя], Истина);
	Для Каждого Строка Из ТаблицаДанных Цикл
		Использованные.Вставить(Строка.Тип, Истина);
	КонецЦикла;
	
	Результат = Новый СписокЗначений;
	Для Каждого ЭлементСписка Из ЭлементИсточник.СписокВыбора Цикл
		Если Использованные[ЭлементСписка.Значение]=Неопределено Тогда
			Результат.Добавить(ЗначениеМаркера, ЭлементСписка.Значение, ЭлементСписка.Пометка, ЭлементСписка.Картинка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция МожноДобавлятьДополнительныеОбъекты()
	ВариантыСтроения  = НеиспользованныеЭлементыДополнительнойТаблицы(ДополнительныеЗдания, Элементы.ТипСтроения, 1);
	ВариантыПомещения = НеиспользованныеЭлементыДополнительнойТаблицы(ДополнительныеПомещения, Элементы.ТипПомещения, 2);
	Возврат ВариантыСтроения.Количество() + ВариантыПомещения.Количество() > 0
КонецФункции

&НаСервере
Процедура УстановитьКлючИспользованияФормы()
	КлючСохраненияПоложенияОкна = Строка(Страна);
	
	Количество = 0;
	Для Каждого Строка Из ДополнительныеЗдания Цикл
		Если Не ПустаяСтрока(Строка.Значение) Тогда
			Количество = Количество + 1;
		КонецЕсли;
	КонецЦикла;
	КлючСохраненияПоложенияОкна = КлючСохраненияПоложенияОкна + "/" + Формат(Количество, "ЧН=; ЧГ=");
	
	Количество = 0;
	Для Каждого Строка Из ДополнительныеПомещения Цикл
		Если Не ПустаяСтрока(Строка.Значение) Тогда
			Количество = Количество + 1;
		КонецЕсли;
	КонецЦикла;
	
	КлючСохраненияПоложенияОкна = КлючСохраненияПоложенияОкна + "/" + Формат(Количество, "ЧН=; ЧГ=");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////////////////////////

&НаСервереБезКонтекста
Функция РезультатыАвтоПодбораНаселенногоПункта(Текст, СкрыватьНеактуальныеАдреса=Ложь, ПредупреждатьОНеактуальных=Истина)
	Возврат КонтактнаяИнформацияСлужебный.РезультатыАвтоПодбораНаселенногоПункта(
		Текст, СкрыватьНеактуальныеАдреса, ПредупреждатьОНеактуальных);
КонецФункции

&НаСервереБезКонтекста
Функция НаселенныеПунктыПоПредставлению(Текст, СкрыватьНеактуальныеАдреса=Ложь, ВыбиратьСтрок=50)
	Возврат КонтактнаяИнформацияСлужебный.НаселенныеПунктыПоПредставлению(
		Текст, СкрыватьНеактуальныеАдреса, ВыбиратьСтрок);
КонецФункции

&НаСервереБезКонтекста
Функция РезультатыАвтоПодбораУлицы(КодНаселенногоПункта, Текст, СкрыватьНеактуальныеАдреса=Ложь, ПредупреждатьОНеактуальных=Истина)
	Возврат КонтактнаяИнформацияСлужебный.РезультатыАвтоПодбораУлицы(
		КодНаселенногоПункта, Текст, СкрыватьНеактуальныеАдреса, ПредупреждатьОНеактуальных);
КонецФункции

&НаСервереБезКонтекста
Функция УлицыПоПредставлению(КодНаселенногоПункта, Текст, СкрыватьНеактуальныеАдреса=Ложь, ВыбиратьСтрок=50)
	Возврат КонтактнаяИнформацияСлужебный.УлицыПоПредставлению(
		КодНаселенногоПункта, Текст, СкрыватьНеактуальныеАдреса, ВыбиратьСтрок);
КонецФункции

&НаСервереБезКонтекста
Функция ЯвляетсяПотомком(КодКлассификатораУлицы, КодКлассификатораНаселенногоПункта)
	Возврат КонтактнаяИнформацияСлужебный.ЯвляетсяПотомком(КодКлассификатораУлицы, КодКлассификатораНаселенногоПункта);
КонецФункции

// Преобразовываем Реквизиты формы <-> Структура
&НаКлиенте
Функция КонтекстФормыКлиент(НовыеДанные=Неопределено)
	СписокРеквизитов = "
		|ВидКонтактнойИнформации,
		|Страна, КодСтраны, СтранаРоссия, СкрыватьНеактуальныеАдреса,
		|Индекс, ПредставлениеАдреса, ПредставлениеИностранногоАдреса, Комментарий,
		|НаселенныйПункт, КодКлассификатораНаселенногоПункта, НаселенныйПунктДетально, НаселенныйПунктНайденТочно,
		|Улица, КодКлассификатораУлицы, УлицаНайденаТочно,
		|ТипДома, Дом, ДомНайденТочно, ТипСтроения, Строение, ТипПомещения, Помещение,
		|РазрешитьВводАдресаВСвободнойФорме, ПредставлениеАдресаИзменено
		|";
		
	СписокКоллекций = "ДополнительныеЗдания, ДополнительныеПомещения";
	
	Если НовыеДанные=Неопределено Тогда
		// Читаем
		Результат = Новый Структура(СписокРеквизитов + "," + СписокКоллекций);
		ЗаполнитьЗначенияСвойств(Результат, ЭтаФорма, СписокРеквизитов + "," + СписокКоллекций);
		Возврат Результат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, НовыеДанные, СписокРеквизитов, СписокКоллекций);
	ЗаполнитьЗначенияКоллекций(ЭтаФорма, НовыеДанные, СписокКоллекций);
	
	Возврат НовыеДанные;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЗначенияКоллекций(Приемник, Источник, СписокСвойств)
	Для Каждого КлючЗначение Из Новый Структура(СписокСвойств) Цикл
		ИмяСвойства = КлючЗначение.Ключ;
		СвойствоПриемник = Приемник[ИмяСвойства];
		СвойствоПриемник.Очистить();
		Для Каждого Значение Из Источник[ИмяСвойства] Цикл
			ЗаполнитьЗначенияСвойств(СвойствоПриемник.Добавить(), Значение);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Разрешение элементов для ввода в свободном формате
//
// Параметры:
//    - Режим                    - Истина - можно редактировать представление адреса, Ложь - нельзя
//    - ФормироватьПредставление - необязательный флаг. По умолчанию установлен.
//
&НаКлиенте
Процедура СостояниеВводаПредставленияАдреса(Режим, ФормироватьПредставление=Истина)
	Элемент = Элементы.ПредставлениеАдреса;
	
	Элемент.РедактированиеТекста = Режим;
	Если Режим Тогда
		Элемент.РедактированиеТекста = Истина;
		Элемент.ЦветФона = АвтоЦвет;
	Иначе
		Элемент.РедактированиеТекста = Ложь;
		Элемент.ЦветФона = ЦветФонаФормы;
		
		Если ФормироватьПредставление Тогда
			Контекст = КонтекстФормыКлиент();
			ЗаполнитьПредставлениеАдреса(Контекст);
			КонтекстФормыКлиент(Контекст);
		КонецЕсли;
	КонецЕсли;
	
	// Остальные поля ввода
	СостояниеГруппыВвода(Элементы.СтранаАдреса, Не Режим);
	СостояниеГруппыВвода(Элементы.ТипАдреса, Не Режим);
	
	Элементы.ВвестиАдресВСвободнойФорме.Пометка = Режим;
	
	// Проверять адрес, введенный вручную нельзя
	Если Страна=СтранаРоссия Тогда
		Элементы.ПроверитьЗаполнениеАдреса.Доступность = Не Режим;
	КонецЕсли;
	
	// Страна - по прежнему управляющее поле
	Если Элементы.Страна.Доступность Тогда
		Элементы.Страна.ЦветФона = ЦветФонаУправляющегоПоля;
	КонецЕсли;
	
	// Переключаем заголовок представления и текущий элемент ввода для индикации режима
	Если Режим Тогда
		Элементы.ПредставлениеАдреса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		Элементы.ПредставлениеАдреса.Заголовок          = НСтр("ru='Адрес в свободной форме'");
		
		Элементы.ГруппаПредставления.Отображение = ОтображениеОбычнойГруппы.Нет;
		Элементы.СтранаАдреса.Отображение        = Элементы.ГруппаПредставления.Отображение;
		
		ТекущийЭлемент = Элементы.ПредставлениеАдреса;
	Иначе 
		Элементы.ПредставлениеАдреса.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элементы.ПредставлениеАдреса.Заголовок          = "";
		
		Элементы.ГруппаПредставления.Отображение = ОбщегоНазначенияКлиентСервер.ОтображениеОбычнойГруппыОтступ();
		Элементы.СтранаАдреса.Отображение        = Элементы.ГруппаПредставления.Отображение;
		
		ТекущийЭлемент = Элементы.НаселенныйПункт;
	КонецЕсли;
	
КонецПроцедуры

// Установка доступности элементов в группе
//
// Параметры:
//    - Группа - ГруппаФормы - Контейнер для элементов.
//    - Режим  - Булево      - Флаг разрешения элементов. Истина - разрешены, Ложь - нет
//
&НаКлиенте
Процедура СостояниеГруппыВвода(Группа, Режим)
	
	Для Каждого Элемент Из Группа.ПодчиненныеЭлементы Цикл
		ТипЭлемента = ТипЗнч(Элемент);
		Если ТипЭлемента=Тип("ГруппаФормы") Тогда
			Если Элемент<>Элементы.ГруппаПредставления И Элемент<>Элементы.ИностранныйАдрес Тогда
				СостояниеГруппыВвода(Элемент, Режим);
			КонецЕсли;
			
		ИначеЕсли ТипЭлемента=Тип("КнопкаФормы") Тогда
			Если Элемент=Элементы.ДобавитьОбъект Тогда
				Элемент.Доступность = Режим И МожноДобавлятьДополнительныеОбъекты();
			Иначе
				Элемент.Доступность = Режим;
			КонецЕсли;
			
		ИначеЕсли ТипЭлемента=Тип("ПолеФормы") И Элемент.Вид=ВидПоляФормы.ПолеВвода Тогда
			Элемент.ТолькоПросмотр = Не Режим;
			Элемент.ЦветФона = ?(Режим, АвтоЦвет, ЦветФонаФормы);
			
		Иначе 
			Элемент.Доступность = Режим;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Представление разрешено менять только при вводе в режиме ввода в свободной форме
// Поэтому необходимо привести остальные поля к измененному представлению
// Страну не трогаем, режим свободного ввода возможен только в России
//
&НаСервере
Процедура ПредставлениеАдресаПриИзмененииСервер()
	
	// Пытаемся разобрать заново
	XDTOКонтактная = КонтактнаяИнформацияСлужебный.ПарсингКонтактнойИнформации(ПредставлениеАдреса, ВидКонтактнойИнформации);
	
	// Представление
	КонтактнаяИнформацияСлужебный.ПредставлениеКонтактнойИнформации(XDTOКонтактная, ПредставлениеАдреса);
	
	// Комментарий
	КонтактнаяИнформацияСлужебный.КомментарийКонтактнойИнформации(XDTOКонтактная, Комментарий);
	
	// И проставляем в реквизиты, кроме страны и представления
	ТекущееПредставление = ПредставлениеАдреса;
	ТекущаяСтрана        = Страна;
	
	ОчиститьАдресСервер(ЭтаФорма);
	
	// Возможно будет отключен свободного ввода
	ЗначениеРеквизитовПоКонтактнойИнформации(ЭтаФорма, XDTOКонтактная);
	
	ПредставлениеАдреса = ТекущееПредставление;
	Страна              = ТекущаяСтрана;
	
	ОтрисоватьДополнительныеЗданияИПомещения();
	
	// Включаем режим свободного ввода принудительно
	РазрешитьВводАдресаВСвободнойФорме = Истина;
	Модифицированность = Истина;
КонецПроцедуры

// Сравниваем два представления на эквивалентность
&НаСервереБезКонтекста
Функция ПредставленияАдресаОдинаковы(Знач Представление1, Знач Представление2, Знач ИгнорироватьЗнакНомера=Ложь)
	Возврат ХешПредставления(Представление1, ИгнорироватьЗнакНомера)=ХешПредставления(Представление2, ИгнорироватьЗнакНомера);
КонецФункции

&НаСервереБезКонтекста
Функция ХешПредставления(Знач Представление, Знач ИгнорироватьЗнакНомера=Ложь)
	Результат = СтрЗаменить(Представление, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, " ", "");
	Если ИгнорироватьЗнакНомера Тогда
		Результат = СтрЗаменить(Результат, "№", "");
	КонецЕсли;
	Возврат ВРег(Результат);
КонецФункции
