
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", Новый Структура("РодительскийДоговор", ПолучитьРодительскийДоговор(ПараметрКоманды)));
	ПараметрыОткрытия.Вставить("ПоказыватьВсе", Истина);
	
	ОткрытьФорму("Справочник.Договоры_ат.ФормаСписка", ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

Функция   ПолучитьРодительскийДоговор(Договор)
	
	Возврат ?(Договор.Родитель.Пустая(), Договор, Договор.Родитель);
	
КонецФункции
