////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с файлами".
// Устаревший модуль. Будет удален в следующей редакции БСП.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
// Устаревший программный интерфейс. Будет удален в следующей редакции БСП.

// Устарела. Будет удалена в следующей редакции БСП. Следует использовать
// ту же процедуру в модуле РаботаСФайламиПереопределяемый.
//
Процедура ЗаполнитьРеквизитыФайлаИзИсходногоФайла(НовыйФайл, ИсходныйФайл) Экспорт
	
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции БСП.
// Типы владельцев назначаются как и прежде. См. документацию.
//
Функция ПолучитьТипыВладельцаФайла() Экспорт
	
	Возврат "";
	
КонецФункции

// Устарела. Будет удалена в следующей редакции БСП. Следует использовать
// ту же процедуру в модуле РаботаСФайламиПереопределяемый.
//
Процедура ПриОсвобожденииФайла(ДанныеФайла, УникальныйИдентификатор) Экспорт
	
	
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции БСП. Следует использовать
// ту же процедуру в модуле РаботаСФайламиПереопределяемый.
//
Процедура ПриЗахватеФайла(ДанныеФайла, УникальныйИдентификатор) Экспорт
	
	
	
КонецПроцедуры

// Устарела. Будет удалена в следующей редакции БСП. Следует использовать
// ту же процедуру в модуле РаботаСФайламиПереопределяемый.
//
Процедура ПриСозданииФайла(ДанныеФайла) Экспорт
	
	
	
КонецПроцедуры

