
&НаКлиенте
Процедура ЗакрытьИПередать(Команда)
	
	Значения = Новый Структура;
	ПолучитьСтруктуруОтветныхДанных(Значения);
	Закрыть(Значения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Значения = Новый Структура;
	ПолучитьСтруктуруОтветныхДанных(Значения);
	Закрыть(Значения);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//Если Параметры.Свойство("Владелец") Тогда 
	//	Владелец = Параметры.Владелец;
	//КонецЕсли;
	
	Если Параметры.Свойство("ТригерИзменения") тогда
		Если 	Параметры.ТригерИзменения = 2 тогда
			Если Параметры.Свойство("Интерфейс") Тогда // ссыль пришла
				
			//	Если Параметры.
				MAC 							= Параметры.Интерфейс.АдресMAC;
				MTU							= Параметры.Интерфейс.MTU;
				ВидСетевогоАдаптера	= Параметры.Интерфейс.ТипСетевогоАдаптера;
				ВиртуальнаяСеть			= Параметры.Интерфейс.ВиртуальнаяСеть;
				НеУстанавливатьIP		= Параметры.Интерфейс.НеУстанавливатьIP;
				Владелец					= Параметры.Интерфейс.Владелец;
				Наименование				= Параметры.Интерфейс.Наименование;
				ПометкаУдаления		= Ложь;
				НовыйЭлемент				= Истина;
				ТригерИзменения 		= Параметры.ТригерИзменения;
				Измененно					= Ложь;
				Интерфейс					= Параметры.Интерфейс;
								
				
			Иначе   // контролька
				СБЩ = Новый СообщениеПользователю;
				СБЩ.Текст = "Ошибка в передачи данных, нет данных о изначальном интерфейсе - не пришла ссылка";
				СБщ.Сообщить();
			КонецЕсли;
			
			
		ИначеЕсли 	Параметры.ТригерИзменения = 2 тогда
		ИначеЕсли 	Параметры.ТригерИзменения = 3 тогда
		ИначеЕсли 	Параметры.ТригерИзменения = 4 тогда
		ИначеЕсли 	Параметры.ТригерИзменения = 5 тогда
			
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	
	//Если	Параметры.Свойство("Измененный") 
	//	и	Параметры.Свойство("Новый") 
	//	и 	Параметры.Свойство("Интерфейс") Тогда
	//			
	//	Если Параметры.Измененный = Истина и Параметры.Новый = Ложь Тогда 
	//		НовыйЭлемент				= Параметры.Новый;
	//		MAC 							= Параметры.Интерфейс.АдресMAC;
	//		MTU							= Параметры.Интерфейс.MTU;
	//		ВидСетевогоАдаптера	= Параметры.Интерфейс.ТипСетевогоАдаптера;
	//		ВиртуальнаяСеть			= Параметры.Интерфейс.ВиртуальнаяСеть;
	//		НеУстанавливатьIP		= Параметры.Интерфейс.НеУстанавливатьIP;
	//		Измененный				= Параметры.Измененный;
	//		//Наименование				= Неопределено; => не определяем, но требуем заполнения
	//				
	//	КонецЕсли;
	//	Если Параметры.Измененный = Истина и Параметры.Новый = Истина Тогда 
	//		
	//		НовыйЭлемент				= Параметры.Новый;
	//		MAC 							= Параметры.Интерфейс.АдресMAC;
	//		MTU							= Параметры.Интерфейс.MTU;
	//		ВидСетевогоАдаптера	= Параметры.Интерфейс.ТипСетевогоАдаптера;
	//		ВиртуальнаяСеть			= Параметры.Интерфейс.ВиртуальнаяСеть;
	//		НеУстанавливатьIP		= Параметры.Интерфейс.НеУстанавливатьIP;
	//		//Наименование				= Неопределено; => не определяем, но требуем заполнения
	//		Измененный				= Параметры.Измененный;		
	//		
	//	КонецЕсли;

	//	
	//	Если Параметры.Измененный = Ложь и Параметры.Новый = Истина Тогда 
	//		
	//		НовыйЭлемент				= Параметры.Новый;
	//		Измененный				= Параметры.Измененный;
	//		
	//	КонецЕсли;
	//
	//КонецЕсли;
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСтруктуруОтветныхДанных(Значения)
	
	Значения.Вставить("Владелец",						Владелец);
	Значения.Вставить("Наименование",				Наименование);
	Значения.Вставить("MAC", 							MAC);
	Значения.Вставить("MTU", 							MTU);
	Значения.Вставить("ВидСетевогоАдаптера", 	ВидСетевогоАдаптера);
	Значения.Вставить("ВиртуальнаяСеть", 			ВиртуальнаяСеть);
	Значения.Вставить("НеУстанавливатьIP", 		НеУстанавливатьIP);
	Значения.Вставить("НовыйЭлемент",				НовыйЭлемент);
	Значения.Вставить("ТригерИзменения", 			ТригерИзменения);
	Значения.Вставить("Интерфейс",					Интерфейс);
	
КонецПроцедуры
