#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Взаимодействия.ПользовательЯвляетсяОтветственнымЗаВедениеПапок(Владелец) Тогда
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Данная операция доступна только ответственному за ведение папок для данной учетной записи'"),
	                                                  Ссылка,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
