// @comm
&НаСервере
Процедура ПриЗаписи(Отказ,Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 
	 "ВЫБРАТЬ
	 |	ФильтрыСообщений_ат.Ссылка,
	 |	ФильтрыСообщений_ат.Владелец
	 |ИЗ
	 |	Справочник.ФильтрыСообщений_ат КАК ФильтрыСообщений_ат
	 |ГДЕ
	 |	ФильтрыСообщений_ат.Владелец = &Владелец" ;
	 
	 Запрос.УстановитьПараметр("Владелец", ЭтотОбъект.Ссылка);
	 
	 ТаблицаПодчиненныхЭлементов = Запрос.Выполнить().Выгрузить();
	 
	 Если ЭтотОбъект.ПометкаУдаления Тогда 
		 ЗначениеПометкиУдаления = Истина;
		 ОбработчикиСобытийДляПочтовыхДокументов_ат.УдалитьДвиженияВРССообщенияВГруппах(ЭтотОбъект.Ссылка);	 
	 Иначе
		 ЗначениеПометкиУдаления = Ложь;
	 КонецЕсли;
	 Для Каждого Элемент Из ТаблицаПодчиненныхЭлементов Цикл
		 ФильтрОбъект = Элемент.Ссылка.ПолучитьОбъект();
		 ФильтрОбъект.ПометкаУдаления = ЗначениеПометкиУдаления;
		 ФильтрОбъект.Записать();
	 КонецЦикла;
КонецПроцедуры
