
// Функция возвращает список доступных пользователю групп сообщений
// Параметры:
// Пользователь - пользователь или группа пользователей для которых требуется получить список
// 
Функция ПолучитьДоступныеГруппыСообщений(Пользователь)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПраваПользователейГруппСообщений_ат.ГруппаСообщений,
	|	ПраваПользователейГруппСообщений_ат.Администрирование,
	|	ПраваПользователейГруппСообщений_ат.Чтение,
	|	ПраваПользователейГруппСообщений_ат.Запись,
	|	ПраваПользователейГруппСообщений_ат.Уведомление
	|ИЗ
	|	РегистрСведений.ПраваПользователейГруппСообщений_ат КАК ПраваПользователейГруппСообщений_ат
	|ГДЕ
	|	ПраваПользователейГруппСообщений_ат.Пользователь = &Пользователь
	|	И ПраваПользователейГруппСообщений_ат.Чтение = ИСТИНА" ;
	
	запрос.УстановитьПараметр("Пользователь", Пользователь);
	ТаблицаГруппПользователей = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаГруппПользователей;
	
КонецФункции
