
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("ВидРолиСервера");
	Поля.Добавить("Владелец");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Строка(Данные.ВидРолиСервера)
		+ ?(ПустаяСтрока(Данные.Наименование), "", " (" + Данные.Наименование + ")")
		+ " <" + Строка(Данные.Владелец) + ">";
	
	//Данные.Наименование
	//	+ ?(СтрНайти(Данные.Наименование, Данные.ВидРолиСервера) = 0,
	//		 " (" + Данные.ВидРолиСервера + ")", "")
	//	+ " <" + Строка(Данные.Владелец) + ">";
	
КонецПроцедуры
