
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетРесурсов_ат Расход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Движение = Движения.УчетРесурсов_ат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер;
	Движение.ВыделенныйСервер = ВыделенныйСервер;
	Движение.Договор = Договор;	
	Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.Core;
	Движение.ЗначениеРесурса = Core;

	// регистр УчетРесурсов_ат Расход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Движение = Движения.УчетРесурсов_ат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер;
	Движение.Договор = Договор;	
	Движение.ВыделенныйСервер = ВыделенныйСервер;
	Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.RAM;
	Движение.ЗначениеРесурса = RAM;

	// регистр УчетРесурсов_ат Расход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Движение = Движения.УчетРесурсов_ат.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
Если ВыделенныйСервер.ФизическийСервер.Лезвие = Истина тогда
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер.СХД_ат[0].СХД_ат;
Иначе 
	Движение.Сервер = ВыделенныйСервер.ФизическийСервер;
КонецЕсли;
	Движение.ВыделенныйСервер = ВыделенныйСервер;
	Движение.Договор = Договор;
	Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат;
	Движение.ЗначениеРесурса = HDD_ат;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
		Если НЕ ПометкаУдаления = Ссылка.ПометкаУдаления И ПометкаУдаления = истина тогда
		 	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Договоры_ат.Ссылка
		|ИЗ
		|	Справочник.Договоры_ат КАК Договоры_ат
		|ГДЕ
		|	Договоры_ат.Основание = &Основание
		|	И Договоры_ат.ПометкаУдаления = &ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Основание", 			ЭтотОбъект.ДокументОснование);
	Запрос.УстановитьПараметр("ПометкаУдаления", 	ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		дог = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект;
		дог.ПометкаУдаления = истина;
		//дог.Записать;
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	конецЕсли;

КонецПроцедуры

