////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

//предназначена для формирования структуры, содержащей
//имена обязательных ревизитов
//Параметры- <нет>
//Возвращаемое значение - Структура
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	//
	//Структура = Новый Структура;
	//Возврат Структура;
	
КонецФункции


//
//
Процедура ПередЗаписью(Отказ)
	
	////SA {
	//Если ОбменДанными.Загрузка Тогда
	//	Возврат;
	//КонецЕсли;
	////SA }
	//
	//Если ЭтоНовый() Тогда
	//	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//КонецЕсли;
	//
	////КЛА ( Данила
	//Подпись = Обработки.RegExp_кла.УдалитьВсеНеприемлимыеДляXDTOСимволы(Подпись);
	////КЛА )
	
КонецПроцедуры
