
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Параметр "ОстаткиНачалоПериода" выставляем здесь т.к. через выражение в схеме срабатывает только если заполнен Период.
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОстаткиНачалоПериода", Дата(1, 1, 1, 0, 0, 1));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Периодичность", Периодичность);
	
	ИсходныйВариант = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИсходныйВариант"));
	
	Если ИсходныйВариант.Значение = "ОстаткиПоДоговорам" Тогда
		
		Отчеты_ат.ПриКомпоновкеРезультата(ЭтотОбъект);
		
		Возврат;
		
	КонецЕсли;
	
	Если Периодичность = 0 Тогда
		
		КомпоновщикНастроек.Настройки.Структура[0].Использование = Ложь;
		КомпоновщикНастроек.Настройки.Структура[1].Использование = Истина;
		
	Иначе
		
		КомпоновщикНастроек.Настройки.Структура[0].Использование = Истина;
		КомпоновщикНастроек.Настройки.Структура[1].Использование = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры
