
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  //СтандартнаяОбработка = ложь;
		//Если Параметры.Свойство("Сервер") И ЗначениеЗаполнено(Параметры.Сервер) Тогда
		////	
		////	ПараметрСервер = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Сервер"));
		////	ПараметрСервер.Значение		=  Параметры.Сервер;
		////	ПараметрСервер.Использование	= Истина;

		//КонецЕсли;
	
		Если Параметры.Свойство("НачалоПериода")	И ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
			
			//ПараметрНачПер 					= Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеНастройки.
			ПараметрНачПер 					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));
			ПараметрНачПер.Значение		= Параметры.НачалоПериода;
			ПараметрНачПер.Использование	= Истина;
		Иначе
			списокПараметров 				= Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.элементы;
			//Для Каждого Элемент из списокПараметров цикл
			//	
			//	Если Элемент.Параметр = ПараметрКомпоновкиДанных("НачалоПериода") тогда
			//	КонецЕсли;
			//	
			//КонецЦикла;
			списокПараметров.Найти(Новый ПараметрКомпоновкиДанных("НачалоПериода"))
			
			
		КонецЕсли;
	
		Если Параметры.Свойство("КонецПериода") 	И ЗначениеЗаполнено(Параметры.КонецПериода) Тогда

			ПараметрКонПер					= Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));
			ПараметрКонПер.Значение		= Параметры.КонецПериода;
			ПараметрКонПер.Использование	= Истина;

		КонецЕсли;
	
КонецПроцедуры
