&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.ВиртуальнаяСеть) Тогда 
		Элементы.ВиртуальнаяСеть.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Владелец) Тогда 
		Элементы.Владелец.Доступность = Ложь;
	КонецЕсли;

	Если Параметры.Свойство("Сервер") И ЗначениеЗаполнено(Параметры.Сервер) Тогда
		
		Сервер = Параметры.Сервер;
		
	КонецЕсли;
	ПроверкаОтображения();
КонецПроцедуры

&НаКлиенте
Процедура IPПриИзменении(Элемент)
	
	ФормированиеНаименования();
	
КонецПроцедуры


Процедура ФормированиеНаименования()
	
	Объект.Наименование = Строка(Объект.IP) +"_" + Строка(Объект.Владелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ВладелецПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура ВладелецПриИзмененииНаСервере()

	Объект.ВиртуальнаяСеть = Объект.Владелец.ВиртуальнаяСеть;
	ФормированиеНаименования();

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.IP = РаботаССерверамиСлужебный_ат.ПреобразоватьIPВЧисло(ТекущийОбъект.ПредставлениеIP);
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаОтображения()
	
	Элементы.Сервер.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Сервер) Тогда
		Элементы.Сервер.Видимость = истина;
	КонецЕсли;
	
КонецПроцедуры
