
// Процедура предназначена для дополнения дополнительных свойств формы.
//
// Параметры:
//	ДопСвойстваФормы - Структура - Структура дополнительных свойств формы.
// 
Процедура ДополнитьСтруктуруДополнительныхСвойствФормы(ДопСвойстваФормы) Экспорт
	
	//ДопСвойстваФормы.Добавить("Свойство", Значение);
	
КонецПроцедуры 

// Функция предназначена для настройки использования механизма сохранения настроек.
//
// Параметры:
//	ЭтаФорма - УправляемаяФорма - Форма передаваемая для анализа.
//
// Возвращаемое значение:
//  Булево
// 
Функция   ИспользоватьУправлениеНастройкамиФормы(ЭтаФорма) Экспорт
	
	Возврат Ложь;
	
КонецФункции 
