////////////////////////////////////////////////////////////////////////////////
// Подсистема "Контактная информация".
// Устаревший модуль. Будет удален в следующей редакции БСП.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
// Устаревший программный интерфейс. Будет удален в следующей редакции БСП.

// Устарела. Определяет соответствие адреса КЛАДРу по переданным индексу, региону, району, городу, населенному пункту,
// улице, дому и корпусу.
//
// Параметры:
//	УказанныйИндекс - Строка - индекс
//	НазваниеРегиона - Строка - название региона(с сокращением)
//	НазваниеРайона - Строка - название района(с сокращением)
//	НазваниеГорода - Строка - название города(с сокращением)
//	НазваниеНаселенногоПункта - Строка - название населенного пункта(с сокращением)
//	НазваниеУлицы - Строка - название улицы(с сокращением)
//	НомерДома - Строка - номер дома, для которого необходимо получить индекс
//	НомерКорпуса - Строка - номер корпуса
//
// Возвращаемое значение:
//	Структура с полями:
//		Регион - Структура - структура полей найденного региона
//		Район - Структура - структура полей найденного района
//		Город - Структура - структура полей найденного города
//		НаселенныйПункт - Структура - структура полей найденного населенного пункта
//		Улица - Структура - структура полей найденной улицы
//		Дом - Структура - структура полей найденного дома
//		ЕстьОшибки - Булево - найдены ли ошибки при проверке
//		СтруктураОшибок - Структура - структура в которой в качестве ключа выступает название элемента
//			а в качестве значения - подробный текст ошибки.
//
Функция ПроверитьСоответствиеАдресаКЛАДРу(УказанныйИндекс = "", НазваниеРегиона = "", НазваниеРайона = "",
	НазваниеГорода = "", НазваниеНаселенногоПункта = "", НазваниеУлицы = "", НомерДома = "", НомерКорпуса = "") Экспорт
	
	Если ОбщегоНазначенияКлиентСервер.ПодсистемаСуществует("СтандартныеПодсистемы.АдресныйКлассификатор") Тогда
		МодульАдресныйКлассификатор = ОбщегоНазначенияКлиентСервер.ОбщийМодуль("АдресныйКлассификатор");
		Возврат МодульАдресныйКлассификатор.ПроверитьСоответствиеАдресаКЛАДРу(УказанныйИндекс, 
			НазваниеРегиона, НазваниеРайона, НазваниеГорода, НазваниеНаселенногоПункта, 
			НазваниеУлицы, НомерДома);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Устарела. Определяет Используются ли в конфигурации классификаторы
//
// Возвращаемое значение:
//  Булево - Истина, если используются, Ложь - иначе.
//
Функция ИспользуютсяКлассификаторы() Экспорт
	
	ИспользуютсяКлассификаторы = Ложь;
	
	УправлениеКонтактнойИнформацией.ПриОпределенииИспользованияКлассификатора(ИспользуютсяКлассификаторы);
	
	Возврат ИспользуютсяКлассификаторы;
	
КонецФункции

// Устарела. Возвращает строку(структуру) адресного классификатора по значениям адресных элементов
//
// Параметры:
//	НазваниеРегиона - название региона( с сокращением)
//	НазваниеРайона - название района( с сокращением)
//	НазваниеГорода - название города( с сокращением)
//	НазваниеНаселенногоПункта - название населенного пункта( с сокращением)
//	НазваниеУлицы - название улицы( с сокращением)
//
// Возвращаемое значение:
//	Неопределено или Структура - Структура полей по найденому адресному элементу (см. функцию "АдресныйКлассификаторКлиентСервер.ПустаяСтруктураАдреса()")
//
Функция ВернутьСтрокуАдресногоКлассификатораПоАдреснымЭлементам(Знач НазваниеРегиона, Знач НазваниеРайона,
	Знач НазваниеГорода, Знач НазваниеНаселенногоПункта, Знач НазваниеУлицы) Экспорт
	
	СтруктураАдресногоКлассификатора = Неопределено;
	
	УправлениеКонтактнойИнформацией.ПриОпределенииСтрокиАдресногоКлассификатораПоАдреснымЭлементам(СтруктураАдресногоКлассификатора, НазваниеРегиона, НазваниеРайона,
		НазваниеГорода, НазваниеНаселенногоПункта, НазваниеУлицы);
	
	Возврат СтруктураАдресногоКлассификатора;
	
КонецФункции

