
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Строка(Данные.Ссылка.ТипДоступа) + " - " + Данные.Ссылка.Логин + " - " + Данные.Ссылка.Наименование;
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьАдминистративныеДоступыКОССервера(Сервер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доступы.Логин,
	|	Доступы.Пароль,
	|	Доступы.Ссылка
	|ИЗ
	|	Справочник.Доступы_ат КАК Доступы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭкземплярыПродуктов_ат КАК ЭкземплярыПродуктов
	|		ПО Доступы.Владелец = ЭкземплярыПродуктов.Ссылка
	|ГДЕ
	|	Доступы.ТипДоступа = &ТипДоступа
	|	И НЕ Доступы.ПометкаУдаления
	|	И ЭкземплярыПродуктов.РольСервераРазмещения.Владелец = &Сервер
	|	И ЭкземплярыПродуктов.РольСервераРазмещения.ВидРолиСервера.ТипРолиСервера = &ТипРолиСервера
	|	И ЭкземплярыПродуктов.ТекущийПродукт.ТипПродукта В (&ТипПродукта)
	|	И НЕ ЭкземплярыПродуктов.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("Сервер", Сервер);
	Запрос.УстановитьПараметр("ТипДоступа", Перечисления.ТипыДоступа_ат.Администратор);
	Запрос.УстановитьПараметр("ТипРолиСервера", Перечисления.ТипыРолейСерверов_ат.РазмещениеОС);
	
	ТипыПродукта = Новый Массив;
	ТипыПродукта.Добавить(Перечисления.ТипыПродуктов_ат.СерверMSWindows);
	ТипыПродукта.Добавить(Перечисления.ТипыПродуктов_ат.Сервер_nix);
	Запрос.УстановитьПараметр("ТипПродукта", ТипыПродукта);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Стр = Новый Структура;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр.Вставить("Логин",  ВыборкаДетальныеЗаписи.Логин);
			Стр.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
			Стр.Вставить("Доступ", ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		Возврат Стр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция   ПолучитьДоступыКЭП(ЭП, ТипыДоступа = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Доступы.Логин,
	|	Доступы.Пароль,
	|	Доступы.Ссылка
	|ИЗ
	|	Справочник.ЭкземплярыПродуктов_ат КАК ЭкземплярыПродуктов_ат
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Доступы_ат КАК Доступы
	|		ПО ЭкземплярыПродуктов_ат.Ссылка = Доступы.Владелец
	|ГДЕ
	|	ЭкземплярыПродуктов_ат.Ссылка = &ЭП
	|	И (НЕ Доступы.ПометкаУдаления)";
	
	Если ТипыДоступа <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Доступы.ТипДоступа В(&ТипыДоступа)";
		
		Запрос.УстановитьПараметр("ТипыДоступа", ТипыДоступа);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЭП", ЭП);

	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Стр = Новый Структура;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Стр.Вставить("Логин",  ВыборкаДетальныеЗаписи.Логин);
			Стр.Вставить("Пароль", ВыборкаДетальныеЗаписи.Пароль);
			Стр.Вставить("Доступ", ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		Возврат Стр;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
