
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОткрытия.Вставить("КлючВарианта", "ОстаткиПоДоговорам");
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты_ат") Тогда
		
		ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Клиент", ПараметрКоманды));
		
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Договоры_ат") Тогда
		
		РодительскийДоговор = ПолучитьРодительскийДоговор(ПараметрКоманды);
		
		ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Договор", РодительскийДоговор));
		
	КонецЕсли;
	
	ОткрытьФорму("Отчет.ДвиженияПоСчетамКлиентов_ат.Форма", ПараметрыОткрытия,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьРодительскийДоговор(Договор)
	
	Возврат ?(Договор.Родитель.Пустая(), Договор, Договор.Родитель);
	
КонецФункции
