
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если 		ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.РолиСерверов_ат") Тогда
		
		ПараметрИмя = "РольСервераРазмещения";
		
	ИначеЕсли 	ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты_ат") Тогда
		
		ПараметрИмя = "Клиент";
		
	ИначеЕсли 	ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Серверы_ат") Тогда
		
		ПараметрИмя = "СерверРазмещения";
		
	ИначеЕсли 	ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ВерсииПродуктов_ат") Тогда
		
		ПараметрИмя = "ТекущаяВерсия";
		
	ИначеЕсли 	ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Продукты_ат") Тогда
		
		ПараметрИмя = "ТекущийПродукт";
		
	ИначеЕсли 	ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ПоставкиПродуктов_ат") Тогда
		
		ПараметрИмя = "Владелец";
		
	Иначе
		
		ПараметрИмя = "";
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ПараметрИмя) Тогда
		
		фиксНастройки = Новый НастройкиКомпоновкиДанных;
		
		эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПараметрИмя);
		эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		эОтбор.ПравоеЗначение = ПараметрКоманды;
		эОтбор.Использование = Истина;
		
		//эОтбор.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ФиксированныеНастройки", фиксНастройки);
		//ПараметрыФормы = Новый Структура("Отбор", Новый Структура(ПараметрИмя, ПараметрКоманды));
		ПараметрыФормы.Вставить("НеСохранятьПользовательскиеНастройки", Истина);
		
	Иначе
		
		ПараметрыФормы = Новый Структура();
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ЭкземплярыПродуктов_ат.ФормаСписка", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
